{
    "locations": [
        {
            "cardID": "Bifröst0",
            "locationName": "Bifröst island",
            "addedText": "You wake up.",
            "nextCardsID": [
                "Death"
            ]
        },
        {
            "cardID": "Death",
            "locationName": "?",
            "addedText": "Oops, you seem to have died.",
            "nextCardsID": [
                "Bifröst0"
            ]
        },
        {
            "cardID": "Insanity",
            "locationName": "?",
            "addedText": "Oh dear. The pressures of the world seem to have driven you over the brink of insanity.",
            "nextCardsID": [
                "Bifröst0"
            ]
        }
    ],
    "actions": [
        {
            "cardID": "Island",
            "locationName": "Bifröst island",
            "addedText": "You wake up.",
            "nextCardsID": [
                "Bifröst0"
            ]
        }
    ],
    "stories": [
        {
            "cardID": "Medusa0",
            "locationName": "?",
            "locationDescription": "",
            "addedText": "You dream of darkness<br><br>You dream of screams<br><br>You dream of the cold<br><br><br><br><em>[draw a card to play]</em>",
            "nextCardsID": [
                "Medusa1",
                "MedusaA"
            ]
        },
        {
            "cardID": "MedusaA",
            "locationName": "A",
            "locationDescription": "AA",
            "cardText": "MedusaA",
            "addedText": "MedusaA",
            "reqs": [
                {"reqName": "Royal shilling",
                "reqRule": "=",
                "reqQuantity": 10}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "Medusa2"
            ]
        },
        {
            "cardID": "MedusaB",
            "locationName": "B",
            "locationDescription": "BB",
            "cardText": "MedusaB",
            "addedText": "MedusaB",
            "nextCardsID": [
                "Medusa2"
            ]
        },
        {
            "cardID": "Medusa1",
            "locationName": "The Medusa",
            "locationDescription": "Inside a choatic cabin",
            "backColor": "red",
            "cardText": "Wake Up",
            "addedText": "You realize that you are not dreaming. You have woken up. The darkness, the cold, the screams - they are all real. In addition, gravity doesn’t seem to be working properly.<br><br>You can’t see anything in the pitch black, and it is hard to get your bearings in this commotion. But amidst the shouting, your mind hones in on one thought: there was a lantern near your bunk.<br><br><em>[You will only succeed if you you have a good Eye. You need to roll a 4 or higher to find the lantern]</em>",
            "nextCardsID": [
                "Medusa2"
            ]
        },
        {
            "cardID": "Medusa2",
            "cardText": "Search for the Lantern",
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "lantern",
                "rewardQuantity": 1},
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": 10}
            ],
            "challengeSuccessCards": [
                "Medusa3",
                "Medusa4"
            ],
            "challengeSuccessText": "<em>[Now you have a 1% better chance of receiving a bonus the next time you rely on your Eye. Also your Eye gained 2 points of experience. When you reach 3 points, your bonus will increase even more]</em><br><br>You grope around in the darkness in the general area where you think the lantern was. Your fingers make contact with the still-warm metal, and you open the shutter. Your light helps another passenger get their own lantern working too. Now you can shed some light on what’s going on. ",
            "challengeFailRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": 10}
            ],
            "challengeFailCards": [
                "Medusa3",
                "Medusa4"
            ],
            "challengeFailText": "<em>[Oh well, at least now you have a 2% better chance of receiving a bonus the next time you rely on your Eye. Also your Eye gained 4 points of experience. When you reach 5 points, your bonus will increase even more]</em><br><br>You grope around in the darkness in the general area where you think the lantern was, but you can’t seem to find anything there. Someone else finds their own lantern and illuminates the scene before you. ",
            "addedText": "<br><br>You are in a wooden room, surrounded by other panicking souls wearing their nightclothes. The floor and all of the walls around you are crooked. Water is pooling up in the lowest corner of the room.<br><br>“We’re sinking! The ship is sinking!” Someone cries out. You remember now, you're halfway across the ocean on board the Medusa. Perhaps not the most appropriate name for a vessel?<br><br>“Remain calm!” orders a middle-aged man who thinks he has control over the situation. The deck and walls do not agree. They groan and tilt even more. Several of the bunks come unbolted from the floor, and slide across the room. <br><br>There is only one door to this cabin. It is free of water - for the time being. At this rate, the Medusa isn’t going to stay afloat much longer. You give it 10 minutes tops."
        },
        {
            "cardID": "Medusa3",
            "cardText": "Search for your belongings",
            "addedText": "You spend a few meagre moments searching, but many of your belongings have been scattered around the room. There is too little light and too much chaos to find them. You are able to grab your satchel though, which contains a few useful possessions. You rush toward the door.<br><br><em>[This next challenge requires you to have skill with your Hand instead]</em>",
            "rewards": [
                {"rewardName": "satchel",
                "rewardQuantity": 1},
                {"rewardName": "Royal shilling",
                "rewardQuantity": 117},
                {"rewardName": "inkwell",
                "rewardQuantity": 1},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "Medusa5"
            ]
        },
        {
            "cardID": "Medusa4",
            "cardText": "Hurry to the door",
            "addedText": "You try to rush toward the door. Amidst all the chaos though, that is easier said than done. A few bunks have toppled over and are blocking your path.<br><br><em>[This next challenge requires you to have skill with your Hand instead]</em>",
            "rewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "Medusa5"
            ]
        },
        {
            "cardID": "Medusa5",
            "cardText": "Climb over the bunks",
            "challengeStat": "Hand",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa6"
            ],
            "challengeSuccessText": "You find a path over some toppled wardrobes that brings you directly to the door. Several others follow your route over the debris. ",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa6"
            ],
            "challengeFailText": "You have trouble finding your way through the toppled furniture, cursing when the jagged edge of a broken bedpost scrapes you along the thigh. ",
            "addedText": "The door of the cabin is jammed shut. The tiny glimmer of light peeking through the cracks show that in some areas the frame is pulled away from the door, and in others, it is pressed tight. The ship’s tilting must be putting enormous strain on the walls. That is not a good sign."
        },
        {
            "cardID": "Medusa6",
            "cardText": "Force the door open",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "Health",
                "rewardQuantity": -5},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],

            "challengeSuccessCards": [
                "Medusa7"
            ],
            "challengeSuccessText": "With a squeal of wood on wood, the door flies open under the force of your shoulder. The dark cabin is immediately invaded by the blaze of a lightning strike, as well as a large panicking man in a green nightgown. ",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -10},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa7"
            ],
            "challengeFailText": "Your shoulder is displaced more easily than the door. You step back to take another run at it, when the door bursts open inward, propelled by a large man in a green nightgown. ",
            "addedText": "“My paintings! My paintings! Where are my masterpieces!” the man in the green nightgown yells, shoving past people to get into the room."
        },
        {
            "cardID": "Medusa7",
            "cardText": "Convince the man to flee",
            "challengeStat": "Voice",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa8"
            ],
            "challengeSuccessText": "You tell the man that he’s as good as dead if he goes in to look for his paintings. Seeing the water filling the room, he realizes that his safety is more important than his valuables. ",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa8"
            ],
            "challengeFailText": "You tell the man that he’s as good as dead if he goes in to look for his paintings. Your words have no effect, as he shoves you violently out of his way and runs to the back of the cabin, searching for his possessions. ",
            "addedText": "There are two children here in this cabin - they really should be the first to escape."
        },
        {
            "cardID": "Medusa8",
            "cardText": "Help the children escape first",
            "locationDescription": "A ferocious storm threatens the lilting ship",
            "challengeStat": "Heart",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 2},
                {"rewardName": "Health",
                "rewardQuantity": -5},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa9",
                "Medusa10"
            ],
            "challengeSuccessText": "Using your words as much your own body, you manage to hold back several men and women, insisting that the children leave before anyone else. ",
            "challengeFailRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "Health",
                "rewardQuantity": -10},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa9",
                "Medusa10"
            ],
            "challengeFailText": "Using your words as much your own body, you try to hold back the crowd so that the children can leave. But several men and women barge through, shoving you to the floor and pushing their way out first. ",
            "addedText": "Following the children out the door, you rush along a short hall and up a ladder. The scene outside the ship’s cabin is one of pandemonium. The night sky is a churning mass of dark clouds. The Medusa is assaulted by wind and rain. The crewmembers who have remained at their posts are trying their best, but they cannot take command of the flailing rigging. A large wave hits the ship and a mast sweeps into the mainsail, tearing through the fabric. Ominous creaking sounds are coming from somewhere - possibly everywhere.<br><br>You can see three lifeboats are already in the ocean, two of which are still upright. One more is about to be launched, but it is very quickly filling up with people."
        },
        {
            "cardID": "Medusa9",
            "locationDescription": "A ferocious storm threatens the lilting ship",
            "cardText": "Quickly search for abandoned valuables",
            "addedText": "Anything that isn’t nailed down has gone overboard. Even some things that were nailed down have gone overboard. You really need to get into that lifeboat.",
            "rewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "Medusa10"
            ]
        },
        {
            "cardID": "Medusa10",
            "cardText": "Hurry to the nearest lifeboat",
            "addedText": "There are three men in crew uniforms standing in front of the lifeboat. They brandish sabres. “The lifeboat is for children and the elderly only!” one yells. “The ship is still safe. It is leaning, but will remain afloat! All others must remain on board to wait for help to come!”<br><br>There are no children or elderly nearby, and many of the crewmembers already seem to be in lifeboats. You suspect that these three are just waiting for some of their comrades and then they’ll be on the lifeboat too, leaving you and the other passengers behind. How will you attempt to get on the boat?",
            "rewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "Medusa11",
                "Medusa12",
                "Medusa13",
                "Medusa14",
                "Medusa15",
                "Medusa16",
                "Medusa17"
            ]
        },
        {
            "cardID": "Medusa11",
            "cardText": "Wait for the crew to let you on",
            "addedText": "The three sabre-weilding crewmembers are not letting anyone on the lifeboat, even though there are no children or elderly waiting to get on. Another sail tears loose as a strong wave hits the ship. The three crew start yelling at their mates to come over to the lifeboat. It is clear that the lifeboat isn’t going to be around much longer - the ship may not be either. You really need to get into that lifeboat.",
            "hiddenIfReqsFail": true,
            "rewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "reqs": [
                {"reqName": "minute until The Medusa sinks",
                "reqRule": ">",
                "reqQuantity": 1,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "Medusa11",
                "Medusa12",
                "Medusa13",
                "Medusa14",
                "Medusa15",
                "Medusa16",
                "Medusa17"
            ]
        },
        {
            "cardID": "Medusa12",
            "cardText": "Force your way onto the lifeboat",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "With a punch to the throat and a knee to a chest, you shove your way past the first crewmember.<br><br>“Fine, you just get on then,” one of the others says, “but no one else!” ",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "You take a swing at the first crewmember. He dodges, grabs your arm and pins you against the bulwark.<br><br>“You wanna get past me? Fine. Go right ahead!” he says as and another crewmember grabs your other arm and they throw you over the edge of the ship. You go tumbling through the air and land with a crash into the roiling, icy ocean. "
        },
        {
            "cardID": "Medusa13",
            "cardText": "Climb the rigging and drop down onto the lifeboat",
            "challengeStat": "Hand",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "You double back and leap onto a cabin roof, made easier by the fact that the walls are no longer quite vertical. You shimmy up a pole, where you cross over to a rope that passes over the heads of the crewmembers, allowing you to drop down into the lifeboat. They are too busy yelling at the passengers to notice you. ",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "You leap onto a cabin roof, made easier by the fact that the walls are no longer quite vertical. You shimmy up a pole, where you cross over to a rope that passes over the heads of the crewmembers, you attempt to slide along the rope, but it is slick with rain and your grip fails you. You fall, smashing your left leg into the bulwark as you tumble overboard, landing with a crash into the roiling, icy ocean. "
        },
        {
            "cardID": "Medusa14",
            "cardText": "Plead with the sailor emotionally",
            "challengeStat": "Heart",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "“Please, you have to let me on the lifeboat! I’m the sole breadwinner for my family,” you lie. ”There are seven children. And my mother - she is sick and needs me to pay for her medication! If you let me die here, you’ll be sentencing them all to death!”<br><br>You must be a good actor - or just lucky. The leader of the three sailors says a few expletives and shoves you onto the lifeboat. ",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "“Please, you have to let me on the lifeboat! I’m the sole breadwinner for my family,” you lie. ”There are seven children. And my mother - she is sick and needs me to pay for her medication! If you let me die here, you’ll be sentencing them all to death!”<br><br>“We’re all in the same boat here, pal. You wanna get back to them so bad? We'll lend you a hand!”<br><br>The three sailors decide to make an example of you to the crowd and grab your limbs and throw you over the edge of the ship. You go tumbling through the air and land with a crash into the roiling, icy ocean. "
        },
        {
            "cardID": "Medusa15",
            "cardText": "Search for another way onto the lifeboat",
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "You realize that since there is a ladder on this side of the lifeboat, and it appears to be symmetrical, there must be one on the other side too, facing the ocean. You step back from the crowd and rush around to the stern of the lifeboat. Gingerly, you leap over the edge of the ship, carefully still holding on. You cross hand over hand, holding onto the railing, making your way to the lifeboat’s other ladder. The rain chills your hands to the bone, but you manage to climb the other ladder and discretely enter the back of the lifeboat. ",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "You realize that since there is a ladder on this side of the lifeboat, and it appears to be symmetrical, there must be one on the other side too, facing the ocean. You step back from the crowd and rush around to the stern of the lifeboat. Gingerly, you leap over the edge of the ship, carefully still holding on. You cross hand over hand, holding onto the railing, making your way to the lifeboat’s other ladder.<br><br>“Oh, no you don’t” says one of the sailors as he realizes what you are doing. Exposed as you are, you can do nothing to defend yourself. He runs over to you and bashes the butt of his sabre into your knuckles. Your hands give way and you plummet overboard, landing with a crash into the roiling, icy ocean. "
        },
        {
            "cardID": "Medusa16",
            "cardText": "Convince the sailors that you are royalty",
            "challengeStat": "Voice",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "“My good sir, I will have you know that I am the cousin of the Crown Prince,” you lie, “eighth in line to the throne of the Royal Empire, and I am on a secret mission of utmost importance to the colonies. I implore you to let me board that lifeboat. My family shall owe you a great debt.”<br><br>The sailor looks at you, eyes narrowed. For a moment you wonder if you should have made up a higher station. Eighth? Maybe fourth would place your life at a higher value. Perhaps twelfth would have sounded more plausible.<br><br>“Cousin to the Crown Prince, you say?” He looks at you skeptically. “You’re probably lying, but just in case, you should know my name’s Helmsman Asa from Eelingborough. You make sure you take care of my wife if I don’t make it through this,” he says as he hurries you up the ladder onto the lifeboat. ",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "“My good sir, I will have you know that I am the cousin of the Crown Prince,” you lie, “eighth in line to the throne of the Royal Empire, and I am on a secret mission of utmost importance to the colonies. I implore you to let me board that lifeboat. My family shall owe you a great debt.”<br><br>The sailor looks at you, eyes narrowed. For a moment you wonder if you should have made up a higher station. Eighth? Maybe fourth would place your life at a higher value. Perhaps twelfth would have sounded more plausible.<br><br>“Cousin to the Crown Prince, you say?” He looks at you skeptically.<br><br>“Well, I outrank you, cuz I’m the bloody Queen,” he grins as his buddies help grab your arms from behind and throw you over the edge of the ship. You go tumbling through the air and land with a crash into the roiling, icy ocean. "
        },
        {
            "cardID": "Medusa17",
            "cardText": "Bribe the sailor",
            "addedText": "“Thanks for the cash mate, but my life's worth more than a few shillings”. The sailor grins as his buddies help grab your arms from behind and throw you over the edge of the ship. You go tumbling through the air and land with a crash into the roiling, icy ocean. ",
            "rewards": [
                {"rewardName": "Royal shilling",
                "rewardQuantity": -117},
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "reqs": [
                {"reqName": "Royal shilling",
                "reqRule": ">=",
                "reqQuantity": 100}
            ],
            "nextCardsID": [
                "Medusa19"
            ]
        },
        {
            "cardID": "Medusa18",
            "cardText": "Wait for the lifeboat to be launched",
            "addedText": "One of the sailors yells “Andie! Let’s go!” You presume it is Andie who then leaps into the lifeboat beside you, and her crewmates start to untie the knots to release the lifeboat into the heaving ocean waves. The knots are wet from the storm, and one of the crewmembers begins to hack at the ropes with his sabre.<BR><BR>“No!” One of the crew yells, but it is too late. The blade cuts through the rope, releasing only the front of the lifeboat, pitching you and all the other lifeboat passengers head over heels into the ocean.<br><br>You flounder, barely managing to get your head above water to take a gasp of air. Screaming passengers and crew are doing their best to stay afloat, but you can barely hear them over the storm - and another new noise. You don’t know where the noise is coming from - the masts, the sails, or the hull of the Medusa itself, but something is about to come apart",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20}
            ],
            "setScore": [
                {"setName": "minute until The Medusa sinks",
                "setQuantity": 0}
            ],
            "nextCardsID": [
                "Medusa20"
            ]
        },
        {
            "cardID": "Medusa19",
            "locationDescription": "The cold ocean pulls downwards on your wet clothing as the wind blows saltwater into your eyes",
            "cardText": "Flounder",
            "addedText": "You flounder, barely managing to get your head above water to take a gasp of air. You look up and see the lifeboat swinging precariously above you. Some commotion ensues on the deck of the ship. A rope snaps. The bow of the lifeboat falls, and it does a nosedive into the ocean, spilling out all who thought they had found relative safety. Screaming people are doing their best to stay afloat, but you can barely hear them over the storm - and another new noise. You don’t know where the noise is coming from - the masts, the sails, or the hull of the Medusa itself, but something is about to come apart.",
            "setScore": [
                {"setName": "minute until The Medusa sinks",
                "setQuantity": 0}
            ],
            "nextCardsID": [
                "Medusa20"
            ]
        },
        {
            "cardID": "Medusa20",
            "cardText": "Uh oh",
            "locationDescription": "The cold ocean pulls downwards on your wet clothing as the wind blows saltwater into your eyes",
            "addedText": "You see it coming. The previous waves were nothing compared to this one. It looms beyond the Medusa. Maybe it is a trick of your imagination, but it almost seems to stand still and gather its strength before lightning illuminates the sky and the wave begins its assault on the ship. The hull of the poor Medusa folds like paper. The masts and sails are thrust into the sea. The wave engulfs you next, and when you come up for air again, you are surrounded by a few lifeboats, some upright. But there is no Medusa to be seen. The cold water is slowing you down physically and mentally. You remember little else for the next several hours.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "Mind",
                "rewardQuantity": -20}
            ],
            "nextCardsID": [
                "Medusa21"
            ]
        },
        {
            "cardID": "Medusa21",
            "cardText": "???",
            "locationDescription": "?",
            "addedText": "You dream of darkness again<br><BR>You dream of screams again<br><br>You dream of the cold again.",
            "nextCardsID": [
                "Medusa22"
            ]
        },
        {
            "cardID": "Medusa22",
            "cardText": "dream",
            "addedText": "You dream of the fins of undersea predators circling you in the water.<br><br>You dream of the echoes of thunder that trump all other sound.<br><br>You dream of slimy tentacled arms, wrapping around your body, dragging you down.",
            "nextCardsID": [
                "LifeboatWakeUp"
            ]
        },
        {
            "cardID": "LifeboatSunMorning",
            "cardText": "The morning sunrise",
            "locationDescription": "All you can see is the endless ocean below the horizon, and the bright morning  sky above.",
            "addedText": "As the sun emerges upon a new day, you feel renewed hope that you can conquer this sea.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 0}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": ">",
                "reqQuantity": 9,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 5,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatWatchSun",
                "LifeboatRowNavigateUsingSun",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatSunNoon",
            "cardText": "The noon sun",
            "locationDescription": "All you can see is the endless ocean below the horizon, and the cloudless noon  sky above.",
            "addedText": "Exposed patches of your skin scorch in the hot mid-day sun of the tropics. You can’t stay here or you’ll die.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 1}
            ],
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5},
                {"rewardName": "Brawn",
                "rewardQuantity": 5},
                {"rewardName": "Mind",
                "rewardQuantity": -5}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": ">",
                "reqQuantity": 9,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatWatchSun",
                "LifeboatRowNavigateUsingSun",
                "LifeboatRowFollowBirds",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatSunDusk",
            "cardText": "The setting sun",
            "locationDescription": "All you can see is the endless ocean below the horizon, and the darkening dusk sky above.",
            "addedText": "Your sunburned shoulders begin to feel relief now that the sun is beginning to dip low near the horizon, but your body still feels dehydrated.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 2}
            ],
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": -3}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": ">",
                "reqQuantity": 9,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 1,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatWatchSun",
                "LifeboatRowNavigateUsingSun",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatSunEvening",
            "cardText": "The evening stars",
            "locationDescription": "All you can see is the endless ocean below the horizon, and the starry evening sky above.",
            "addedText": "A thousand points of light dot the night sky. This could be your map, if only you knew where you were going.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 3}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": ">",
                "reqQuantity": 9,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 2,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatWatchStars",
                "LifeboatRowNavigateUsingStars",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatSunMidnight",
            "cardText": "The chilled midnight wind",
            "locationDescription": "All you can see is the endless ocean below the horizon, and the brightly lit midnight sky above.",
            "addedText": "The crisp night air starts to seep into your bones.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 4}
            ],
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": ">",
                "reqQuantity": 9,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 3,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatWatchStars",
                "LifeboatRowNavigateUsingStars",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatSunLateNight",
            "cardText": "The long night",
            "locationDescription": "All you can see is the endless ocean below the horizon, and the dazzling night sky above.",
            "addedText": "Your body struggles against sleep as the hours of the night stretch on as vast as the ocean.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 5}
            ],
            "rewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -5}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": ">",
                "reqQuantity": 9,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 4,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatWatchStars",
                "LifeboatRowNavigateUsingStars",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },

        {
            "cardID": "LifeboatCloudMorning",
            "cardText": "The thick morning fog",
            "locationDescription": "The foggy morning skies hide the endless ocean that surrounds you.",
            "addedText": "The gradually brightening fog informs you that the sun has risen on a new day lost at sea. For better or worse, hopefully it is your last.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 0}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": "<",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 5,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatRowFollowDolphins",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatCloudNoon",
            "cardText": "The gentle mid-day rain",
            "locationDescription": "The rainy mid-day skies hide the endless ocean that surrounds you.",
            "addedText": "The sun is obscured by so many clouds that you can barely make it out. It’s heat is no match for the fog’s cold.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 1}
            ],
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": -2}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": "<",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatRowFollowSharks",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatCloudDusk",
            "cardText": "The darkening stormclouds",
            "locationDescription": "The ominous thunderclouds of the afternoon skies loom over the endless ocean that surrounds you.",
            "addedText": "Darkening stormclouds menace the evening skies.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 2}
            ],
            "rewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -3}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": "<",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 1,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatRowFollowDolphins",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatCloudEvening",
            "cardText": "The pouring rain",
            "locationDescription": "The grey drizzling evening skies melt into the endless ocean that surrounds you.",
            "addedText": "The evening is cold, wet, and dark. The wind and rain sap the energy from your body.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 3}
            ],
            "rewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -5},
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": "<",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 2,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatCloudMidnight",
            "cardText": "The black of night",
            "locationDescription": "The black midnight skies hide the endless ocean that surrounds you.",
            "addedText": "A blanket of clouds voids the night sky of moon and stars.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 4}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": "<",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 3,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatRowFollowSharks",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },
        {
            "cardID": "LifeboatCloudLateNight",
            "cardText": "The eerie darkness",
            "locationDescription": "The gloomy late night skies hide the endless ocean that surrounds you.",
            "addedText": "The long hours of the night drag on. The clouds block every trace of light, leaving you in darkness.",
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 5}
            ],
            "rewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -2}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "weather",
                "reqRule": "<",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 4,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatDrinkSeawater",
                "LifeboatExamineBoat",
                "LifeboatSleep",
                "LifeboatPassOut",
                "LifeboatRowAimlessly",
                "LifeboatWatchWater",
                "LifeboatRowFollowOceanCurrent",
                "LifeboatWatchClouds",
                "LifeboatRowFollowClouds",
                "LifeboatSail",
                "LifeboatLandHo"
            ]
        },





        {
            "cardID": "LifeboatWakeUp",
            "cardText": "Wake up",
            "locationName": "The open ocean",
            "locationDescription": "Nothing but water and sky as far as the eye can see.",
            "addedText": "You wake to the sun's heat scorching your body. You have a vague memory of struggling to right this capsized lifeboat before passing out, but your mind is hazy. There were others in the water too, helping you right the lifeboat. Weren't there? Whatever happened, they are no longer here. You are slightly rested, but you are hungry, thirsty, and alone in the middle of the ocean.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": 10},
                {"rewardName": "weather",
                "rewardQuantity": 10}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatDrinkSeawater",
            "cardText": "Drink seawater",
            "addedText": "You seem to remember hearing that drinking seawater is a bad idea. When you choke on the salty water you realize why.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": -10},
                {"rewardName": "seawater drank",
                "rewardQuantity": 1},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "seawater drank",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatExamineBoat",
            "cardText": "Examine lifeboat",
            "addedText": "The unpainted wooden boat stretches a mere ten feet from bow to stern. It’s nothing fancy but seems water-tight, which is the only important thing right now. You see there is a small area at the bow where the front of the boat has an overhang. It is tight, but this could be a good place to shelter you from sun or rain while you sleep. In the stern, there is a small hold. There are a few supplies stored here, including a few wheels of cheese, some bottles of water, and two oars for rowing. It seems that some others who were fleeing the shipwreck started to stow their possessions in this hold too, as there is a jacket, a couple bottles of fine brandy, and a crate of silverware. <br><br>You put on the jacket, as it will protect you from the sun. You consume a small amount of the cheese and water, but you will have to ration it out, since you have no idea how long it may take for you to be rescued, or find land. There is also a sealed metal chest, but you don't have any way of opening it here at sea. The other supplies might be good to hang on to for bartering with potential rescuers.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": 5},
                {"rewardName": "Mind",
                "rewardQuantity": 5},
                {"rewardName": "sack of cheese",
                "rewardQuantity": 1},
                {"rewardName": "crate of water bottles",
                "rewardQuantity": 1},
                {"rewardName": "oar",
                "rewardQuantity": 2},
                {"rewardName": "travel jacket",
                "rewardQuantity": 1},
                {"rewardName": "bottle of fine brandy",
                "rewardQuantity": 2},
                {"rewardName": "crate of silverware",
                "rewardQuantity": 2},
                {"rewardName": "lifeboat examined",
                "rewardQuantity": 1},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "lifeboat examined",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatSleep",
            "cardText": "Sleep",
            "addedText": "You are feeling weak, so you curl up under the bow of the boat and close your eyes. You are unsure how long you slept for, but when you wake up you are feeling rested. You partake in a small amount of the food and fresh water in the lifeboat’s small hold.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": 30},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": "<",
                "reqQuantity": 50,
                "reqHidden": true},
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "lifeboat examined",
                "reqRule": "=",
                "reqQuantity": 1,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatPassOut",
            "cardText": "Pass Out",
            "addedText": "You have driven yourself hard - harder than your body can handle. When you wake up, you are unsure how long you were out for, but your body is grateful in some small part for the break.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": 2000},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": "<=",
                "reqQuantity": 10}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatRowAimlessly",
            "cardText": "Row aimlessly",
            "addedText": "You row for a while, but you feel you are just going in circles, not making any progress. You don’t know where you can go, but you must go somewhere. Sitting in the middle of the ocean will lead to nothing but exhaustion in the sun. You need to find some way of guiding yourself.",
            "rewards": [
                {"rewardName": ["Health"],
                "rewardQuantity": [-5],
                "rewardRange": [2]},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [1]}
            ],
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "oar",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "nautical progress",
                "reqRule": "<",
                "reqQuantity": 1,
                "reqHidden": true}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatWatchWater",
            "cardText": "Watch the water",
            "addedText": "Although you cannot see any sign of the bottom, gazing at the deep water, you see flickers of motion passing beneath you. You slowly begin to get a feel for the direction of the ocean currents. <br><br> If you do nothing, you will have little chance of finding land, but your odds would be greatly improved if you travel faster by following the current. Perhaps with a bit more understanding, you could paddle in the direction of the current.",
            "rewards": [
                {"rewardName": "ocean current navigation skill",
                "rewardQuantity": 1},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "ocean current navigation skill",
                "reqRule": "<",
                "reqQuantity": 2,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatRowFollowOceanCurrent",
            "cardText": "Row. Follow the ocean current",
            "addedText": "You feel that you have a good enough understanding of the direction of the current to follow it. You don’t know if you are heading toward land, or just the open ocean, but at least you are are making progress, rather than just sitting out in the open ocean.",
            "rewards": [
                {"rewardName": ["Health"],
                "rewardQuantity": [-5],
                "rewardRange": [2]},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]},
                {"rewardName": "ocean current navigation skill",
                "rewardQuantity": 1},
                {"rewardName": "Vikings",
                "rewardQuantity": 1},
                {"rewardName": "nautical progress",
                "rewardQuantity": 1}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "oar",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "ocean current navigation skill",
                "reqRule": ">=",
                "reqQuantity": 2}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },{
            "cardID": "LifeboatRowFollowDolphins",
            "cardText": "Row, following dolphins",
            "addedText": "You spot a pod of dolphins leaping in and out of the water. Certainly dolphins would head towards reefs or islands where there is a greater congregation of fish?",
            "rewards": [
                {"rewardName": ["Health"],
                "rewardQuantity": [-5],
                "rewardRange": [2]},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]},
                {"rewardName": "ocean current navigation skill",
                "rewardQuantity": 1},
                {"rewardName": "nautical progress",
                "rewardQuantity": 3}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "oar",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "nautical progress",
                "reqRule": ">",
                "reqQuantity": 5,
                "reqHidden": true},
                {"reqName": "ocean current navigation skill",
                "reqRule": ">=",
                "reqQuantity": 2}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatRowFollowSharks",
            "cardText": "Row. Follow sharks",
            "addedText": "That doesn’t work. The sharks seem to be following you.",
            "hiddenIfReqsFail": true,
            "rewards": [
                {"rewardName": "sharks followed",
                "rewardQuantity": 1},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]}
            ],
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "sharks followed",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true},
                {"reqName": "oar",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "ocean current navigation skill",
                "reqRule": ">=",
                "reqQuantity": 2}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatWatchClouds",
            "cardText": "Watch the clouds",
            "addedText": "You gaze upwards at the white puffy cumulus clouds and begin to identify shapes and directions of movement. Perhaps by getting a better understanding of the prevailing winds, you can find a way towards land.",
            "rewards": [
                {"rewardName": "wind current navigation skill",
                "rewardQuantity": 1},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "wind current navigation skill",
                "reqRule": "<",
                "reqQuantity": 2,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatRowFollowBirds",
            "cardText": "Row, following the birds",
            "addedText": "You spot a flock of seagulls in the distance. Birds cannot live over water forever; they need to eventually return to land. You follow them until they fly off into the distance, confident that you are getting closer to land.",
            "rewards": [
                {"rewardName": ["Health"],
                "rewardQuantity": [-5],
                "rewardRange": [2]},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]},
                {"rewardName": "wind current navigation skill",
                "rewardQuantity": 1},
                {"rewardName": "nautical progress",
                "rewardQuantity": 1}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "oar",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "nautical progress",
                "reqRule": ">",
                "reqQuantity": 5,
                "reqHidden": true},
                {"reqName": "wind current navigation skill",
                "reqRule": ">=",
                "reqQuantity": 2}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatRowFollowClouds",
            "cardText": "Row, following clouds",
            "addedText": "Every day and every night, in this part of the world there never seems to be a cloudless sky. You have a good understanding of the wind currents here and you are able to use this information to keep your direction true. No one can guarantee that the winds are taking you to land, but at least you know you are not going in circles.",
            "rewards": [
                {"rewardName": ["Health"],
                "rewardQuantity": [-5],
                "rewardRange": [2]},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]},
                {"rewardName": "wind current navigation skill",
                "rewardQuantity": 1},
                {"rewardName": "Vikings",
                "rewardQuantity": -1},
                {"rewardName": "nautical progress",
                "rewardQuantity": -1}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "oar",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "wind current navigation skill",
                "reqRule": ">=",
                "reqQuantity": 2}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatWatchSun",
            "cardText": "Watch the sun",
            "addedText": "It’s a shame that the Sun moves through the sky so slowly. Perhaps if you study it more, you can which direction it is moving in.",
            "rewards": [
                {"rewardName": "solar navigation skill",
                "rewardQuantity": 1},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "nautical progress",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "solar navigation skill",
                "reqRule": "<",
                "reqQuantity": 2,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatRowNavigateUsingSun",
            "cardText": "Row. Navigate using the Sun.",
            "addedText": "While wind and water can shift direction, the Sun only travels one consistent path, rising in the east and setting in the west. You have a good enough understanding of the sun’s motion now to tell which direction you are headed in… as long as it isn’t too cloudy out.",
            "rewards": [
                {"rewardName": ["Health"],
                "rewardQuantity": [-5],
                "rewardRange": [2]},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]},
                {"rewardName": "solar navigation skill",
                "rewardQuantity": 1},
                {"rewardName": "nautical progress",
                "rewardQuantity": 3}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "oar",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "solar navigation skill",
                "reqRule": ">=",
                "reqQuantity": 2}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatWatchStars",
            "cardText": "Watch the stars",
            "addedText": "Are the stars here in the New World the same as those of the Olden? You wish you had paid more attention to learning the constellations in school. You start to make out a few patterns in the sparkling sky above, and perhaps with more understanding you could use these to navigate by.",
            "rewards": [
                {"rewardName": "celestial navigation skill",
                "rewardQuantity": 1},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "nautical progress",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "celestial navigation skill",
                "reqRule": "<",
                "reqQuantity": 2,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatRowNavigateUsingStars",
            "cardText": "Row. Navigate using the stars.",
            "addedText": "Out here in the open ocean, the night sky is a veritable map to guide yourself by. You have identified the North Star, which  never seems to change position, so now at night you can always tell which direction you are traveling in… as long as it isn’t overcast.",
            "rewards": [
                {"rewardName": ["Health"],
                "rewardQuantity": [-5],
                "rewardRange": [2]},
                {"rewardName": ["weather"],
                "rewardQuantity": [0],
                "rewardRange": [5]},
                {"rewardName": "celestial navigation skill",
                "rewardQuantity": 1},
                {"rewardName": "nautical progress",
                "rewardQuantity": 3}
            ],
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 10,
                "reqHidden": true},
                {"reqName": "oar",
                "reqRule": ">=",
                "reqQuantity": 2},
                {"reqName": "celestial navigation skill",
                "reqRule": ">=",
                "reqQuantity": 2}
            ],
            "nextCardsID": [
                "LifeboatSunMorning",
                "LifeboatSunNoon",
                "LifeboatSunDusk",
                "LifeboatSunEvening",
                "LifeboatSunMidnight",
                "LifeboatSunLateNight",
                "LifeboatCloudMorning",
                "LifeboatCloudNoon",
                "LifeboatCloudDusk",
                "LifeboatCloudEvening",
                "LifeboatCloudMidnight",
                "LifeboatCloudLateNight"
            ]
        },
        {
            "cardID": "LifeboatSail",
            "cardText": "Sail",
            "addedText": "You should not be able to access this content.",
            "reqs": [
                {"reqName": "sail",
                "reqRule": ">",
                "reqQuantity": 0}
            ],
            "nextCardsID": [
                "LifeboatRowAimlessly"
            ]
        },
        {
            "cardID": "LifeboatLandHo",
            "cardText": "Land ho!",
            "locationName": "The open ocean",
            "locationDescription": "The horizon is broken up by a small stretch of land.",
            "addedText": "Land ho! A dark smudge on the horizon indicates that finally, your long trek across the waves may soon be at an end.",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "nautical progress",
                "reqRule": ">=",
                "reqQuantity": 5,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "LifeboatPaddleToShore"
            ]
        },
        {
            "cardID": "LifeboatPaddleToShore",
            "cardText": "Paddle to shore",
            "addedText": "You approach a land of green jungle and black rocks. There is no sign of human settlement, but where there are trees there may be food. As you get closer to shore, more and more of the black rocks protrude out of the ocean. This doesn’t look like a good landing site, but after days on the open ocean, any land is better than none.",
            "nextCardsID": [
                "LifeboatAvoidRocks"
            ]
        },
        {
            "cardID": "LifeboatAvoidRocks",
            "cardText": "Avoid the rocks!",
            "addedText": "As the water gets shallower, the surf gets stronger. One particularly large wave sweeps you up and dashes you against a large black boulder. You huddle under the protection of the bow as the surf and rocks batter your small craft.",
            "nextCardsID": [
                "BifröstShore0"
            ]
        },
        {
            "cardID": "BifröstShore0",
            "cardText": "Crash!",
            "locationName": "?",
            "locationDescription": "",
            "addedText": "You are gasp for air as you’ve just been smashed against a rock, the wind knocked out of you. You regain your breath, after passing out, or did you pass out? All you know is that blinding light sears your eyes. You can’t even tell what you’re looking at except that it is too bright to see. You feel hot and cold at the same time. You realize why as a wave crashes over you and you choke on some sea water. You get up onto your hands and knees and you cough the salty sea water out and you wipe your wet face with your wet hands. You see a large black rock - you see many large black rocks, jagged from the pummelling they receive from the relentless ocean waves. You crawl over to a close, relatively dry one and throw yourself down on it. You close your eyes. First you try to take account of your own status. You feel pain and wet all over, but you still seem to be in one piece. You feel like crap though.",
            "setScore": [
                {"setName": "Health",
                "setQuantity": 10},
                {"setName": "sack of cheese",
                "setQuantity": 0},
                {"setName": "crate of water bottles",
                "setQuantity": 0},
                {"setName": "oar",
                "setQuantity": 0},
                {"setName": "bottle of fine brandy",
                "setQuantity": 0},
                {"setName": "crate of silverware",
                "setQuantity": 0}
            ],
            "nextCardsID": [
                "BifröstShore1"
            ]
        },
        {
            "cardID": "BifröstShore1",
            "cardText": "Close your eyes",
            "addedText": "When you open your eyes again, your blurry vision begins to resolve and you take in your surroundings. To one side is the ocean, vast, yet relatively calm. The sky is picturesquely blue, as if to call you a liar. You imagine a nervous cloud saying “Storm? What storm? I didn’t just sink a ship and kill hundreds of innocents with a storm!” You chuckle to yourself, causing you to wonder about your own sanity.",
            "setScore": [
                {"setName": "Mind",
                "setQuantity": 20}
            ],
            "nextCardsID": [
                "BifröstShore2"
            ]
        },
        {
            "cardID": "BifröstShore2",
            "cardText": "Look around",
            "locationDescription": "Some rocky, desolate shore",
            "addedText": "The whole coast is made of this same black rock. Inland, the rocks look smooth, but they get rougher and more jagged the further out into the water they go. The ocean seems to have deposited you in some kind of tidal pool, along with a fair amount of debris from the Medusa’s shipwreck.<br><br>You are just wondering whether anyone else survived the wreck when you are distracted by a squawking sound and notice a bright red parrot sitting on a rock not far behind you. Parrots aren’t scavengers are they? Is it waiting for you to die so that it can eat you? It continues to watch you while you try to stand up and figure out your next move.<br><br>You have no idea where you are, you have no clothes except your torn nightgown, and you are alone, as far as you know.<br><br>Oh, and you have been thrown clear from your boat so you have no tools, food or fresh water. “Good luck, me!” You wish yourself.",
            "rewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -5}
            ],
            "nextCardsID": [
                "BifröstShore3a",
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ]
        },
        {
            "cardID": "BifröstShore3a",
            "cardText": "Search debris",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "worn top hat",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "challengeStat": "Eye",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "worn top hat",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeSuccessText": "You search between nearby rocks for anything you can find: supplies from the Medusa, the wreckage of your lifeboat, even other survivors - if there are any. After a fair bit of searching, you find a worn top hat that is waterlogged, but it will serve to keep the sun off your head. The parrot is still sitting there, watching you. ",
            "challengeFailRewards": [
            ],
            "challengeFailCards": [
                "BifröstShore3a",
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeFailText": "You search between nearby rocks for anything you can find: supplies from the Medusa, the wreckage of your lifeboat, even other survivors - if there are any. You fail to find anything other than large rocks and chunks of soaked wood. The parrot is still sitting there, watching you. "
        },
        {
            "cardID": "BifröstShore3b",
            "cardText": "Search debris",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "worn top hat",
                "reqRule": "=",
                "reqQuantity": 1},
                {"reqName": "iron nail",
                "reqRule": "<",
                "reqQuantity": 1}
            ],
            "challengeStat": "Eye",
            "challengeRoll": 2,
            "challengeSuccessRewards": [
                {"rewardName": "iron nail",
                "rewardQuantity": 7}
            ],
            "challengeSuccessCards": [
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeSuccessText": "You find a soggy chunk of wood with several strong nails in it. The wood falls apart easily, freeing the nails. Perhaps you can use these somehow to help you survive. The parrot is still sitting there, watching you. ",
            "challengeFailRewards": [
            ],
            "challengeFailCards": [
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeFailText": "You fail to find anything other than large rocks and chunks of soaked wood. The parrot is still sitting there, watching you. "
        },
        {
            "cardID": "BifröstShore4",
            "cardText": "Talk to parrot",
            "challengeStat": "Voice",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -5}
            ],
            "reqs": [
                {"reqName": "Mind",
                "reqRule": ">",
                "reqQuantity": 5}
            ],
            "challengeSuccessCards": [
                "BifröstShore6"
            ],
            "challengeSuccessText": "“Hello, by any chance, are you a trained pet parrot? Is there someone nearby? Hello? Hello?”<br><br>The parrot cocks its head and looks at you - certainly a bizarre curiosity. Only when it does a couple of hops onto a different rock, do you realize that the parrot wasn’t sitting on a rock at all, but rather the aft hull of your lifeboat!  ",
            "challengeFailRewards": [
            ],
            "challengeFailCards": [
                "BifröstShore3a",
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeFailText": "You try to produce sound, but your hoarse throat cracks and you you just cough up a little more seawater. "
        },
        {
            "cardID": "BifröstShore5",
            "cardText": "Try to catch parrot",
            "challengeStat": "Hand",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
            ],
            "challengeSuccessCards": [
                "BifröstShore6"
            ],
            "challengeSuccessText": "You climb up to a high rock, and lunge at the parrot. It lazily hops to another rock, and continues to stare at you. It does not seem to be at all fazed.<br><br>You notice though that the rock it had just been sitting on was not a rock at all, but rather the aft hull of your lifeboat! The parrot watches you investigate further ",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 5}
            ],
            "challengeFailCards": [
                "BifröstShore3a",
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeFailText": "You climb up to a high rock, and lunge at the parrot. It lazily hops to another rock, and continues to stare at you. It does not seem to be at all fazed. The parrot watches you limp along as blood trickles down your scraped shin."
        },
        {
            "cardID": "BifröstShore6",
            "cardText": "Investigate the debris",
            "addedText": "You embrace the hull of wrecked lifeboat out of gratitude. There is a massive crack in one side which would need to be repaired before it could be seaworthy again, but other than that, it is in one piece. You become even more overjoyed when you realize that the wheels of cheese are still here, as well as the brandy. The bottles of water are missing, as are the oars, but you don’t feel like going back out to sea anytime soon. Even the silverware and sealed metal chest are still secured inside. Now that you are on land, you may be able to open it up.",
            "rewards": [
                {"rewardName": "sack of cheese",
                "rewardQuantity": 1},
                {"rewardName": "bottle of fine brandy",
                "rewardQuantity": 2},
                {"rewardName": "crate of silverware",
                "rewardQuantity": 2}
            ],
            "nextCardsID": [
                "BifröstShore7a",
                "BifröstShore7b",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ]
        },
        {
            "cardID": "BifröstShore7a",
            "cardText": "EAT!",
            "addedText": "You eat a few bites of the cheese, and open a bottle of brandy, drinking enough to invigorate you, but not enough to impair you.",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Health",
                "reqRule": "<",
                "reqQuantity": 30,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": 10},
                {"rewardName": "Mind",
                "rewardQuantity": 10}
            ],
            "nextCardsID": [
                "BifröstShore6"
            ]
        },
        {
            "cardID": "BifröstShore7b",
            "cardText": "Smash it with a rock",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
            ],
            "challengeSuccessCards": [
                "BifröstShore10"
            ],
            "challengeSuccessText": "There is no shortage of sharp heavy rocks. You select the largest one you can lift, and bring it crashing down on the hinges of the chest. The hinge snaps under the force of the rock. With that broken, it doesn’t matter that the lock is still in place, you are able to wiggle the lid off the chest.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "reqs": [
                {"reqName": "Health",
                "reqRule": ">",
                "reqQuantity": 5,
                "reqHidden": true}
            ],
            "challengeFailCards": [
                "BifröstShore7",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ],
            "challengeFailText": "There is no shortage of sharp heavy rocks. You select the largest one you can lift, and bring it crashing down on the hinges of the chest. Even though the ocean started this process already, the chest is sturdier than you thought. The rock bounces off the chest and grazes your shin. "
        },
        {
            "cardID": "BifröstShore8a",
            "cardText": "Pick the lock",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "iron nail",
                "reqRule": "<",
                "reqQuantity": 1},
                {"reqName": "Mind",
                "reqRule": ">",
                "reqQuantity": 5}
            ],
            "challengeStat": "Hand",
            "challengeRoll": 6,
            "challengeSuccessRewards": [ {}
            ],
            "challengeSuccessCards": [
                "BifröstShore10"
            ],
            "challengeSuccessText": "You pick up a small deciduous tree needle that had washed up on shore and attempt to use it to pick the lock. With a satisfying click, the lock has opened! It still takes a bit of force to open the chest since the hinge is battered, but with a loud groan, the lid opens. ",
            "challengeFailRewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -5}
            ],
            "challengeFailCards": [
                "BifröstShore7",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ],
            "challengeFailText": "You pick up a small deciduous tree needle that had washed up on a rock and attempt to use it to pick the lock. Maybe it’s because you aren’t using proper lock-picking tools, or maybe it’s due to sand in the lock mechanism, but you can’t seem to get it to budge. You are getting very frustrated. "
        },
        {
            "cardID": "BifröstShore8b",
            "cardText": "Pick the lock with a nail",
            "hiddenIfReqsFail": true,
            "challengeStat": "Hand",
            "challengeRoll": 3,
            "reqs": [
                {"reqName": "iron nail",
                "reqRule": ">=",
                "reqQuantity": 1},
                {"reqName": "Mind",
                "reqRule": ">",
                "reqQuantity": 5}
            ],
            "challengeSuccessRewards": [
            ],
            "challengeSuccessCards": [
                "BifröstShore10"
            ],
            "challengeSuccessText": "You take one of the nails that you picked up earlier and attempt to use it to pick the lock. With a satisfying click, the lock has opened! It still takes a bit of force to open the chest since the hinge is battered, but with a loud groan, the crate opens. ",
            "challengeFailRewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -5}
            ],
            "challengeFailCards": [
                "BifröstShore7",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ],
            "challengeFailText": "You take one of the nails that you picked up earlier and attempt to use it to pick the lock. Maybe it’s because you aren’t using proper lock-picking tools, or maybe it’s due to sand in the lock mechanism, but you can’t seem to get it to budge. You are getting very frustrated. "
        },
        {
            "cardID": "BifröstShore9",
            "cardText": "Search for a leak",
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
            ],
            "challengeSuccessCards": [
                "BifröstShore10"
            ],
            "challengeSuccessText": "If the chest was full of water, it must have a crack somewhere. Using your fingers and your eyes, you search its edges for the weak point that must be there. You notice small air bubbles by one of the joints. You push on it with a rock, and feel some give. Smashing the rock even harder on that point causes the wood to come apart from the metal and you are able to get at the inside of the crate. ",
            "challengeFailCards": [
                "BifröstShore7",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ],
            "challengeFailText": "If the chest was full of water, it must have a crack somewhere. Using your fingers and your eyes, you search its edges for the weak point that must be there. You find a joint that seems to have some flexibility. You try to pry it apart, but nothing budges. "
        },
        {
            "cardID": "BifröstShore10",
            "cardText": "Open the crate",
            "addedText": "Inside the crate is a bunch of wet soggy straw, and you are worried that whatever was valuable enough to store so securely must have been damaged. But after groping around in the straw, you pull out a lockbox, about the size of a large book. In fact, it is decorated like a book too, decorated with symbol that could be triangles, or wings, surrounded by the text of a language you are unfamiliar with. The lockbox is sturdy, built out of some kind of lightweight grey metal.",
            "nextCardsID": [
                "BifröstShore11"
            ]
        },
        {
            "cardID": "BifröstShore11",
            "cardText": "Open the lockbox",
            "addedText": "Inside the chest is a bunch of wet soggy straw, and you are worried that whatever was valuable enough to store so securely must have been damaged. Groping around in the straw, you pull out a lockbox, about the size of a large book.",
            "nextCardsID": [
                "BifröstShore12"
            ]
        },
        {
            "cardID": "BifröstShore12",
            "cardText": "Open the lockbox",
            "addedText": "The lockbox is quite secure. There’s no way you’re getting into it. You shake it and no water comes out, so it still seems sealed. By its weight, you can tell there is something inside, some large solid thing.<br><br>The parrot flies back over to you and starts investigating the crate. It’s probably interested in your cheese - maybe the brandy too?",
            "nextCardsID": [
                "BifröstShore13"
            ]
        },
        {
            "cardID": "BifröstShore13",
            "cardText": "Shoo the bird away",
            "addedText": "You shoo it away from your few worldly possessions, yelling at it. The bird squawks loudly and angrily at you.<br><br>“Go away!” you yell.<br><br>“Go away! Go away!” The parrot yells back at you, as it leaps up into the air and flyies into the trees “Go away! Go away!”<br><br>“I’m not going anywhere, featherhead,”<br><br>“Hey, don’t talk to the birds like that.”<br><br>“I’ll talk to the damn birds how I want!” You realize that the voices are coming from two men on the edge of the jungle.<br><br>“You’re new here, you’ll learn,” says a third voice, a woman.",
            "nextCardsID": [
                "BifröstShore14a",
                "BifröstShore14b"
            ]
        },
        {
            "cardID": "BifröstShore14a",
            "cardText": "Hide",
            "addedText": "You duck down low among the rocks. Even though you will soon be starving, you have no idea who these people are or whether they can be trusted.<br><br>“Pana! I saw something move over there!”<br><br>You curse under your breath as half a dozen individuals rapidly converge on your location. They don’t look happy to see you.",
            "nextCardsID": [
                "BifröstShore15"
            ]
        },
        {
            "cardID": "BifröstShore14b",
            "cardText": "Get their attention",
            "addedText": "You wave your hands and shout “Hey! Over here!”<br><br>You start to wonder how wise that was as the three individuals you heard speaking are joined by four more who all converge on your location. They don’t look happy to see you.",
            "rewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstShore15"
            ]
        },
        {
            "cardID": "BifröstShore15",
            "cardText": "Too exhausted to flee",
            "addedText": "“Pana, what do you make of this?” a man with an unpleasaant grin asks to a man with an unpleasant face.<br><br>“Who are you, and how did you get here?” asks the woman who you heard speak before. Based on the wreckage around you and the haggard state of your clothing, you would think the second part of the answer should be obvious. You explain to them the basics that you know about the Medusa’s shipwreck.<br><br>“You a convict?” Enrique asks as he grabs your hand roughly and flips it over to see your wrist. In doing so, you notice a number tattooed on his.<br><br>“Bailiff Claudia! He’s got food! And drink!” One of the others yells out, noticing your lifeboat and supplies. You notice that all of them have numbers tattooed on their own wrists. “There’s a lockbox here too. What’s in it?”<br><br>“You want Good Conduct?” Headmost Bailiff Claudia says cutting off Impulsive Convict Enrique. “This could be an Snoop.”<br><br>“Well? Are you a Snoop?” Pana asks you.",
            "nextCardsID": [
                "BifröstShore16"
            ]
        },
        {
            "cardID": "BifröstShore16",
            "cardText": "I’m not sure what you mean",
            "addedText": "“No, I’m not sure what you mean,” you respond.<br><br>“Exactly what a Snoop would say,” mumbles one of the others under her breath.<br><br>“It’s not up to you to decide,” Headmost Bailiff Claudia states. “You three, keep on searching the debris. Everyone else, let's escort this one to the Warder.”<br><br>Unarmed and marooned in this strange land, you really have no choice but to go along. Regardless, it isn't long before the state of your mind and body overtakes you. You pass out.",
            "nextCardsID": [
                "BifröstShore16DreamA"
            ]
        },
        {
            "cardID": "BifröstShore16DreamA",
            "cardText": "pass out",
            "locationDescription": "?",
            "addedText": "You dream of a blinding darkness engulfing your body<br><br>You dream of the heat burning your skin while your core remains cold<br><br>You dream of the slithering and creeping sounds of things unseen in the night.",
            "nextCardsID": [
                "BifröstShore16DreamB"
            ]
        },
        {
            "cardID": "BifröstShore16DreamB",
            "cardText": "dream",
            "addedText": "You dream of a parrot with an eye bigger than the moon, staring at you, seeing more than it sees.<br><br>You dream you are a stone statue, carried to the top of a pyramid by labourers.<br><br>You dream of a jaguar in the night baring its teeth and leaning in to get a good sniff of you.",
            "nextCardsID": [
                "BifröstShore17"
            ]
        },
        {
            "cardID": "BifröstShore17",
            "locationName": "?",
            "locationDescription": "Inside a bunkhouse",
            "cardText": "Wake up",
            "addedText": "“Awake now, are you?” A voice asks. You groggily look around the room and see that you are in a small cabin. It seems to be a different time of day than when you met the convicts on the beach - possibly even a different day altogether.<br><br>“The name’s Quo, and I’m the Warder here. Welcome to Bifröst Prison Camp, property of Her Majesty’s Royal Empire. No, don’t worry, even though this is a prison camp, you’re in good hands. My fellas were surprised to find you out on the beach, and you certainly needed a nice long rest to get healthy.” You realize that you are not wearing the nightgown that you had on when the Medusa sank, and that you have bandages over the spots on your legs, arms, and torso where you were scraped by the rocks.<br><br>“Mind tellin me a bit about yourself over some dinner?” he asks, pushing a plate of veggies and fruit toward you.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": 50},
                {"rewardName": "Mind",
                "rewardQuantity": 50}
            ],
            "nextCardsID": [
                "BifröstShore18"
            ]
        },
        {
            "cardID": "BifröstShore18",
            "locationName": "Bifröst Prison Camp, your quarters",
            "locationDescription": "A plain, but comfortable bunkhouse which could house four, but you have it all to yourself.",
            "cardText": "EAT!",
            "addedText": "You tell him a little bit about your situation, but you are guarded. You don’t explain too much, partly because you don’t know where you stand here, and partly because you actually don’t know much about what led to the wrecking of the Medusa.<br><br>“Well, isn’t that sumthin? And you don’t know how the ship went down? We didn’t find any other survivors. I had some folks check the wreckage the day after we found you, and they couldn’t find much other than some raw materials that we can salvage as construction supplies. Sorry, that brandy and cheese you got became property of the Queen, went to support her Imperial Prison camps. Them’s the rules for when we find salvage that’s consumable, or raw materials. Not like yer box there…” he gestures off to the lockbox that you found in the wreckage, now sitting contently on your bedside table. It appears to still be intact.<br><br>“We figured it must be yours, since the symbol on it matches the one on yer jacket.” This jacket, found in the Medusa's lifeboat, is certainly not your own. It has a symbol embossed above the left breast pocket. This symbol matches perfectly with the one on the lockbox.",
            "setScore": [
                {"setName": "sack of cheese",
                "setQuantity": 0},
                {"setName": "crate of water bottles",
                "setQuantity": 0},
                {"setName": "oar",
                "setQuantity": 0},
                {"setName": "bottle of fine brandy",
                "setQuantity": 0},
                {"setName": "crate of silverware",
                "setQuantity": 0}
            ],
            "nextCardsID": [
                "BifröstShore19"
            ]
        },
        {
            "cardID": "BifröstShore19",
            "cardText": "check your lockbox",
            "addedText": "“Don’t worry, no one here would have any reason to take it. I mean, yeah, we got theives here, but not a man nor woman on this island is allowed to own property ‘til they’ve finished their sentences. Most people here are good folk. I know, I know, you might not want to believe that at first - convicts, all of ‘em. Why I myself am a convict too, and I run the place. The guards don't make themselves seen much around here, but they're always watchin. We were all sentenced to Transportation, so we’re here workin for Her Majesty. It’s her great plan to remove the less desirable elements from society - from her society - and send us over here to the New World. Personally, I don’t mind. I didn’t care much for the Olden Worlde, meself.”<br><br>“You probably wanna head to someplace more interestin than our humble little island, I imagine, like New Atlantis. You know much about this part of the New World?”",
            "nextCardsID": [
                "BifröstShore20"
            ]
        },
        {
            "cardID": "BifröstShore20",
            "cardText": "No. What's New Atlantis?",
            "addedText": "“Well, you’ll probably want to be headin to X, on the island of New Atlantis. I know - strange name for a city. They had to name it that since no one could ever agree on who owned it. The Royal Empire says their colony of Mayfair was there first. But right across the harbour, those Norse zealots from Valhalla established their colony of Njordheim. Then for the past century or two the island changed hands between Mayfair rulin Njordheim for one decade, then Njordheim rulin Mayfair for the next. It was all based on who was gettin beaten up on back in the Olden Worlde, the Royal Empire versus Valhalla.”<br><br>“This ‘ere camp, Bifröst, is kinda like X in that way. It was started by Valhalla as a prison camp. That’s why we got the Norse name and all. But the Royals won the last big war, and Valhalla had to give up a bunch of their territories here in the New World. Of course, the Royals just wanted this place for our resources. Some of the old fellas here were Norse Transports, from back in the day, but most of us were Transported here by Her Majesty.”",
            "nextCardsID": [
                "BifröstShore21"
            ]
        },
        {
            "cardID": "BifröstShore21",
            "cardText": "Where are you from?",
            "addedText": "“I'm Imperial myself, born and raised there, so you know where my loyalties lie, but in truth no one knows who set up their colony on the island of New Atlantis first. Both cities grew large, takin up both sides of the bay, and then the cliffside between. They grew into each other, and trade with each other, and intermingle so much that they operate more like one giant city now. Some still call the whole big mess Njordheim or Mayfair, but that’s mostly just old-school Valhallans, or Imperials. Most folks don’t want to ruffle those feathers, and just keep referrin to the city the way it had always been marked on maps - with the letter X. In fact, in the last War of Piety, even though the Empire and Valhalla were on opposin sides, X stayed out of the fightin.”",
            "nextCardsID": [
                "BifröstShore22"
            ]
        },
        {
            "cardID": "BifröstShore22",
            "cardText": "So I should head to New Atlantis?",
            "addedText": "“Yep, you gotta see it. It’s a beaut of a city. All those years of competition between the Royal Empire and Valhalla meant both nations sent a lot of citizens to colonize the area. And they’ve had a couple hundred years to take advantage of all the local resources. I doubt if any place in the Olden Worlde is as impressive as X - long, busy streets, a market so big you could buy anythin you please, a gladiator’s arena, talkin cats, libraries, you name it - they got it all. I’ve served my sentence workin all over these islands, but there ain't no city out there like X.”<br><br>“I tell ya what, by regulation, I’m not supposed to give away any supplies, and we’ve already used good bandages on you. The HMNS Humboldt is scheduled to dock here in 3 days to pick up our goods for the Empire, and she’ll be headin to New Atlantis. So, I can give you room and board and medicine until the X-bound ship comes by if yer willin to do some honest labour around here until then. Deal?”",
            "nextCardsID": [
                "BifröstShore23"
            ]
        },
        {
            "cardID": "BifröstShore23",
            "cardText": "It’s a deal.",
            "addedText": "“Good to hear. No shame in an honest day’s work. Chores are about done for the day though. Dinner’ll be served soon. Up for a game of Life or Death?”",
            "rewards": [
                {"rewardName": "day until the Humboldt arrives",
                "rewardQuantity": 3}
            ],
            "openQuest": {"questID": "GoToNewAtlantis", "questTitle": "Travel to New Atlantis", "questDescription": "The city of X, on the island of New Atlantis seems to be the hub of civilization in this part of the New World. In order to go there though, you'll need to find some way of getting off of the Bifröst Island Prison Camp"},
            "nextCardsID": [
                "BifröstShore24"
            ]
        },
        {
            "cardID": "BifröstShore24",
            "cardText": "It’s got to be better than it sounds.",
            "addedText": "Resolute Warder Quo leaves for a moment and returns with a rough square board consisting of a 8 x 8 grid of light and dark wooden tiles. He takes pieces out of a small wooden box and arranges them on the board.<br><br>“Ever played chess? Well this is nuthin like that; this is Life or Death.” Quo explains the movements that each piece can make - it sounds a lot like chess.<br><br>“Now pay attention, cuz this'll help you here in the New World. There are five main strategies that you can use in this game. Just like in yer own life too. They’re called Brawn, Hand, Heart, Eye, and Voice. You’re gonna start off with no skills with all of these strategies, but you can improve them with practice. Lemme show you,” Quo says, pushing a red piece forward.<br><br>“Let’s say I move my Soldier forward like this. You can take my Soldier out using one of your Vikings. This is what we’d call a Brawn move - just go in and smash. Brawn values quantity over quality. Brawn overwhelms the enemy with sheer power and numbers.",
            "rewards": [
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": 16},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": 16}
            ],
            "nextCardsID": [
                "BifröstShore25"
            ]
        },
        {
            "cardID": "BifröstShore25",
            "cardText": "Ask about Brawn",
            "addedText": "You want examples of Brawn? Just look at the Royal Empire’s Navy, or Odin’s Armada from Valhalla. They just try to stampede over everyone else. Even the Post and the New Foundland Company use a lot of Brawn in how they handle the banking and trading here in the New World. They all rely on strength and power. Now, the downfall of Brawn is that it isn’t flexible. Once Brawn commits to a course, there ain’t no turnin back, even if you realize it’s the wrong course. Brawn just isn’t flexible, but when power is needed, Brawn gets the job done. Vikings are one of the Brawniest pieces in the game - choose one of your Vikings to take out my Soldier.”",
            "cardStyle": "brawnCardStyle",
            "nextCardsID": [
                "BifröstShore26"
            ]
        },
        {
            "cardID": "BifröstShore26",
            "cardText": "Take out red Soldier with blue Viking",
            "challengeStat": "Brawn",
            "challengeRoll": 5,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore27"
            ],
            "challengeSuccessText": "“Good job, attackin my Soldier diagonally. You took out my piece and your Viking is safe,” Quo says as he moves another piece into play. ",
            "challengeFailRewards": [
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1},
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstShore27"
            ],
            "challengeFailText": "“You attacked my Soldier head on. You took out my piece but your Viking is at risk,” Quo says as he captures your Viking.” "
        },
        {
            "cardID": "BifröstShore27",
            "cardText": "keep playing",
            "addedText": "After a couple more moves, no further pieces are captured.<br><br>“Ok, now here’s a perfect situation to teach you somethin new. Brawn is just one strategy, some would say the most effective strategy, some would disagree. This is a time when Brawn will let you down though. See my red Viking? Since you’re new at this, I’ll let you know that she’s gonna mess you up in short order. But if you take her head on, my Gladiator will make short work of you. You’d be better off usin a more round-about strategy of takin out my Gladiator first, then my Viking. You need a more flexible piece that has less power, but longer range than the Viking, like your Cat or Dog. We call this a Hand move.",
            "nextCardsID": [
                "BifröstShore27a"
            ]
        },
        {
            "cardID": "BifröstShore27a",
            "cardText": "Ask about Hand",
            "addedText": " Hand is sorta the opposite strategy of Brawn. Hand is flexible, nimble, dexterous, like an acrobat or a spy. Hand strategy turns your opponent’s power against themselves. Animals are a great example of Hand. Look at an octopod camouflagin with the coral in order to catch it’s prey, or a cat stealthily stalkin its prey. Hand is smart, and also sneaky. Some folks don’t rightfully trust Hand - and with good reason. Hand can be the strategy of the intelligent - it can also be the strategy of thieves.”<br><br>“Now, note that this time you’ll have two options. It’ll be easier to take out my Gladiator and Viking if you sacrifice your blue Cat, but if you play your next few moves right, your Dog can take them both out and still be safe himself. The Dog is riskier than the cat, but usually with greater risk comes greater reward if you win. Greater loss if you lose though.”",
            "cardStyle": "handCardStyle",
            "nextCardsID": [
                "BifröstShore28a",
                "BifröstShore28b"
            ]
        },
        {
            "cardID": "BifröstShore28a",
            "cardText": "Take out red Gladiator and red Viking, sacrificing your blue Cat",
            "challengeStat": "Hand",
            "challengeRoll": 2,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -2},
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore29"
            ],
            "challengeSuccessText": "“Good job, You took out two of my powerful pieces with back to back moves. Sure you lost yer own in the process, but overall it worked out well.” ",
            "challengeFailRewards": [
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -2},
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -2}
            ],
            "challengeFailCards": [
                "BifröstShore29"
            ],
            "challengeFailText": "“Well, that’s one way to do it I suppose. You took out two of my powerful pieces with back to back moves, and only had to sacrifice one of your own. Good work. But look at how the board stands now. Your blue Soldier is dead meat.” "
        },
        {
            "cardID": "BifröstShore28b",
            "cardText": "Take out red Gladiator and red Viking, with your blue Dog",
            "challengeStat": "Hand",
            "challengeRoll": 5,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -2}
            ],
            "challengeSuccessCards": [
                "BifröstShore29"
            ],
            "challengeSuccessText": "“Good job, You took out two of my powerful pieces with back to back moves. And dammit, your Dog is safe too. Well played.” ",
            "challengeFailRewards": [
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -2},
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstShore29"
            ],
            "challengeFailText": "“Well, you took out two of my powerful pieces with back to back moves, and didn’t even have to sacrifice your Dog. Good work. But look at how the board stands now. Your blue Soldier is dead meat.” "
        },
        {
            "cardID": "BifröstShore29",
            "cardText": "Keep playing",
            "addedText": "You play a few more moves, when Quo dramatically places one of his pieces forward.<br><br>“See that? My Monk is right in line to take your Queen. You know what happens when the Queen is gone? Call to Claim! Game over! Defend your Queen right now or you lose the game. So you know what that means? Any strategy you were plannin before is out the window. You’ve got to abandon everything, rush home and defend your Queen. There’s a name for this strategy too: Heart. Heart relies on those gut instincts. Heart does the right thing, and defends what is most important. No matter what machinations you had in mind, that doesn’t matter any more. Heart is what you need now.”",
            "nextCardsID": [
                "BifröstShore30"
            ]
        },
        {
            "cardID": "BifröstShore30",
            "cardText": "Ask about Heart",
            "addedText": "“A lot of them native folks who been livin around here since before the Olden Worlde discovered the New - they’re all Heart. They’re steadfast in their traditions. Those Amazon warrior women, they come into this world knowin how to fight; the Sirens are masters of the sea; the Vulcans know more about machinery than anyone, and the Cursed - well you don’t want to go up against the Cursed. That’s why when the fleets from the Empire and Valhalla came in here centuries ago with all their ideas of conquest, all those New World natives were able to kick their behinds to the Olden Worlde! They went with their gut, their culture that they’d been developin for millennia. Heart is all about emotion and tradition. Some say it can be the most powerful strategy, but you gotta be careful with Hearth - it can be foolhardy and blind to logic.”",
            "cardStyle": "heartCardStyle",
            "nextCardsID": [
                "BifröstShore31a",
                "BifröstShore31b"
            ]
        },
        {
            "cardID": "BifröstShore31a",
            "cardText": "Defend your blue Queen with blue Mermaid",
            "challengeStat": "Heart",
            "challengeRoll": 2,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1},
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore32"
            ],
            "challengeSuccessText": "“Nice. My Monk is outta the picture. As is your Mermaid, but it was the price you had to pay to stay in the game. Your Queen is safe… for now.” ",
            "challengeFailRewards": [
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1},
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -2}
            ],
            "challengeFailCards": [
                "BifröstShore32"
            ],
            "challengeFailText": "“Ouch. Well, you took out my Monk, but it cost you your Mermaid. And in doin so, you left that Gladiator of yours completely undefended. I’ll just take that from you too.” "
        },
        {
            "cardID": "BifröstShore31b",
            "cardText": "Defend your blue Queen with blue Wraith",
            "challengeStat": "Heart",
            "challengeRoll": 5,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -2},
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore32"
            ],
            "challengeSuccessText": "“Damn, I didn’t think you would see that move! You took my Monk and saved your Queen. I got to take your Wraith, but in this placement, my Soldier is helpless.” ",
            "challengeFailRewards": [
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1},
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstShore32"
            ],
            "challengeFailText": "“Nice. My Monk is outta the picture. As is your Wraith, but it was the price you had to pay to stay in the game. Your Queen is safe… for now.” "
        },
        {
            "cardID": "BifröstShore32",
            "cardText": "Keep playing",
            "addedText": "“You pick up these strategies well, but now I got somethin a little different for you to try,” Resolute Warder Quo says after a few more moves. “I want you to try an Eye strategy.”<br><br>“Eye is all about bein watchful and observant. The Eye pauses to look for weak points that can be exploited and predicts the future by evaluatin the present. Some would say that an Eye strategy is too passive - too inactive, and it lacks the power or flexibility to obtain benefit in the short-term; the Eye’s strategy is long-term. There are times when that’s appropriate, and times when it’s not.”",
            "nextCardsID": [
                "BifröstShore33"
            ]
        },
        {
            "cardID": "BifröstShore33",
            "cardText": "Ask about Eye",
            "addedText": "Anyone who uses the Eye strategy is a corkscrew thinker - they think outside the box. When the Privateers or Thor’s Vikings are able to use a tiny sloop to capture a big ol’ Imperial galleon, that shows skill with Eye. They’ve gotta be creative to take on a big enemy with big resources, but they do. The scientists of the Pneumatic Institute would definitely be believers of the Eye strategy. They observe, learn, invent. Not to mention the followers of the Animate. Those witches claim to be able to talk to the dead and see lost treasures.”<br><br>“Now, I’ve got a couple good strategies that I set up in the last couple of moves. You can block me though, if you use your Eye skill, observe the board, and try to figure out how to stop me in my tracks.”",
            "cardStyle": "eyeCardStyle",
            "nextCardsID": [
                "BifröstShore34"
                ]
        },
        {
            "cardID": "BifröstShore34",
            "cardText": "Try to figure out Quo’s next move",
            "challengeStat": "Eye",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstShore35"
            ],
            "challengeSuccessText": "You move your blue Wraith into position to block Quo’s red Dog.<br><br>“Ah, you figured me out! I thought my Dog would be able to sneak in there and eliminate both your Mermaid and your Monk.” ",
            "challengeFailRewards": [
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1},
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -2}
            ],
            "challengeFailCards": [
                "BifröstShore35"
            ],
            "challengeFailText": "You use your blue Wraith to capture Quo’s red Wraith.<br><br>“Ah, I was hoping you’d fall for that,” Quo says as he moves his red Dog piece in for the kill. He captures your Mermaid, and you realize that there’s nothing you can do to stop him from taking your Monk on his next move. "
        },
        {
            "cardID": "BifröstShore35",
            "cardText": "Keep playing",
            "addedText": "“There’s just one more strategy that that this game relies on: Voice. It’s what you’d think it is. The ability to communicate well, in such a way that you can convince people of your point of view. Some would say that Voice is a sneakier skill, since it can be used to confuse or manipulate folks. But if someone’s gonna force me to see things their way, I’d rather they try an’ convince me with Voice than bash me on the head with Brawn!”",
            "nextCardsID": [
                "BifröstShore36"
            ]
        },
        {
            "cardID": "BifröstShore36",
            "cardText": "Ask about Voice",
            "addedText": "“Of course, the Gladiators use Voice a lot. But watch it if you go to their gamblin houses - their Voice skill will rob you of all your money! The Sisters of Freya too. Through the confessions they receive, they’ve gained quite a lot of information about the sins of New Atlantans - and I hear they put that knowledge to good use. The medics workin for the Salt Hearts of course use the Voice strategy too, to learn and train in how to fix people up. You know who really uses a Voice strategy a lot - too much maybe, is those subversive Librarians! It’s ironic that you can’t shush a Librarian once they get started…”<br><br>“Voice strategies aren’t always verbal though. Try to use Voice here to mislead me. At some point in the next few moves, try to throw me off. Make a move that implies a you’re gonna use one strategy, when you actually plan to use another, in order to convince me to misstep.”",
            "cardStyle": "voiceCardStyle",
            "nextCardsID": [
                "BifröstShore37"
                ]
        },
        {
            "cardID": "BifröstShore37",
            "cardText": "Make a misleading move",
            "challengeStat": "Voice",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore38"
            ],
            "challengeSuccessText": "After making a couple moves that shore up your defences, you advance a Gladiator and a Librarian. Quo chooses to defend against the Librarian. He fell for it! You march your Gladiator in to capture his own Librarian, and threaten his Queen.<br><br>“Uh oh, you’re gettin dangerously close to my Queen! She’ll be able to save herself, but you fooled me well with that false Librarian.” ",
            "challengeFailRewards": [
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstShore38"
            ],
            "challengeFailText": "After making two moves that shore up your defences, you advance a Gladiator and a Librarian. Quo chooses to defend against the Gladiator. Crap.<br><br>“Uh oh, that Gladiator would’ve been able to do some real damage if I had paid any attention to that tricky little Librarian of yours. Nice try, but you won’t capture any of pieces that easily,” Quo says, as he uses his Soldier to remove your Gladiator from the board. "
        },
        {
            "cardID": "BifröstShore38",
            "cardText": "keep playing",
            "addedText": "“Very well, you’ve shown a decent understandin of the five major strategies of this game. Brawn represents strength & power, Hand represents adaptability & nimbleness, Heart represents emotion & tradition, Eye represents observation & watchfulness, and Voice represents persuasion & communication. ”<br><br>“You know what, I’ve got a little somethin special for you as a prize if you can beat me. Let’s finish this game.”",
            "nextCardsID": [
                "BifröstShore39"
                ]
        },
        {
            "cardID": "BifröstShore39",
            "cardText": "keep playing",
            "addedText": "It’s your turn. What move will you make?",
            "reqs": [
                {"reqName": "Quo’s Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true},
                {"reqName": "Your Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "BifröstShore40Brawn",
                "BifröstShore40Hand",
                "BifröstShore40Heart",
                "BifröstShore40Eye",
                "BifröstShore40Voice"
                ]
        },
        {
            "cardID": "BifröstShore40Brawn",
            "cardText": "Use Brawn strategy",
            "reqs": [
                {"reqName": "Your Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true},
                {"reqName": "Quo’s Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true}
            ],
            "randomTerms": ["Viking,Gladiator", "Viking,Cat,Wraith,Soldier,Dog,Gladiator,Librarian,Mermaid,Monk"],
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeSuccessText": "In a bold move, you use one of your remaining blue {0}s to take out one of Quo’s red {1}s. ",
            "hiddenIfReqsFail": true,
            "challengeFailRewards": [
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeFailText": "You try to forcefully advance one of your remaining blue {0}s, but Quo takes it out with his red {1}. "
        },
        {
            "cardID": "BifröstShore40Hand",
            "cardText": "Use Hand strategy",
            "reqs": [
                {"reqName": "Your Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true},
                {"reqName": "Quo’s Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true}
            ],
            "randomTerms": ["Cat,Wraith", "Viking,Cat,Wraith,Soldier,Dog,Gladiator,Librarian,Mermaid,Monk"],
            "challengeStat": "Hand",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeSuccessText": "You sneakily move your blue {0} into position. Quo didn’t see it coming, and he is forced to lose his one of his {1}s. ",
            "hiddenIfReqsFail": true,
            "challengeFailRewards": [
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeFailText": "You try to sneak up on Quo with a {0} but he figures out your strategy, and knocks it off the board with his red {1}. "
        },
        {
            "cardID": "BifröstShore40Heart",
            "cardText": "Use Heart strategy",
            "reqs": [
                {"reqName": "Your Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true},
                {"reqName": "Quo’s Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true}
            ],
            "randomTerms": ["Soldier,Dog", "Viking,Cat,Wraith,Soldier,Dog,Gladiator,Librarian,Mermaid,Monk"],
            "challengeStat": "Heart",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeSuccessText": "You take a stab directly at Quo’s Queen with your blue {0}. He defends, but is flustered and makes a poor move. His {1} is yours. ",
            "hiddenIfReqsFail": true,
            "challengeFailRewards": [
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeFailText": "You strike right at Quo’s Queen with your blue {0}, but he defends easily with a {1} and your {0} is lost. "
        },
        {
            "cardID": "BifröstShore40Eye",
            "cardText": "Use Eye strategy",
            "reqs": [
                {"reqName": "Your Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true},
                {"reqName": "Quo’s Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true}
            ],
            "randomTerms": ["Gladiator,Librarian", "Viking,Cat,Wraith,Soldier,Dog,Gladiator,Librarian,Mermaid,Monk"],
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeSuccessText": "It looks like Quo is trying to place his {1} within striking distance of your Queen. You position your {0}, so that when he tries, you are able to capture his {1} handily. ",
            "hiddenIfReqsFail": true,
            "challengeFailRewards": [
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeFailText": "It appears that Quo is setting up his {1} for an attack on your Queen. You pre-empt him by blocking him with your {0}, but it turns out that was just a ploy. With your {0} out in the open, he easily captures it. "
        },
        {
            "cardID": "BifröstShore40Voice",
            "cardText": "Use Voice strategy",
            "reqs": [
                {"reqName": "Your Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true},
                {"reqName": "Quo’s Life or Death piece",
                "reqRule": ">",
                "reqQuantity": 3,
                "reqHidden": true}
            ],
            "randomTerms": ["Viking,Gladiator,Cat,Wraith,Soldier,Dog,Gladiator,Librarian", "Mermaid,Monk", "Viking,Cat,Wraith,Soldier,Dog,Gladiator,Librarian,Mermaid,Monk"],
            "challengeStat": "Voice",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Quo’s Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeSuccessText": "You try to throw Quo off. You advance your {0}, as if you are making a move on his Queen. He tries to defend though, and in doing so he leaves his {2} wide open. It’s easy to swoop in with your {1} as you had planned all along. ",
            "hiddenIfReqsFail": true,
            "challengeFailRewards": [
                {"rewardName": "Your Life or Death piece",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstShore39",
                "BifröstShore41Won",
                "BifröstShore41Lost"
            ],
            "challengeFailText": "You try to throw Quo off his game. You advance your {0}, as if you are about to make a move on his Queen, but your real plan is to draw out one of his pieces and capture it with your {1}. He realizes that you wouldn’t be so careless to go for his Queen at this point though, and doesn’t respond to your feint. Instead he uses a move that you hadn’t seen coming at all, and with his {2} he captures your {0} while at the same time blocks your {1} from retaliating. Damn. "
        },
        {
            "cardID": "BifröstShore41Won",
            "cardText": "Call to Claim",
            "reqs": [
                {"reqName": "Quo’s Life or Death piece",
                "reqRule": "<",
                "reqQuantity": 4}
            ],
            "addedText": "“Dammit, you got call to claim,” Quo says, shaking his head. “That’s the phrase you use when you win at Life or Death. You got my Queen locked down, and there’s nuthin I can do to save her.<br><br>“It certainly is nice to play against someone who can pick up the strategy of a game like this though. Most of the folk here’d rather play Smarts or some such.”",
            "setScore": [
                {"setName": "Your Life or Death piece",
                "setQuantity": 0},
                {"setName": "Quo’s Life or Death piece",
                "setQuantity": 0}
            ],
            "hiddenIfReqsFail": true,
            "rewards": [
                {"rewardName": ["Convicts"],
                "rewardQuantity": [3],
                "rewardRange": [1]}
            ],
            "nextCardsID": [
                "BifröstShore41Choose"
            ]
        },
        {
            "cardID": "BifröstShore41Lost",
            "cardText": "You lose",
            "reqs": [
                {"reqName": "Your Life or Death piece",
                "reqRule": "<",
                "reqQuantity": 4}
            ],
            "addedText": "“Call to claim,” Quo states matter-of-factly. “That’s the phrase you use when you win at Life or Death. I’ve got your Queen locked down, and there’s no moves left for you to stop me. It certainly is nice to play against someone who can pick up the strategy of a game like this though. Most of the folk here’d rather play Smarts or some such.”",
            "setScore": [
                {"setName": "Your Life or Death piece",
                "setQuantity": 0},
                {"setName": "Quo’s Life or Death piece",
                "setQuantity": 0}
            ],
            "rewards": [
                {"rewardName": ["Convicts"],
                "rewardQuantity": [2],
                "rewardRange": [1]}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore41Choose"
                ]
        },
        {
            "cardID": "BifröstShore41Choose",
            "cardText": "continue",
            "addedText": "“I got a prize I’ll give you regardless - maybe it’ll help you win next game. You seem to be good folk, and you certainly proved you’re capable. Your prize depends on which strategy you like to choose - not just in this game, but in life.” You learned about all five skills while we were playing there. Which one speaks to you most?",
            "nextCardsID": [
                "BifröstShore41Brawn",
                "BifröstShore41Hand",
                "BifröstShore41Heart",
                "BifröstShore41Eye",
                "BifröstShore41Voice"
                ]
        },
        {
            "cardID": "BifröstShore41Brawn",
            "cardText": "Choose Brawn. I like to solve a situation directly by relying on my might.",
            "addedText": "“Brawn, I appreciate that. Might makes right. You’ll find like-minded folks if you seek out the Olden Worlde powers and the folks who turn the wheels of commerce when you make your way to New Atlantis. Here take this. It’ll help you out whenever your Brawn is put to the test.”",
            "cardStyle": "brawnCardStyle",
            "rewards": [
                {"rewardName": "Brawn",
                "rewardQuantity": 5050}
            ],
            "nextCardsID": [
                "BifröstShore42"
            ]
        },
        {
            "cardID": "BifröstShore41Hand",
            "cardText": "Choose Hand. I like to solve a situation indirectly by relying on my finesse.",
            "addedText": "“Hand, I understand that. Quality over quantity. You’d be surprised how helpful the animals of New Atlantis can be when you’ve made your way to New Atlantis. Here take this. It’ll help you out whenever your Hand is put to the test.”",
            "cardStyle": "handCardStyle",
            "rewards": [
                {"rewardName": "Hand",
                "rewardQuantity": 5050}
            ],
            "nextCardsID": [
                "BifröstShore42"
            ]
        },
        {
            "cardID": "BifröstShore41Heart",
            "cardText": "Choose Heart. I like to solve a situation honorably by relying on what I know to be true in my heart.",
            "addedText": "“Heart, I admire that. Emotions make us human, after all. You’d be surprised how helpful the locals of the New Worlde can be for someone like you who follows your heart, and who respects their traditions. Here take this. It’ll help you out whenever your Heart is put to the test.”",
            "cardStyle": "heartCardStyle",
            "rewards": [
                {"rewardName": "Heart",
                "rewardQuantity": 5050}
            ],
            "nextCardsID": [
                "BifröstShore42"
            ]
        },
        {
            "cardID": "BifröstShore41Eye",
            "cardText": "Choose Eye. I like to solve a situation uniquely, through thought and observation.",
            "addedText": "“Eye, I respect that. You’re a corkscrew thinker. New Atlantis is full of renegades and rebels of various sorts who like to think outside the box. Some are friendly, some are not; all of them are … unique. Here take this. It’ll help you out whenever your Eye is put to the test.”",
            "cardStyle": "eyeCardStyle",
            "rewards": [
                {"rewardName": "Eye",
                "rewardQuantity": 5050}
            ],
            "nextCardsID": [
                "BifröstShore42"
            ]
        },
        {
            "cardID": "BifröstShore41Voice",
            "cardText": "Choose Voice. I like to solve a situation subtly by relying on my powers of persuasion.",
            "addedText": "“Voice, I’m not surprised by that. The pen is mightier than the sword, after all. There are many in New Atlantis who seek to make social change in the New Worlde, but by many different means. You should look them up when you’ve made your way to New Atlantis. Here take this. It’ll help you out whenever your Voice is put to the test.”",
            "cardStyle": "voiceCardStyle",
            "rewards": [
                {"rewardName": "Voice",
                "rewardQuantity": 5050}
            ],
            "nextCardsID": [
                "BifröstShore42"
            ]
        },
        {
            "cardID": "BifröstShore42",
            "cardText": "continue",
            "addedText": "As Resolute Convict Quo gets up and leaves the room, another convict comes in with a tray of food for you. The stew tastes delicious, probably due to the fact that you haven’t eaten in days. Out of the corner of your eye, you see your lockbox. Or at least, you now think of it as yours. After all, it’s more yours than anyone else’s since the original owner of this lockbox and matching jacket must have perished in the shipwreck.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": 5},
                {"rewardName": "Mind",
                "rewardQuantity": 5},
                {"rewardName": "mysterious lockbox",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore43TestingRandomnessDELETE",
            "cardText": "continueto43",
            "addedText": "44",
            "rewards": [
                {"rewardName": ["Royal sterling", "Valhallan mark", "New Foundland scrip", "Aero stamp"],
                "rewardQuantity": [10, 10, 10, 10],
                "rewardRange": [20, 20, 20, 20]},
                {"rewardName": ["fig", "kumquat"],
                "rewardQuantity": [5, 1000],
                "rewardRange": [2, 2]}
            ],
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore43",
            "cardText": "Continue to inspect the lockbox",
            "addedText": "The sturdy lockbox sits on the table before you. The three numbered dials of the locking mechanism continue to hinder your access.",
            "nextCardsID": [
                "BifröstShore44Open",
                "BifröstShore44Unlock",
                "BifröstShore44Front",
                "BifröstShore44Spine",
                "BifröstShore44Mechanism",
                "BifröstShore44Jacket",
                "BifröstShore44Monocle",
                "BifröstShore45Monocle",
                "BifröstShore45Front",
                "BifröstShore45Unlock",
                "BifröstShore45Mechanism",
                "BifröstShore45Jacket"
                ]
            },
        {
            "cardID": "BifröstShore44Open",
            "cardText": "Try opening the box",
            "addedText": "You hope it might just happen to be unlocked. But no, this isn’t going to be that easy.",
            "reqs": [
                {"reqName": "Voynich code",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore44Front",
            "cardText": "Inspect the front of the box",
            "addedText": "The lockbox is decorated to resemble a book. Strange script flows all around it, the letters of which do not resemble any language you are familiar with. The symbol that adorns the front of your jacket is similar, but this one is more detailed. You can see that it appears to be a triangle, perhaps made of bird wings. There is a series of what appear to be letters, positioned just above the wing-symbol. Judging by how intricate the workmanship is, the craftsmanship of the lockbox must be of fairly high quality.",
            "reqs": [
                {"reqName": "wing-symbol lens",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true},
                {"reqName": "Voynich lens",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore44Unlock",
            "cardText": "Try to unlock the box",
            "addedText": "The dials are numbered from 1 to 60 and you have no idea what combination to try. You try a few random guesses but nothing works.",
            "reqs": [
                {"reqName": "Voynich code",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore44Spine",
            "cardText": "Inspect the spine of the box",
            "addedText": "Since the lockbox resembles a book, it has a spine. The same unfamiliar script appears here as on the rest of the box. The hinges must be on the inside of the lockbox, and there do not seem to be any visible weaknesses or seams that you can exploit to pry the box open. Besides, you certainly don’t want to force it open and risk damaging whatever is inside of it.",
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore44Mechanism",
            "cardText": "Inspect the locking mechanism",
            "addedText": "The dials are sturdy and don’t offer any hints as to what the code is. There are three tiny scratches - one above each dial. They must indicate the home position of the dial. You notice it is strange that whereas all three dials look identical, the scratches above them each look slightly different, This seems odd on a lockbox of such high craftsmanship.",
            "reqs": [
                {"reqName": "wing-symbol lens",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true},
                {"reqName": "Voynich lens",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore44Jacket",
            "cardText": "Inspect your jacket",
            "addedText": "The symbol on the jacket and text above it certainly match those of the lockbox, only in less detail on the leather, indicating that whoever owned this jacket probably also owned this lockbox too… until you stole it… accidentally, of course.<br><br>The jacket has several pockets.",
            "reqs": [
                {"reqName": "wing-symbol lens",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true},
                {"reqName": "Voynich lens",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore44Pocket"
            ]
        },
        {
            "cardID": "BifröstShore44Pocket",
            "cardText": "Inspect the jacket pockets",
            "addedText": "Upon turning out the pockets, you find an assortment of useful items. There are some coins of different currencies, as well as an envelope. The coins are all ones you recognize originating in the Olden Worlde, from the Royal Empire and Valhalla, as well as stamps for the Poste, and some paper currency for the New Foundland Company, the corporation that controls much of the trade and exploration of the New World.",
            "rewards": [
                {"rewardName": "wing-symbol envelope",
                "rewardQuantity": 1},
                {"rewardName": "Royal shilling",
                "rewardQuantity": 78},
                {"rewardName": "Valhallan mark",
                "rewardQuantity": 3},
                {"rewardName": "Poste stamp",
                "rewardQuantity": 8},
                {"rewardName": "New Foundland scrip",
                "rewardQuantity": 50}
            ],
            "nextCardsID": [
                "BifröstShore44Envelope"
            ]
        },
        {
            "cardID": "BifröstShore44Envelope",
            "cardText": "Open the wing-symbol envelope",
            "addedText": "The envelope has no writing on it, but is sealed. The same wing-symbol is embossed on the corner of the paper, where a stamp would normally be placed. You tear it open and withdraw a letter from inside as well as a small object wrapped in white silk. The letter is short and, once again, written in this language you are not familiar with. Upon unwrapping it, the silk appears to be a handkerchief used to protect a monocle. The glass lens is polished smooth, housed in a gold frame. The fob used for holding the monocle features the same wing symbol. You gaze through the lens and see a slightly green-ish version of your world.",
            "reqs": [
                {"reqName": "wing-symbol envelope",
                "reqRule": ">=",
                "reqQuantity": 1}
            ],
            "rewards": [
                {"rewardName": "wing-symbol lens",
                "rewardQuantity": 1}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore44Monocle",
            "cardText": "Inspect the monocle",
            "addedText": "The green tinted glass of the monocle is exceedingly smooth, so you decide to keep it protected in the handkerchief when not using it. The gold rim has a fob with which to hold the monocle. This handle features the wing-symbol, and some mysterious text above.",
            "reqs": [
                {"reqName": "wing-symbol lens",
                "reqRule": ">=",
                "reqQuantity": 1,
                "reqHidden": true}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore45Monocle",
            "cardText": "Inspect the monocle",
            "addedText": "The green tinted glass of the monocle is exceedingly smooth, so you decide to keep it protected in the handkerchief when not using it. The gold rim has a fob with which to hold the monocle. This handle features the wing symbol, and it clearly says the word VOYNICH above.",
            "reqs": [
                {"reqName": "Voynich character",
                "reqRule": ">=",
                "reqQuantity": 1}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore45Jacket",
            "cardText": "Inspect your jacket",
            "addedText": "The symbol on the jacket and text above it certainly match those of the lockbox. It’s odd that you weren’t able to read it before, but now even without looking through the monocle you can quite clearly read that it spells out the word VOYNICH right above the wing-symbol.",
            "reqs": [
                {"reqName": "Voynich lens",
                "reqRule": ">=",
                "reqQuantity": 1}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore45Front",
            "cardText": "Inspect the lockbox using the lens",
            "addedText": "The fact that this lockbox bears resemblance to a book is not the only unique thing about it. The foreign text decorating the front is just as illegible with or without the lens. The symbol with three bird wings arranged in a triangle is featured on the front. Looking through the lens, you can now make out the letters above the triangle. They spell out the word “VOYNICH”. You put down the lens, and you can now clearly see the letters spelling out VOYNICH clearly.",
            "reqs": [
                {"reqName": "wing-symbol lens",
                "reqRule": ">=",
                "reqQuantity": 1}
            ],
            "rewards": [
                {"rewardName": "wing-symbol lens",
                "rewardQuantity": -1},
                {"rewardName": "Voynich lens",
                "rewardQuantity": 1},
                {"rewardName": "mysterious lockbox",
                "rewardQuantity": -1},
                {"rewardName": "Voynich lockbox",
                "rewardQuantity": 1},
                {"rewardName": "Voynich character",
                "rewardQuantity": 7}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore45Mechanism",
            "cardText": "Inspect the locking mechanism using the lens",
            "addedText": "There is a very tiny scratch above each of the three dials that, at first, appears to merely indicate the home position of the dial. But when you peer carefully through the green-tinted lens, you see that they are actually tiny numbers: ‘18’ above the first dial, ‘26’ above the second, and ‘34’ above the third.",
            "reqs": [
                {"reqName": "Voynich lens",
                "reqRule": ">=",
                "reqQuantity": 1},
                {"reqName": "Voynich code",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Voynich code",
                "rewardQuantity": 182634}
            ],
            "hiddenIfReqsFail": true,
            "nextCardsID": [
                "BifröstShore43"
            ]
        },
        {
            "cardID": "BifröstShore45Unlock",
            "cardText": "Set the dials to the code",
            "addedText": "You set the three dials to 18, 26, and 34, and hear a soft click.",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "Voynich code",
                "reqRule": "=",
                "reqQuantity": 182634,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "BifröstShore46"
            ]
        },
        {
            "cardID": "BifröstShore46",
            "cardText": "Open the lockbox",
            "addedText": "You feel a chill of nervous anticipation course through your body as you lift the lid, encountering no resistance. Inside the book-shaped lockbox, you find: a book! This real book is much less ornate than its container. It has a non-descript black cover. There are no markings in any language on the cover or spine.",
            "nextCardsID": [
                "BifröstShore47"
            ]
        },
        {
            "cardID": "BifröstShore47",
            "cardText": "Read the book",
            "addedText": "The first pages of the book are hand-written notes. They are also written in an unfamiliar language, but this appears to be different than the language on the lockbox. There are seven pages of notes, followed by one blank page, followed by one more paragraph on the next page. The arrangement of the entries suggests the book was used as some sort of handwritten journal. It must have been shared by two different individuals, since that last separate paragraph is written in a clearly different handwriting than the first seven pages. Although it all appears to be in the same language, the first seven pages seem somehow more foreign than that one last paragraph.",
            "rewards": [
                {"rewardName": "mysterious journal",
                "rewardQuantity": 1}
            ],
            "openQuest": {"questID": "ReadJournal", "questTitle": "Translate the Mysterious Journal", "questDescription": "Find someone to help you decipher the journal that you found in the lockbox labeled Voynich, found in the Medusa shipwreck."},
            "nextCardsID": [
                "BifröstShore48"
            ]
        },
        {
            "cardID": "BifröstShore48",
            "cardText": "Read more of the mysterious journal",
            "addedText": "Whoever recorded their thoughts in this journal must have only begun so recently, as there are many blank pages that follow until halfway through. From there on, each page of the book has one single character along the right side of the page. It resembles an address book, having a page for all the A’s, then one for all the B’s, etc. But each page in the address section of this mysterious journal is blank. Perhaps the book’s old owner didn’t have many friends? Who on the Medusa owned this book, and were they one of the two authors? Are these languages from the local peoples of the New World, or from some darker corners of the Olden Worlde? Whatever the case, a curiosity wells up from within you. Resolute Warder Quo talked a lot about the metropolis of Capitol X, on New Atlantis Island. Perhaps someone there can help you to make sense of this mystery, or at least purchase it from you.",
            "openQuest": {"questID": "NewAtlantis", "questTitle": "Voyage to New Atlantis", "questDescription": "It is impossible to read anything in the mysterious journal that you found. Perhaps there is someone in New Atlantis who can be of help?"},
            "nextCardsID": [
                "BifröstShore49read",
                "BifröstShore50sleep"
            ]
        },
        {
            "cardID": "BifröstShore49read",
            "cardText": "Investigate the book more",
            "addedText": "Upon flipping through the pages, you can discern nothing else about the book. Of the hundreds of pages most are blank except for the first seven, written in one hand, and the last paragraph written by a different author. Taking a closer look at that last paragraph, you notice a spot where a line ends, probably representing two separate paragraphs rather than just one. The first seven pages are as inscrutable as before, but these last two paragraphs seem oddly familiar. It can’t be a language from the New World. It must be something that you came across before. Maybe in a museum, or in some foreign work of art? It’s nothing from the major Olden Worlde tongues, nothing Norse, not even a precursor to any of those. But you can’t shake the idea that you’ve seen something like it before.",
            "nextCardsID": [
                "BifröstShore50sleep"
            ]
        },
        {
            "cardID": "BifröstShore50sleep",
            "cardText": "Sleep",
            "addedText": "You replace the book in the lockbox - this is an island of thieves after all, even if Quo thinks they are all trustworthy. Although your mind has plenty to occupy it, your exhausted body quickly allows you to fall asleep.",
            "nextCardsID": [
                "BifröstShore51"
            ]
        },
        {
            "cardID": "BifröstShore51",
            "cardText": "Dream",
            "addedText": "You dream of smooth lines of small dark enclosure.<br><br>You dream of dreams that are not your own.<br><br>You dream of the thud as a metal coffin lid closes with you on the wrong side.",
            "nextCardsID": [
                "BifröstShore52"
            ]
        },
        {
            "cardID": "BifröstShore52",
            "cardText": "Wake up",
            "addedText": "You wake up to a banging sound. After your dreams return to the haze from whence they came, you get up and open the door to see a man standing at your door.<br><br>“Mornin, newbie. Resolute Warder Quo says you should join us at mess and then you’ll be on duty with the rest of us today.” You rub the sleep from your eyes as you process what he is saying. “Mess is on the other side of the rec yard,” he adds pointing with his thumb and then dashing off on his own.<br><br>You check your room, and your lockbox seems to be in order, as are your other possessions. You dress in a fresh pair of prison clothes that has been set out for you on a chair and head to the door.",
            "rewards": [
                {"rewardName": "prison uniform",
                "rewardQuantity": 1}
            ],
            "setScore": [
                {"setName": "time of day",
                "setQuantity": 0}
            ],
            "nextCardsID": [
                "BifröstShore53"
            ]
        },
        {
            "cardID": "BifröstShore53",
            "cardText": "Leave your quarters",
            "addedText": "Since you've still got a couple days until the HMNS Humboldt arrives, you may as well lend a hand. Besides, this could be a good chance for you to learn more about the New World. You step out your front door to finally get a better view of what a New World prison looks like, and it actually doesn’t look all that bad.",
            "rewards": [
                {"rewardName": "day until the Humboldt arrives",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "BifröstCamp01RecYard"
            ]
        },
        {
            "cardID": "BifröstCamp01RecYard",
            "cardText": "Enter the central rec yard",
            "locationName": "Bifröst Prison Camp, rec yard",
            "locationDescription": "The centre of the Bifröst prison camp is dominated by a moderately sized recreational yard. There are a couple of gaming areas set up.",
            "firstText": "The centre of the Bifröst prison camp is dominated by a moderately sized recreational yard, walled in by jungle trees, except for one part that is walled in by an actual wall. You can see the ocean through an open gate in the wall. It appears as though a couple of areas are set up for specific games, but no one is there right now. There is a camp office here and you can see a guard tower up on a nearby cliff. ",
            "addedText": "Not many inmates are hanging out in the rec yard, since they are finishing up their breakfast at the mess hall area and heading up to the burn hill to start work.",
            "nextCardsID": [
                "BifröstCamp01Quarters",
                "BifröstCamp01Office",
                "BifröstCamp01Wall",
                "BifröstCamp01Mess"
            ]
        },
        {
            "cardID": "BifröstCamp01Quarters",
            "cardText": "Return to your quarters",
            "locationName": "Bifröst Prison Camp, your quarters",
            "locationDescription": "A plain, but comfortable bunkhouse which could house four inmates, but you have it all to yourself. ",
            "firstText": "There are no locks on any of the prisoners’ quarters including the one reserved for you.  Perhaps Resolute Warder Quo was right when he reassured you that that you would have nothing to fear in terms of theft, since inmates aren’t allowed to own property anyway. ",
            "addedText": "You check on the lockbox in your quarters, and it still seems to be safe.",
            "nextCardsID": [
                "BifröstCamp01RecYard"
            ]
        },
        {
            "cardID": "BifröstCamp01Office",
            "cardText": "Go to the camp office",
            "locationName": "Bifröst Prison Camp, office",
            "locationDescription": "There are a few tables, chairs, and cabinets here, as you would expect in an office, but the majority of the room has been repurposed into a hospital.",
            "firstText": "You enter the small office beside the central rec yard. Instead of seeing Quo there, you see an elderly woman, dressed in inmates clothing.<br><br>“Well, it looks like someone’s doing much better today!” she says. She moves from bed to bed, since the majority of space in this office seems to have been repurposed into a makeshift hospital.<br><br>“We had a bad fire the day before you arrived,” she says, nodding to several patients laid up in beds with various levels of burns. “You seem to be doing fine though, she says inspecting your body. You probably don’t remember me, but you were brought here for treatment after they found you washed up on the shore.” ",
            "addedText": "Behind the beds, patients, and the old woman scrubbing out a bedpan, you see a couple file drawers, and a door that appears to lead to Resolute Warder Quo’s personal office.",
            "nextCardsID": [
                "BifröstCamp01RecYard",
                "BifröstCamp05QuoOffice"
            ]
        },
        {
            "cardID": "BifröstCamp01Wall",
            "cardText": "Go to the wall",
            "locationName": "Bifröst Prison Camp, wall",
            "locationDescription": "A stone wall barricades just one side of the prison camp. Through the gate, stone steps lead down to the beach and an ocean pier",
            "firstText": "A stone wall barricades just one side of the prison camp. In the center of the wall is a large gate, swung wide open. It looks as though it is rarely ever closed. Through the gate, stone steps can be seen leading down to the beach and an ocean pier where boats can dock. ",
            "addedText": "Since nature provides the barriers of the raw jungle and sea, this wall is probably more for keeping people out than for keeping people in.",
            "nextCardsID": [
                "BifröstCamp01RecYard",
                "BifröstCamp01Pier",
                "BifröstCamp05Warehouses"
            ]
        },
        {
            "cardID": "BifröstCamp01Pier",
            "cardText": "Go down to the pier",
            "locationName": "Bifröst Prison Camp, pier",
            "locationDescription": "A lone stone pier juts out into the ocean, serving as the only entrance or exit to Bifröst Island",
            "firstText": "Today the sea gently laps against the lone stone pier that serves as the only entrance or exit to Bifröst Island. Resolute Warder Quo is standing there, by piles of crates, scratching his head.<br><br>“Sumthin strange is going on in the New World, The Royal Empire’s been lettin tons of supplies build up here. And the sailors on the last ship weren’t allowed to speak with us convicts. Sumthin’s up for sure.”<br><br>",
            "addedText": "Like most days, there are no boats at this pier - just an empty beach.",
            "nextCardsID": [
                "BifröstCamp01Wall"
            ]
        },
        {
            "cardID": "BifröstCamp01Mess",
            "cardText": "Go to the mess",
            "locationName": "Bifröst Prison Camp, mess",
            "locationDescription": "Several rows of tables provide space for the hundred or so inmates here on Bifröst Island to eat.",
            "firstText": "Several rows of tables provide space for the hundred or so inmates here on Bifröst Island to eat. Food is not rationed strictly, since fruit, nuts, and fish are fairly plentiful here on this tropical island. Here you get to see the diversity in the makeup of the population in this prison camp. There are male and female prisoners, and even children too. It seems that the prisoners have the freedom to form families during their sentences. Either that, or Her Royal Highness doesn’t balk at sentencing children to Transportation. ",
            "addedText": "Now that you have a full stomach, you feel ready to head up to the burn hill to start work for the day.",
            "nextCardsID": [
                "BifröstCamp01RecYard",
                "BifröstCamp01BurnHill"
            ]
        },
        {
            "cardID": "BifröstCamp01BurnHill",
            "cardText": "Walk through the trees to the burn hill",
            "locationName": "Bifröst Prison Camp, burn hill",
            "locationDescription": "There is a smouldering pile of white ashes and glowing embers remaining from the previous day’s trashfire",
            "firstText": "The burn hill is exactly what it sounds like. At the top of the hill, there is a depression housing a smouldering pile of white ashes and glowing embers remaining from the previous day’s trashfire. ",
            "addedText": "From the firepit, there is a well-worn path back to the rest of the camp, and another leading off into the jungle with a sign labeled as ‘creches’.",
            "nextCardsID": [
                "BifröstCamp01Mess",
                "BifröstCamp01JungleCreches",
                "BifröstCamp01Work",
                "BifröstCamp01Bedtime"
            ]
        },
        {
            "cardID": "BifröstCamp01JungleCreches",
            "cardText": "Walk through the jungle to the creches",
            "locationName": "Bifröst Prison Camp, nesting creches",
            "locationDescription": "A large clearing in the jungle features a large pond surrounded by countless rows of nests and aviaries.",
            "firstText": "After a long uphill walk, you emerge from the trees and climb a small hill. You can hear them through the trees before you can see them: rows upon rows of nests and aviaries. Before you is the wealth of Bifröst Island - the reason why the Royal Empire built this prison work camp here. The entire plateau of the mesa is awash in a rainbow of colored feathers: neon yellow, hot pink, deep violet, blood red. Some cages are home to juvenile birds, while others house dozens of eggs.<br><br>“Flamingos don’t look like much when they’re young, but full grown adults can produce hundreds of feathers a week,” Resolute Warder Quo says as he walks up behind you. “And you know how much those feathers go for back in the Olden Worlde? The birds don’t do well in captivity though, so we just take care of em while they’re young and fragile so that we can have lots of productive adults flyin around in the wild.”<br><br>",
            "addedText": "“Feel free to pick some candlenuts here if you want a snack,” Quo says as he stands between rows of colorful aviaries and picks a few nuts off the nearest tree.",
            "nextCardsID": [
                "BifröstCamp01BurnHill",
                "BifröstCamp01PickCandlenuts"
            ]
        },
        {
            "cardID": "BifröstCamp01PickCandlenuts",
            "cardText": "Pick candlenuts",
            "firstText": "Candlenuts are one of the many food resources that are plentiful here on Bifröst Island. They grow on vines in many areas of the jungle, but there are always dense near the watering hole that the creches are built around. ",
            "addedText": "It doesn't take long to harvest several candlenuts - for use strictly as food, of course, not as currency.",
            "rewards": [
                {"rewardName": "Action",
                "rewardQuantity": -1},
                {"rewardName": ["candlenut"],
                "rewardQuantity": [8],
                "rewardRange": [3]}
            ],
            "reqs": [
                {"reqName": "Action",
                "reqRule": ">=",
                "reqQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCamp01JungleCreches",
                "BifröstCamp01PickCandlenuts"
            ]
        },
        {
            "cardID": "BifröstCamp01Work",
            "cardText": "Ready to work",
            "addedText": "Inmates are gathered around, finishing the last of their breakfast when Resolute Warder Quo steps up in front of the smouldering remnants of last night's fire.<br><br>“Ok, boys and girls, let’s get to work,” Resolute Warder Quo announces. “New friend, you’ve only got two days here before Her Majesty’s Navy Ship arrives to pick up our cargo, so I’ll let you pick which duty you want to help out with. It’ll help you develop your skills and learn about how things work around here.”",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "BifröstCampLabour01",
                "BifröstCampFishing01",
                "BifröstCampCreches01",
                "BifröstCampSalvage01",
                "BifröstCampFlamingos01",
                "BifröstCamp01NotReadyToWork"
            ]
        },
        {
            "cardID": "BifröstCamp01Bedtime",
            "cardText": "Ready to work",
            "addedText": "You may be ready to work, but the camp isn't. The sun is going down. Go back to your quarters and sleep.",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "time of day",
                "reqRule": "=",
                "reqQuantity": 3,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "BifröstCamp01BurnHill"
            ]
        },
        {
            "cardID": "BifröstCamp01NotReadyToWork",
            "cardText": "Not ready to work yet",
            "addedText": "Before starting work, you'd like to explore around the island a bit more first.”",
            "nextCardsID": [
                "BifröstCamp01BurnHill"
            ]
        },
        {
            "cardID": "BifröstCampLabour01",
            "cardText": "Perform manual labour",
            "addedText": "“Yer with me today then, noob.” Impulsive Convict Pana gestures to you and you follow him to a large stack of crates",
            "cardStyle": "brawnCardStyle",
            "reqs": [
                {"reqName": "Bifröst laboured",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Bifröst laboured",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampLabour03"
            ]
        },
        {
            "cardID": "BifröstCampLabour03",
            "cardText": "Haul crates of feathers",
            "locationName": "Bifröst Prison Camp",
            "locationDescription": "Labouring in the hot sun",
            "challengeStat": "Brawn",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Warehouse #2 mystery",
                "rewardQuantity": 1},
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeSuccessCards": [
                "BifröstCampLabour04",
                "BifröstCampLabour05"
            ],
            "challengeSuccessText": "Feathers are surprisingly heavy when they are packed into wooden crates. Even with a cart, it feels like a long distance between the creches and the prison’s one stone wall, but you manage to move an impressive number of crates. The cart gets wobblier on each run.<br><br> “Good work, noob. Pack ‘em into warehouse number 6 since warehouse 1, 3, 4, and 5 are all full,” Pana orders. You wonder to yourself, “what about number 2?” ",
            "challengeFailRewards": [
                {"rewardName": "Warehouse #2 mystery",
                "rewardQuantity": 1},
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampLabour04",
                "BifröstCampLabour05"
            ],
            "challengeFailText": "Feathers are surprisingly heavy when they are packed into wooden crates. Even with a cart, it feels like a long distance between the creches and the prison’s one stone wall, but you manage to move your assigned quota of crates. The cart gets wobblier on each run.<br><br> “Pack ‘em into warehouse number 4 since warehouse 1, 3, 4, and 5 are all full,” Pana orders. You wonder to yourself, “what about number 2?” "
        },
        {
            "cardID": "BifröstCampLabour04",
            "cardText": "Repair the cart",
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3}
            ],
            "challengeSuccessCards": [
                "BifröstCampLabour06"
            ],
            "challengeSuccessText": "The cart you use is starting to wobble, which is fine for hauling crates of feathers, but too dangerous for transporting fragile flamingo eggs. Thankfully, you are skillful enough to repair it. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampLabour06"
            ],
            "challengeFailText": "The cart you use is starting to wobble, which is fine for hauling crates of feathers, but too dangerous for transporting fragile flamingo eggs. You are unable to repair it yourself, but at least you are able to help another inmate fix it. "
        },
        {
            "cardID": "BifröstCampLabour05",
            "cardText": "Build a new cart",
            "challengeStat": "Hand",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3}
            ],
            "challengeSuccessCards": [
                "BifröstCampLabour06"
            ],
            "challengeSuccessText": "The cart you use is starting to wobble, which is fine for hauling crates of feathers, but too dangerous for transporting fragile flamingo eggs. You skillfully craft a better quality cart, specifically for the eggs. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampLabour06"
            ],
            "challengeFailText": "The cart you use is starting to wobble, which is fine for hauling crates of feathers, but too dangerous for transporting fragile flamingo eggs. You attempt to build a better cart for the eggs, but your end result is no better than the existing carts. Oh well, two crappy carts are better than one, I suppose... "
        },
        {
            "cardID": "BifröstCampLabour06",
            "cardText": "Chop firewood",
            "challengeStat": "Brawn",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4}
            ],
            "challengeSuccessCards": [
                "BifröstCampLabour07"
            ],
            "challengeSuccessText": "After an hour of backbreaking labour, you have supplied the prison camp with a fairly significant pile of wood. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeFailCards": [
                "BifröstCampLabour07"
            ],
            "challengeFailText": "After an hour of backbreaking labour, you have supplied the prison camp with a moderate pile of wood. "
        },
        {
            "cardID": "BifröstCampLabour07",
            "cardText": "Lunch!",
            "addedText": "The lunch horn blows, but while everyone stops for a quick break, an inmate named Gregor breaks down in tears.<br><br> “Noon. It’s noon,” he sobs. “Madeleine and I got married at noon.” With a little encouragement, Despondent Inmate Gregor opens up and tells you that today is his one-year wedding anniversary.<br><br> “Poor bastard’s only ten months into a ten year Transportation sentence,” Impulsive Convict Pana tells you quietly.",
            "nextCardsID": [
                "BifröstCampLabour08",
                "BifröstCampLabour09"
            ]
        },
        {
            "cardID": "BifröstCampLabour08",
            "cardText": "Convince him to let go",
            "challengeStat": "Voice",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3},
                {"rewardName": "silver wedding band",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampLabour10"
            ],
            "challengeSuccessText": "You argue to Despondent Inmate Gregor that he has to live with the reality of his current situation. From what you’ve seen so far, prisoners here on this tropical island have it better than in any other prison in the world - in many respects, he lives better than many free men. Even though he may never see Madeleine again, she would certainly be happier imagining him living his life to the fullest, as opposed to wasting it away. “Maybe you’re right,” Gregor says, taking your hand and holding it in his own. “I hurts us both to hang on to the past.” When he releases your hand there is a silver ring in your palm. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampLabour10"
            ],
            "challengeFailText": "You argue to Despondent Inmate Gregor that he has to live with the reality of his current situation. If she is as young beautiful as he says she is, she will probably have many other suitors, and it isn’t fair for him to expect her to wait for him. Since he may never see Madeleine again, they will both be happier if he lets her go.<br><br>Gregor does not respond. He doesn’t seem so emotional anymore, but he is ertainly not over his grief."
        },
        {
            "cardID": "BifröstCampLabour09",
            "cardText": "Reassure him that they will reunite",
            "challengeStat": "Heart",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3},
                {"rewardName": "silver wedding band",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampLabour10"
            ],
            "challengeSuccessText": "You argue to Despondent Inmate Gregor that if he and Madeleine are truly committed to each other as much as he says, then nothing can stand in the way of their love. “Thank you,” Gregor responds, taking your hand and holding it in his own. “I can keep my memory of her alive in my mind until it’s time for us to reunite. We convicts aren’t allowed to own property, and I can’t risk doing anything that will keep me here any longer than I need to.  When he releases your hand there is a silver ring in your palm. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampLabour10"
            ],
            "challengeFailText": "You argue to Despondent Inmate Gregor that if he and Madeleine are truly committed to each other as much as he says, then nothing can stand in the way of their love. Not even if she is a decade older, and has lost her looks. Not even if the experience of prison changes his personality, or hers. Not even if other suitors approach her, as they surely will. Perhaps you should stop talking now. "
        },
        {
            "cardID": "BifröstCampLabour10",
            "cardText": "Haul more firewood",
            "challengeStat": "Brawn",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4}
            ],
            "challengeSuccessCards": [
                "BifröstCampLabour11"
            ],
            "challengeSuccessText": "After a day of labouring and counselling, the low sun tells you that the time has come to carry this firewood back. This should keep the fires in the burn pit and the mess stoked for a long while. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeFailCards": [
                "BifröstCampLabour11"
            ],
            "challengeFailText": "After a day of labouring and counselling, the low sun tells you that the time has come to carry this firewood back. This should keep the fires in the burn pit and the mess stoked for a little while. "
        },
        {
            "cardID": "BifröstCampLabour11",
            "cardText": "Head back to camp",
            "addedText": "“Well, you turned out to be slightly less useless than the boys predicted you’d be,” Impulsive Convict Pana says, in what you can assume is high praise coming from him. “Quo likes to cycle around work details, but I’ll have to request you give me a hand next week with the lumber.” You begin to explain to Pana that although you would gladly help him again, you’ll be leaving soon on the next Navy ship <br><br> “Quo told you you’re leaving on the Humboldt? Good luck. The last 2 shipment dates came and went. Our warehouses are full up with goods, and no one’s comin to get them, so you might be here a bit longer than you expect, pal.”",
            "rewards": [
                {"rewardName": "Humboldt mystery",
                "rewardQuantity": 1},
                {"rewardName": "Pana’s esteem",
                "rewardQuantity": 1},
                {"rewardName": "time of day",
                "rewardQuantity": 3,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "BifröstCamp01BurnHill"
            ]
        },
        {
            "cardID": "BifröstCampFishing01",
            "cardText": "Go fishing",
            "addedText": "“You’ve probably noticed by now that here on Bifröst, we don’t keep no livestock,” says a weathered old convict named Rainer. He wears a permanent frown. “So if you want meat for dinner tonight the only way to get that is from the sea. And we humans gotta share the catch with the flamingo chicks, so we got some work to do today.”<br><br>Grumpy convict Rainer escorts you and a dozen other inmates to the pier. Four of them haul a small skiff down the shore to go fishing on the reef. Rainer hands you a fishing pole and begins by teaching you their technique for fishing off the pier.",
            "cardStyle": "handCardStyle",
            "reqs": [
                {"reqName": "Bifröst fished",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Bifröst fished",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampFishing02"
            ]
        },
        {
            "cardID": "BifröstCampFishing02",
            "cardText": "Fish from pier",
            "challengeStat": "Hand",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeSuccessCards": [
                "BifröstCampFishing03"
            ],
            "challengeSuccessText": "It takes you 30 minutes to make your first catch, and then you start to get the hang of it. After two hours, your catch bucket is emptier than all the others, but not by much. Already you have caught more fish than you yourself will eat in the day, so the other inmates find your results acceptable. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampFishing03"
            ],
            "challengeFailText": "It takes you 30 minutes to make your first catch, and then you start to get the hang of it. But after two hours, your catch bucket is much emptier than everyone else’s. At this rate, you would barely be able to feed yourself, much less contribute to the rest of the group. "
        },
        {
            "cardID": "BifröstCampFishing03",
            "cardText": "Count your catch",
            "addedText": "Count your catch. As the prisoners are all gathering up their catches and equipment, a scuffle breaks out between two young female prisoners, Rebecca and Celeste. One is accusing the other of stealing her fish. You weren’t watching them closely, but they were in your field of view and you did not notice any theft.",
            "nextCardsID": [
                "BifröstCampFishing04",
                "BifröstCampFishing05"
            ]
        },
        {
            "cardID": "BifröstCampFishing04",
            "cardText": "Calm down the situation with an emotional argument",
            "challengeStat": "Heart",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeSuccessCards": [
                "BifröstCampFishing06"
            ],
            "challengeSuccessText": "You argue that all of the fish caught is going to support the good of everyone here. It doesn’t matter who gets credit for catching the fish - all of the fish we caught contribute to the health and happiness of all the prisoners sharing this space together. Rebecca and Celeste glare at each other, but stop arguing.<br><br> “Good job,” Grumpy convict Rainer says privately to you. “It’s tough to get those two ladies to stop squabbling. Do you how it works when Transportation convicts are released? We don’t automatically get to go back home to the Empire, or Valhalla - not unless we can somehow afford it. Most of us just stay here in the New World. Rebecca and Celeste are both in love with the same man, who was released about six months ago, but they each still have a month left on their sentences, and then they’ll be hunting that poor fellow down like jaguars on a bunny rabbit.” ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampFishing06"
            ],
            "challengeFailText": "You argue that all of the fish caught is going to support the good of everyone here. It doesn’t matter who gets credit for catching the fish - all of the fish we caught contribute to the health and happiness of all the prisoners sharing this space together. Rebecca and Celeste ignore you and the volume of their bickering intensifies until Grumpy Convict Rainer intercedes.<br><br> “Nice try,” he says privately to you afterward. “But it’s impossible to get those two ladies to stop squabbling. Do you how it works when Transportation convicts are released? We don’t automatically get to go back home to the Empire, or Valhalla - not unless we can somehow afford it. Most of us just stay here in the New World. Rebecca and Celeste are both in love with the same man, who was released about six months ago, but they each still have a month left on their sentences, and then they’ll be hunting that poor fellow down like jaguars on a bunny rabbit.” "
        },
        {
            "cardID": "BifröstCampFishing05",
            "cardText": "De-escalate the situation with a logical argument",
            "challengeStat": "Voice",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeSuccessCards": [
                "BifröstCampFishing06"
            ],
            "challengeSuccessText": "You argue that you had a clear view of both of their buckets, and you saw no one stealing fish. The two women glare at each other, but stop arguing.<br><br> “Good job,” Grumpy convict Rainer says privately to you. “It’s tough to get those two ladies to stop squabbling. Do you how it works when Transportation convicts are released? We don’t automatically get to go back home to the Empire, or Valhalla - not unless we can somehow afford it. Most of us just stay here in the New World. Rebecca and Celeste are both in love with the same man, who was released about six months ago, but they each still have a month left on their sentences, and then they’ll be hunting that poor fellow down like jaguars on a bunny rabbit.” ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampFishing06"
            ],
            "challengeFailText": "You argue that you had a clear view of both of their buckets, and you saw no one stealing fish. The two women ignore you and the volume of their bickering intensifies until Grumpy Convict Rainer intercedes.<br><br> “Nice try,” he says privately to you afterward. “But it’s impossible to get those two ladies to stop squabbling. Do you how it works when Transportation convicts are released? We don’t automatically get to go back home to the Empire, or Valhalla - not unless we can somehow afford it. Most of us just stay here in the New World. Rebecca and Celeste are both in love with the same man, who was released about six months ago, but they each still have a month left on their sentences, and then they’ll be hunting that poor fellow down like jaguars on a bunny rabbit.” "
        },
        {
            "cardID": "BifröstCampFishing06",
            "cardText": "Lagoon fishing",
            "challengeStat": "Hand",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4}
            ],
            "challengeSuccessCards": [
                "BifröstCampFishing07"
            ],
            "challengeSuccessText": "The four inmates in the skiff return with a good catch. After the small boat is emptied, you and three other inmates take a shot at it. The waters are shallow and calm on the on the back reef, but still you need to manoeuvre carefully to avoid hitting any shallow coral heads. The fish are small, but plentiful, and after an hour your boat has at least as many fish as the previous group caught. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeFailCards": [
                "BifröstCampFishing07"
            ],
            "challengeFailText": "The four inmates in the skiff return with a good catch. After the small boat is emptied, you and three other inmates take a shot at it. The waters are shallow and calm on the on the back reef, but still you need to manoeuvre carefully to avoid hitting any shallow coral heads. The fish are plentiful, but small and difficult to catch. After an hour your boat has less than half as many fish as the previous group caught. "
        },
        {
            "cardID": "BifröstCampFishing07",
            "cardText": "Fore reef fishing",
            "challengeStat": "Hand",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3}
            ],
            "challengeSuccessCards": [
                "BifröstCampFishing08"
            ],
            "challengeSuccessText": "This side of the reef is exposed to the open ocean, so the water is choppier. The fish are bigger though, and with some hard work, your team manages to bring in a few large snappers.<br><br> “Excellent, it seems like you aren’t completely useless after all. Tonight, everyone in the camp will get to eat meat!” Grumpy Convict Rainer says. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampFishing08"
            ],
            "challengeFailText": "This side of the reef is exposed to the open ocean, so the water is choppier. The fish are bigger, but faster and smarter at avoiding capture. With some hard work, your team manages to bring in a one young snapper.<br><br> “Between this morning’s catch, and this, it looks like we’re gonna be vegetarians tonight.” Grumpy Convict Rainer says. "
        },
        {
            "cardID": "BifröstCampFishing08",
            "cardText": "“Why don’t more prisoners fish?”",
            "addedText": "“If it was up to Warder Quo, then I’m sure he’d send more of us fishing each day, but it ain’t up to him. The guards won’t allow us to fall behind in our quotas for the feather harvest, so Quo only lets a handful of us go out fishing as long as our feather numbers have been good. Of course, in the old days, we’d get re-supplied with food and medical supplies, but who knows when the next ship will be coming.",
            "nextCardsID": [
                "BifröstCampFishing09a",
                "BifröstCampFishing09b",
                "BifröstCampFishing09c"
            ]
        },
        {
            "cardID": "BifröstCampFishing09a",
            "cardText": "“But Quo said the Humboldt will arrive in 2 days.”",
            "addedText": "“And he said that the Humboldt would take you back along with all those months worth of packed feathers fillin up our warehouses? Well, Quo says a lot of things, but between you and me, don’t expect to be packin’ your bags in two days.”",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "day until the Humboldt arrives",
                "reqRule": "=",
                "reqQuantity": 2,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Humboldt mystery",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampFishing10"
            ]
        },
        {
            "cardID": "BifröstCampFishing09b",
            "cardText": "“But Quo said the Humboldt will arrive tomorrow.”",
            "addedText": "“And he said that the Humboldt would take you back along with all those months worth of packed feathers fillin up our warehouses? Well, Quo says a lot of things, but between you and me, don’t expect to be packin’ your bags tomorrow.”",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "day until the Humboldt arrives",
                "reqRule": "=",
                "reqQuantity": 1,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Humboldt mystery",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampFishing10"
            ]
        },
        {
            "cardID": "BifröstCampFishing09c",
            "cardText": "“But Quo said the Humboldt will arrive today.”",
            "addedText": "“And he said that the Humboldt would take you back along with all those months worth of packed feathers fillin up our warehouses? Well, Quo says a lot of things, but between you and me, don’t expect to be packin’ your bags tonight.”",
            "hiddenIfReqsFail": true,
            "reqs": [
                {"reqName": "day until the Humboldt arrives",
                "reqRule": "<",
                "reqQuantity": 1,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Humboldt mystery",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampFishing10"
            ]
        },
        {
            "cardID": "BifröstCampFishing10",
            "cardText": "Bring your catch back to the pier",
            "addedText": "“Hey newbie, is that a chunk of your ship?” another inmate asks as you are all rowing back to shore. Manoeuvring the skiff between dangerous shoals, you see a large slab of wooden construction, larger than your skiff, that has been caught up on a rocky outcropping of the reef.<br><br> “That wasn’t there last week,” Rainer agrees. Could this be part of the Medusa’s hull? If so, it really got smashed to pieces. “Look,” rainer says, pointing to a piece of sailcloth still attached to a chunk of a mast. “Scorch marks. Did the ship get struck by lightning?” Grump Convict Rainer doesn’t seem happy that you have no idea why the ship sank. “Let’s search around for salvage.”",
            "rewards": [
                {"rewardName": "Medusa mystery",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampFishing11",
                "BifröstCampFishing12"
            ]
        },
        {
            "cardID": "BifröstCampFishing11",
            "cardText": "Try to move the large chunk of debris",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4},
                {"rewardName": "jade amulet",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampFishing13"
            ],
            "challengeSuccessText": "You and a convict jump out of the boat and try moving the large planks - a difficult task while you are treading water. You are able to free it from the rocks, and realize that you are also dragging several ropes and metal pulleys.<br><br> “Don’t let the metal eyelets slide off the rope!” Rainer yells at you. “With no re-supplies coming from the Empire, we need all the metal we can get, and those joints should be full of good nails. Tie it up, and we’ll drag the wood back behind our boat.” As you reach out to save the metal eyelets, you see a jade pendant on a thin strap caught on one of the nails. You quickly pocket it.<br><br> “Convicts like me ain’t allowed to own property anyway, so I’ll pretend I didn’t see that,” Rainer says as you climb out of the water. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeFailCards": [
                "BifröstCampFishing13"
            ],
            "challengeFailText": "You and a convict jump out of the boat and try moving the large planks - a difficult task while you are treading water, but you are able to free it from the rocks.<br><br> “With no re-supplies coming from the Empire, we need all the metal we can get,” Rainer says. “And those joints should be full of good nails. Tie it up, and we’ll drag the wood back behind our boat.” "
        },
        {
            "cardID": "BifröstCampFishing12",
            "cardText": "Dive down to search for small debris",
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 5},
                {"rewardName": "Valhallan pennigar",
                "rewardQuantity": 82}
            ],
            "challengeSuccessCards": [
                "BifröstCampFishing13"
            ],
            "challengeSuccessText": "While the other convicts investigate the large chunk of wood, you remove most of your clothes and jump down into the water. You spot a metal box, but it is heavy and you have to leave it. You go up for a larger breath of air and try again, this time re-emerging with a metal box that you pass up onto the skiff. Rainer opens it up and the three convicts all cheer out!<br><br> “You’ve got a good eye on ya, Newbie! Grab a hold of this and get on board!” he says, holding a metal hammer out to you. The inmates investigate the chisels, saws, sharpening tools, and some sort of clips that must have a nautical purpose. “With no Imperial re-supplies, we’ve been sorely lacking in good tools. These’ll be put to good use back at camp. And here, convicts ain’t allowed to own property, so you go ahead and take these for yourself,” Rainer says, scooping up a few brass coins from the bottom of the box and handing them to you. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeFailCards": [
                "BifröstCampFishing13"
            ],
            "challengeFailText": "While the other convicts investigate the large chunk of wood, you remove most of your clothes and jump down into the water. You spot a metal shape, and pull up some sort of metal tool.<br><br> “You’ve got a good eye on ya, Newbie,” Rainer says. “That there’s winch from a the running rigging of your old ship. Not much use for one on land, but we can try melting it down. With no Imperial re-supplies, we’ve been sorely lacking in metal.” "
        },
        {
            "cardID": "BifröstCampFishing13",
            "cardText": "The end of a long day",
            "addedText": "“Gather up the nets! Time to head in!” Grumpy Convict Rainer shouts. Your back is sore, your shoulders ache, and your hands are covered in the slime of various sea creatures. “Newbie, you’re certainly not born to fish, and I don’t know if what you caught today will actually offset our food you’ve been eatin, or the medical care we gave you. In fact, some are of the mind that that our dear Resolute Warder Quo should’ve just thrown you back in the sea and let the Cursed take care of you. However, I can appreciate when someone puts in some honest hard work, regardless of how little competence they possess.” You assume that this is Rainer’s version of a compliment.",
            "rewards": [
                {"rewardName": "Rainer’s esteem",
                "rewardQuantity": 1},
                {"rewardName": "time of day",
                "rewardQuantity": 3,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "BifröstCamp01Pier"
            ]
        },
        {
            "cardID": "BifröstCampCreches01",
            "cardText": "Care for chicks in the creches",
            "addedText": "“... snakes, geckos, tarantulas, dragons, oh, and not to mention other birds, like albatrosses, ospreys, gulls, and sea eagles. They’ll kill one in a heartbeat. Earthquakes knock down any poorly constructed creches, crushing them dead. Rainstorms will freeze them dead. Too much sun will bake their brains and kill them. Strong winds trigger the traps and knock debris onto the eggs. Even fungus. There’s a fungus here that will grow on the shells - it looks like nothing harmless - while it pierces the shell and eats the unborn chick inside.” Pessimistic Convict Astrid needs to use all the fingers on both hands, and then some, as she lists off all of the potential hazards to the flamingo chicks that you are going to help protect today.",
            "cardStyle": "heartCardStyle",
            "reqs": [
                {"reqName": "Bifröst creched",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Bifröst creched",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampCreches02"
            ]
        },
        {
            "cardID": "BifröstCampCreches02",
            "cardText": "“Wait, dragons?”",
            "addedText": "“Oh don’t worry, not those kind of dragons. Atlas dragons. Not the mythical things as big as a warehouse, breathing fire, of course. They’re basically just large iguanas, named by some explorer with an overactive imagination, I suppose. From an egg’s perspective, they’re dragon-sized though. And they love visiting our creches for a meal if they can.” Pessimistic Convict Astrid and you are part of a small group of inmates who are tasked with caring for the flamingo eggs and chicks today.<br><br>After a long uphill walk, you emerge from the trees and see the steep-sided walls of the mesa where the creches are located.",
            "nextCardsID": [
                "BifröstCampCreches03"
            ]
        },
        {
            "cardID": "BifröstCampCreches03",
            "cardText": "Climb up the mesa",
            "addedText": "You can hear them through the trees before you can see them: rows upon rows of nests and aviaries. Before you is the wealth of Bifröst Island - the reason why the Royal Empire built this prison work camp here. The entire plateau of the mesa is awash in a rainbow of colored feathers: neon yellow, hot pink, deep violet, blood red, fluorescent green. Some cages are home to juvenile birds, while others house dozens of eggs, still unhatched.",
            "nextCardsID": [
                "BifröstCampCreches04"
            ]
        },
        {
            "cardID": "BifröstCampCreches04",
            "cardText": "Feed chicks",
            "challengeStat": "Heart",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3}
            ],
            "challengeSuccessCards": [
                "BifröstCampCreches05"
            ],
            "challengeSuccessText": "“You can’t just throw a handful in each creche, creche, you have to feed them by hand, like a mother bird would. Being high up on a mesa allows us to keep away most predators, but if any scavenger birds come, smack ‘em with a stick.” Pessimistic Convict Astrid hands you a bag of small dead crustaceans, while she picks up a bag of seeds and nuts for herself. Flamingo chicks look like small ducklings, covered in fluffy white down - nothing at all like their adult counterparts. The birds take a liking to you and are soon, quite literally, eating out of the palm of your hand. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampCreches05"
            ],
            "challengeFailText": "“You can’t just throw a handful in each creche, creche, you have to feed them by hand, like a mother bird would. Being high up on a mesa allows us to keep away most predators, but if any scavenger birds come, smack ‘em with a stick. Pessimistic Convict Astrid hands you a bag of small dead crustaceans, while she picks up a bag of seeds and nuts for herself. Flamingo chicks look like small ducklings, covered in fluffy white down - nothing at all like their adult counterparts. It is slow going. Not surprisingly, the chicks are wary about taking food from a stranger. "
        },
        {
            "cardID": "BifröstCampCreches05",
            "cardText": "“Can’t I feed them seeds?”",
            "addedText": "“You stick to your smelly fish,” says Astrid. “They need variety in their diet or their colors end up dull. Only brightly colored feathers are worth anything at market.” Astrid looks around warily. “Plus, if the guards notice you doing anything that will lower the price of our feathers, you’ll get in deep trouble.” You look around, but for the life of you, you see no guards. In fact, in the couple of days you’ve been here, you can’t remember seeing a single guard in this prison colony, only senior convicts like Resolute Warder Quo.",
            "rewards": [
                {"rewardName": "Guards mystery",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampCreches06"
            ]
        },
        {
            "cardID": "BifröstCampCreches06",
            "cardText": "Continue feeding",
            "addedText": "After some time, you are distracted by an inmate waving his arms at you.<br><br> “Hey! You got a runaway!” he yells, running over to you. “He hopped over the edge down into those rocks!” You and Astrid run off in that direction.",
            "nextCardsID": [
                "BifröstCampCreches07",
                "BifröstCampCreches08"
            ]
        },
        {
            "cardID": "BifröstCampCreches07",
            "cardText": "Search from higher ground",
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4}
            ],
            "challengeSuccessCards": [
                "BifröstCampCreches09"
            ],
            "challengeSuccessText": "While Astrid starts making some ridiculous sounding bird call, you climb up to the top of one of the highest rocks in the area, scanning for any sign of a runaway chick. In a rock crevice you momentarily see a puff of white and you dash off in that direction. You hear an urgent chirping sound and you pick up the little baby escapee. You only take a few steps when you hear a soft scraping sound, and you turn to see a snake darting away into a rock crevice. “Good thing you found him when you did,” says Astrid, giving a kiss to the little bird. “But be more careful watching your creches in the future.” ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstCampCreches09"
            ],
            "challengeFailText": "While Astrid starts making some ridiculous sounding bird call, you climb up to the top of one of the highest rocks in the area, scanning for any sign of a runaway chick. In a rock crevice you momentarily see a puff of white and you dash off in that direction. You hear an urgent chirping sound but cannot seem to locate the source of it. You search in vain briefly, and can no longer hear the chirping sounds. “No luck?” says Astrid, abandoning her search too. “Be more careful watching your creches in the future.” On your walk back, your eyes catch those of a rattlesnake, before it darts away into a crevice in the rocks. It has a bulge in its belly and maybe it’s just your imagination, but it also appears to have a grin on its face. "
        },
        {
            "cardID": "BifröstCampCreches08",
            "cardText": "Call the missing chick",
            "challengeStat": "Voice",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4}
            ],
            "challengeSuccessCards": [
                "BifröstCampCreches09"
            ],
            "challengeSuccessText": "““Go like this,” Astrid orders. She makes a variety of noises that sound more like monkeys or pigs than birds. “It’s what the mothers sound like.” You do your best to impersonate her. Eventually you hear an urgent chirping sound respond to your noises and you follow it to find the little baby escapee. Only a few steps after you pick it up, you hear a soft scraping sound, and you turn to see a snake darting away into a rock crevice. “Good thing you found him when you did,” says Astrid, giving a kiss to the little bird. “But be more careful watching your creches in the future.” ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstCampCreches09"
            ],
            "challengeFailText": "““Go like this,” Astrid orders. She makes a variety of noises that sound more like monkeys or pigs than birds. “It’s what the mothers sound like.” You do your best to impersonate her. For a moment, you think you hear an urgent chirping sound respond to your noises, but cannot seem to locate the source of it. You search in vain briefly, and can no longer hear the chirping sounds. “No luck?” says Astrid, abandoning her search too. “Be more careful watching your creches in the future.” On your walk back, your eyes catch those of a rattlesnake, before it darts away into a crevice in the rocks. It has a bulge in its belly and maybe it’s just your imagination, but it also appears to have a grin on its face. "
        },
        {
            "cardID": "BifröstCampCreches09",
            "cardText": "Clean creches",
            "challengeStat": "Heart",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2},
                {"rewardName": "Warehouse #2 mystery",
                "rewardQuantity": 1},
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "challengeSuccessCards": [
                "BifröstCampCreches10"
            ],
            "challengeSuccessText": "“Everyone always likes the idea of caring for animals. No one ever thinks of cleaning up after them,” Pessimistic Convict Astrid says, handing you a shovel and bucket. “Tie a rag around your face. The guano of Bifröst flamingos is highly reactive. It’s great for fertilizer and, I hear, even for making cannon powder. Not so good for breathing in though. We’ve got a whole warehouse full of it down by the front of the camp.” After an hour of labour, you have several buckets full of the smelly, caustic material. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Warehouse #2 mystery",
                "rewardQuantity": 1},
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "challengeFailCards": [
                "BifröstCampCreches10"
            ],
            "challengeFailText": "“Everyone always likes the idea of caring for animals. No one ever thinks of cleaning up after them,” Pessimistic Convict Astrid says, handing you a shovel and bucket. “Tie a rag around your face. The guano of Bifröst flamingos is highly reactive. It’s great for fertilizer. Not so good for breathing in though. We’ve got a whole warehouse full of it down by the front of the camp.” After an hour of labour, you have a couple buckets full of the smelly, caustic material. "
        },
        {
            "cardID": "BifröstCampCreches10",
            "cardText": "Lunch time",
            "addedText": "Sweaty and sunburt, you and most of the other prisoners sit go down from the mesa top into the shade of the some trees to grab a quick lunch break. Most of them are already sitting in groups. Not knowing much of the social dynamics in this prison camp, you decide not to rock any boats, and sit down beside the one woman who is sitting alone. You notice she is scratching a rock with a peice of charcoal, writing out words and wiping then off, so you ask what she is writing. “Oh, it’s nothing, just some, well, I feel silly saying this, but you’re an outsider so maybe you can give me some advice,” she says, clearly quite flustered. “There’s another inmate here, Cameron. Have you met? No, probably not. Anyway, Cameron recently seeing another woman here, Celeste, but the rumor is they’re on the outs now, and, well, I’ve always fancied Cameron, so… I was writing, or trying to write a… um… a little bit of a love letter, a poem really. Oh dear, I’m really not much of a writer though. I don’t suppose you are?”",
            "nextCardsID": [
                "BifröstCampCreches11a",
                "BifröstCampCreches11b"
            ]
        },
        {
            "cardID": "BifröstCampCreches11a",
            "cardText": "Help with Rhea’s love-letter to Cameron",
            "challengeStat": "Heart",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 5}
            ],
            "challengeSuccessCards": [
                "BifröstCampCreches12"
            ],
            "challengeSuccessText": "You agree to help Forlorn Convict Rhea, and upon hearing what she has written so far, it is clear that she needs all the help she can get. You suggest a couple of flowery metaphors she can add to her poem. It’s still cheesy, but sweet. As Astrid announced the end of the lunch break, everyone gets up to head back to the creches, but you hang back to see Rhea approach a woman who is cleaning up the lunch area. You can’t hear the quiet conversation between Rhea and Cameron, but you can see Rhea’s nervousness as she reads the poem. Cameron brings her hand to her chest and blushes after hearing the poem. “Ladies, let’s get back to work!” Astrid commands. Rhea and Cameron start heading back to the mesa, a beaming smile on Rhea’s face. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeFailCards": [
                "BifröstCampCreches12"
            ],
            "challengeFailText": "You agree to help Forlorn Convict Rhea, and upon hearing what she has written so far, it is clear that she needs all the help she can get. You suggest a couple of flowery metaphors she can add to her poem. “Hmmm, I thank you for your suggestions, but I don’t know if that ending really fits Cameron’s, er, personality…” As Astrid announced the end of the lunch break, everyone gets up to head back to the creches, but you hang back to see Rhea approach a woman who is cleaning up the lunch area. You can’t hear the quiet conversation between Rhea and Cameron, but you can see Rhea’s nervousness as she reads the poem. Cameron brings her hand to her chest and blushes after hearing the poem. “Ladies, let’s get back to work!” Astrid commands. Rhea and Cameron start heading back to the mesa, a beaming smile on Rhea’s face. "
        },
        {
            "cardID": "BifröstCampCreches11b",
            "cardText": "Stay out of it",
            "addedText": "You know your strengths and weaknesses, and writing poetry definitely falls into the latter category. Forlorn Convict Rhea seems a little disappointed, but she understands. A thought occurs to you though: usually in this game we call life, the riskier an option is, the more rewards are, even if you fail. Choosing an option with no risk at all will often lead to disappointing results.",
            "rewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "BifröstCampCreches12"
            ]
        },
        {
            "cardID": "BifröstCampCreches12",
            "cardText": "Repair creches",
            "addedText": "Astrid assigns you and a couple of young men to search through the trees at the foot of the mesa for reeds to use in repairing traps that have been damaged by weather. Your focus on the foliage is broken though, when you hear a cry of “Dragon! Dragon! Help!” coming from the lip of the mesa. You rush over to see a convict on the ground, his leg bleeding. Directly in front of him is a lizard, larger than an iguana, closer in length to a small crocodile, but with a narrower jaw. You can see it has plenty of large teeth, as it opens its mouth and tries to intimidate you, letting out a violent hissing noise. It works.<br><br> “There are those Atlas dragons I told you about,” Pessimistic Convict Astrid says, responding to the calls of the injured man. “I thought you said it wasn’t real dragon!” you say, pointing at the 10-foot-long monster. “Well, it doesn’t breathe fire.” Astrid bends down and picks up a branch, never taking her eyes from the beast. “You take it from the left, I’ll take the right.”",
            "nextCardsID": [
                "BifröstCampCreches13",
                "BifröstCampCreches14"
            ]
        },
        {
            "cardID": "BifröstCampCreches13",
            "cardText": "Hit the dragon with a big stick",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4},
                {"rewardName": "dragon claw",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampCreches15"
            ],
            "challengeSuccessText": "You crouch down and scurry off to the left, rounding a large boulder. You find an old tree branch about the length and size of your arm, although you’d prefer to be more than arm’s length from this creature. The predator’s menacing head darts back and forth between you and Astrid, occasionally lingering on the injured convict who is trying to drag himself away. Astrid leaps up and roars at the Atlas dragon, who hisses back. You take advantage of the distraction and charge forward, bringing the branch down hard on the beast’s hind foot. The dragon’s hiss becomes higher pitched as it rotates, hisses at you and flees over the edge of the mesa wall. “Nice work,” Astrid congratulates you, kneeling down to check out the ground. “A souvenir,” she says, handing you an ominous two-inch-long claw. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3},
                {"rewardName": "Health",
                "rewardQuantity": -10}
            ],
            "challengeFailCards": [
                "BifröstCampCreches15"
            ],
            "challengeFailText": "You crouch down and scurry off to the left, rounding a large boulder. You find an old tree branch about the length and size of your arm, although you’d prefer to be more than arm’s length from this creature. The predator’s menacing head darts back and forth between you and Astrid, occasionally lingering on the injured convict who is trying to drag himself away. Astrid leaps up and roars at the Atlas dragon, who hisses back. You take advantage of the distraction and charge forward, bringing the branch down hard on the beast’s tail. The dragon rotates to face you, catching your leg as its tail whips around. Its serrated teeth are even more ominous at this short distance. It is about to charge you when Astrid lunges forward, bringing her branch down hard on the beast’s back. The dragon’s hiss becomes higher pitched as it turns and flees over the edge of the mesa wall.  “Nice work,” Astrid congratulates you, “Now let’s get back to fixing those traps.” "
        },
        {
            "cardID": "BifröstCampCreches14",
            "cardText": "Throw a big rock at the dragon",
            "challengeStat": "Hand",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4},
                {"rewardName": "dragon claw",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampCreches15"
            ],
            "challengeSuccessText": "You crouch down and scurry off to the left, rounding a large boulder. The mesa is littered with stones of all sizes, so you pick up the heaviest one that you feel you can throw. The predator’s menacing head darts back and forth between you and Astrid, occasionally lingering on the injured convict who is trying to drag himself away. Astrid leaps up and roars at the Atlas dragon, who hisses back. You take advantage of the distraction and hurl the rock, which slams into the beast’s hind foot. The dragon’s hiss becomes higher pitched as it rotates, hisses at you and flees over the edge of the mesa wall. “Nice work,” Astrid congratulates you, kneeling down to check out the ground. “A souvenir,” she says, handing you an ominous two-inch-long claw. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeFailCards": [
                "BifröstCampCreches15"
            ],
            "challengeFailText": "You crouch down and scurry off to the left, rounding a large boulder. The mesa is littered with stones of all sizes, so you pick up the heaviest one that you feel you can throw. The predator’s menacing head darts back and forth between you and Astrid, occasionally lingering on the injured convict who is trying to drag himself away. Astrid leaps up and roars at the Atlas dragon, who hisses back. You take advantage of the distraction and hurl the boulder, which slams onto the beast’s tail. The dragon rotates to face you. Its serrated teeth are even more ominous at this distance. It is about to charge you when Astrid lunges forward, bringing her branch down hard on the beast’s back. The dragon’s hiss becomes higher pitched as it turns and flees over the edge of the mesa wall.  “Nice work,” Astrid congratulates you, “Now let’s get back to fixing those traps.” "
        },
        {
            "cardID": "BifröstCampCreches15",
            "cardText": "A hard day’s work done",
            "addedText": "As the sun begins to hang low in the sky, a night watch crew comes in to watch over the creches. You and the other convicts put away your tools and march back to the Burn Hill for a well-deserved dinner. Pessimistic Convict Astrid comes over and slaps you on the back. “I saw you do some good work out there today, newbie, and the guards said you seemed to be pulling your weight too. Thanks for the help today.” That’s strange; all day you don’t remember seeing a single guard.",
            "rewards": [
                {"rewardName": "Astrid’s esteem",
                "rewardQuantity": 1},
                {"rewardName": "time of day",
                "rewardQuantity": 3,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "BifröstCamp01BurnHill"
            ]
        },

        {
            "cardID": "BifröstCampSalvage01",
            "cardText": "Salvage wreckage of the Medusa",
            "addedText": "“We start our survey here. It’s low tide, so check all the tidal pools,” Headmost Bailiff Claudia declares. You’ve been trekking through the jungle for twenty minutes to a new section of coastline that hasn’t been searched yet for wreckage of the Medusa. This area doesn’t have the same huge black rocks as the part where you washed ashore. This area seems more eroded by the sea.",
            "cardStyle": "eyeCardStyle",
            "reqs": [
                {"reqName": "Bifröst salvaged",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Bifröst salvaged",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampSalvage02"
            ]
        },
        {
            "cardID": "BifröstCampSalvage02",
            "cardText": "Investigate the tidal pools",
            "challengeStat": "Eye",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeSuccessCards": [
                "BifröstCampSalvage03"
            ],
            "challengeSuccessText": "What at first appears to a large jellyfish sticking out of a tidal pool instead turns out to be a large part of a sail.<br><br> “That’s some good strong fabric,” Claudia says, “probably part of the mizzen sail. A piece this big could make a good rain-shelter for the mess. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampSalvage03"
            ],
            "challengeFailText": "What at first appears to a large jellyfish sticking out of a tidal pool instead turns out to be part of a sail.<br><br> “That’s some good strong fabric,” Claudia says, “probably part of the mizzen topsail. We could cut this up to make splints and bandages. "
        },
        {
            "cardID": "BifröstCampSalvage03",
            "cardText": "Keep searching",
            "addedText": "An inmate named Taymond calls out that he has found some kitchen supplies. While others come to sort through usable cutlery and cracked plates, Taymond moves off on his own. You notice a large, heavy bulge in his trousers - either he’s got a stolen silver candlestick down his pants, or he is very happy to see you.",
            "nextCardsID": [
                "BifröstCampSalvage04",
                "BifröstCampSalvage05",
                "BifröstCampSalvage06"
            ]
        },
        {
            "cardID": "BifröstCampSalvage04",
            "cardText": "Convince him to return stolen candlestick",
            "challengeStat": "Voice",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4}
            ],
            "challengeSuccessCards": [
                "BifröstCampSalvage07"
            ],
            "challengeSuccessText": "“You strike up a conversation with Taymond, learning that he still has four more years to serve on his sentence.<br><br> “And you really think you’ll be able to keep a stolen silver candlestick hidden for four years in a place like this?” you ask him. His face blushes, and he thinks about it for a moment. Taymond then bends down on one knee.<br><br> “Look! Look what I found over here, Bailiff Claudia!” he says, holding out the candlestick. “I was going to report it anyway… I was… Please, don’t say anything about it. I owe you.” ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": -2},
                {"rewardName": "Health",
                "rewardQuantity": -20}
            ],
            "challengeFailCards": [
                "BifröstCampSalvage07"
            ],
            "challengeFailText": "You talk to Taymond, a short way away from the group, threatening that he must return the silver candlestick, or you will inform Warder Quo. Before you even have a chance to react, you feel a sharp elbow in your gut. Taymond again hits you with the candlestick right on your neck, as you crumple down to the ground.<br><br> “Claudia! Bailiff Claudia!” he yells out. “The newbie here found a silver candlestick and was gonna steal it!” Arguments ensue as you defend yourself, that you would never do such a thing, and Taymond argues that he would never do such a thing either, since prisoners aren’t allowed personal possessions. It seems that Claudia doesn’t believe Taymond, but she does not entirely believe you either. "
        },
        {
            "cardID": "BifröstCampSalvage05",
            "cardText": "Steal candlestick back from convict",
            "challengeStat": "Hand",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3}
            ],
            "challengeSuccessCards": [
                "BifröstCampSalvage07"
            ],
            "challengeSuccessText": "You stay close to Taymond. A few minutes later, he is trying to lift a large piece of wood, tangled in seaweed. You ask if he needs help. While he is bending over, the silver candlestick he has stolen is actually protruding from his prison uniform pocket. You deftly slip it out while he is occupied with the effort of lifting the wood.<br><br> “Taymond, look what was on the ground right under this plank you lifted up! A silver candlestick!” Taymond drops the wood and subtly feels his pocket. “Bailiff Claudia, look what Taymond found!” Everyone is uplifted by Taymond’s find, and he plays it up as well, not sure how the candlestick fell out of his pocket, but happy that his theft ended up in him being praised, not caught. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": -1},
                {"rewardName": "Health",
                "rewardQuantity": -10}
            ],
            "challengeFailCards": [
                "BifröstCampSalvage07"
            ],
            "challengeFailText": "You stay close to Taymond. A few minutes later, he is trying to lift a large piece of wood, tangled in seaweed. You ask if he needs help. While he is bending over, the silver candlestick he has stolen is actually protruding from his prison uniform pocket. You try to deftly slip it out while he is occupied with the effort of lifting the wood, but his hand is immediately on your wrist, gripping it hard, to the point where it feels near to breaking.<br><br> “You say a word about this to anyone, and I’ll make sure that you don’t wake up tomorrow morning. Bailiff Claudia loves me, and she’ll certainly believe me over a stranger like you.” "
        },
        {
            "cardID": "BifröstCampSalvage06",
            "cardText": "Don’t get involved",
            "addedText": "If he wants to risk increasing his sentence, that’s fine with you. A thought occurs to you though: usually in this game we call life, the riskier an option is, the more rewards are, even if you fail. Choosing an option with no risk at all will often lead to disappointing results.",
            "nextCardsID": [
                "BifröstCampSalvage07"
            ]
        },
        {
            "cardID": "BifröstCampSalvage07",
            "cardText": "Search in tidal pools",
            "challengeStat": "Eye",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4},
                {"rewardName": "Royal shilling",
                "rewardQuantity": 55}
            ],
            "challengeSuccessCards": [
                "BifröstCampSalvage08"
            ],
            "challengeSuccessText": "“You spot something glittering form the bottom of a tidal pool, and when you investigate, you see a couple of shiny coins beside a small coin pouch. You try to lift the coin pouch and realize it is attached to something. Pulling away the green strands of kelp, you realize that the coin pouch is actually a tip jar, and is tied to a keg that feels full. An older convict turns the spigot and tastes the contents. “Rum! It’s rum!” all the inmates cheer, much more excited about the rum than the coins. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeFailCards": [
                "BifröstCampSalvage08"
            ],
            "challengeFailText": "You spot something that looks like a mass of kelp, but when you pull away the green strands, you see an intact barrel. An older convict takes a deep whiff of the cask. “Pickles! It’s pickles!” everyone cheers. Pickles must be a rare commodity out here. "
        },
        {
            "cardID": "BifröstCampSalvage08",
            "cardText": "A gruesome discovery",
            "addedText": "All the convicts rush over to Gregor, a young convict who has been here less than a year. He is throwing up behind a log.<br><br> “Hey Newbie. We found one of your buddies. Recognize him?” You look at the centre of the circle of inmates and see a man who was much less fortunate than yourself. His skin is pale white and bloated, and most of one arm is missing. You confirm that his uniform matches that of the Medusa’s crew, but you do not recognize the corpse. Gregor, who found the body is obviously young and not yet used to the harshness of life in a prison work camp. He is not handling it well.",
            "nextCardsID": [
                "BifröstCampSalvage09",
                "BifröstCampSalvage10"
            ]
        },
        {
            "cardID": "BifröstCampSalvage09",
            "cardText": "Blow it off as if it’s nothing",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeSuccessCards": [
                "BifröstCampSalvage11"
            ],
            "challengeSuccessText": "You start describing to Gregor what it was actually like on the sinking ship. Passengers screaming out. Families separated, sailors falling from the rigging. This is nothing. You explain that he’s young, and life is sometimes cruel. He has to stop being childish and just learn to deal with it.<br><br>Gregor doesn’t say anything, but wipes the tears from his eyes, stands up and walks away, getting back to work.<br><br> “Thanks for speaking to him,” Headmost Bailiff Claudia says, putting a hand on your shoulder. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstCampSalvage11"
            ],
            "challengeFailText": "You start describing to Gregor what it was actually like on the sinking ship. Passengers screaming out. Families separated, sailors falling from the rigging. This is nothing. You explain that he’s young, and life is sometimes cruel. He has to stop being childish and just learn to deal with it.<br><br>Gregor bursts into tears and runs off along the beach. Another convict runs after Gregor to try consoling him.<br><br> “He’s just a kid,” Headmost Bailiff Claudia says, arms crossed. “Please don’t give anyone else morale-boosting talks today. We have work to do.” "
        },
        {
            "cardID": "BifröstCampSalvage10",
            "cardText": "Ask Gregor about his feelings",
            "challengeStat": "Heart",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3}
            ],
            "challengeSuccessCards": [
                "BifröstCampSalvage11"
            ],
            "challengeSuccessText": "You sit down by Gregor and put an arm around his shoulders. He says he doesn’t want to talk about the corpse. You ask about his feelings instead. Between sobs, and silence, he gradually opens up to you. You learn about how he isn’t even guilty of the crime he was convicted of, and how he misses his family back home, and is fearful that they won’t be able to pay the expensive return fare when his sentence is up, so he’ll be stuck in New Atlantis forever. There isn’t even much you have to say; Gregor just needed someone to listen.<br><br> “Thanks for listening.” Gregor wipes the tears from his eyes, stands up and walks away, getting back to work.<br><br> “Thanks for speaking to him,” Headmost Bailiff Claudia says, putting a hand on your shoulder. “I can never handle the mushy stuff.” ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "BifröstCampSalvage11"
            ],
            "challengeFailText": "You sit down by Gregor and put an arm around his shoulders. He says he doesn’t want to talk about the corpse. You ask about his feelings instead. Gregor bursts into tears and runs off along the beach. Another convict runs after Gregor to try consoling him.<br><br> “He’s just a kid,” Headmost Bailiff Claudia says, arms crossed. “Please don’t try consoling anyone else like this today. We have work to do.” "
        },
        {
            "cardID": "BifröstCampSalvage11",
            "cardText": "Get back to work",
            "addedText": "“Newbie, come look at this!” Headmost Bailiff Claudia waves you over, holding up one end of a wooden beam. She is using it to pry up a large iron safe. The safe is bent, and its door is missing. There are black marks along the side and bottom of it. “Scorch marks. Did the Medusa sink due to a fire on board?”",
            "nextCardsID": [
                "BifröstCampSalvage12"
            ]
        },
        {
            "cardID": "BifröstCampSalvage12",
            "cardText": "Investigate burn marks",
            "challengeStat": "Eye",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2},
                {"rewardName": "Claudia’s esteem",
                "rewardQuantity": 1},
                {"rewardName": "Medusa mystery",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampSalvage13"
            ],
            "challengeSuccessText": "You explain that you and all the other passengers were asleep, so you don’t know what caused the shipwreck. All you know is that a storm was going on. The prisoners’ interest is piqued.<br><br> “Could’ve been a robbery,” one inmate suggests. <br><br> “Lightning?” <br><br> “Were you under attack? The could be from cannonfire,”<br><br> “There may have been other survivors,” Headmost Bailiff Claudia says. “The sun is low, so we’re through searching the wreckage today, but keep an eye out for tracks. Perhaps we’ll have some more guests from the Medusa. Hopefully they’ll be as hardworking as you are.” ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2},
                {"rewardName": "Claudia’s esteem",
                "rewardQuantity": 1},
                {"rewardName": "Medusa mystery",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampSalvage13"
            ],
            "challengeFailText": "You explain that you and all the other passengers were asleep, so you don’t know what caused the shipwreck. All you know is that a storm was going on. The prisoners seem dissatisfied that you cannot give them any more information. <br><br> “Could’ve been a robbery,” one inmate suggests. <br><br> “Lightning?” <br><br> “Were you under attack? The could be from cannonfire,”<br><br> “There may have been other survivors,” Headmost Bailiff Claudia says. “The sun is low, so we’re through searching the wreckage today, but keep an eye out for tracks. Perhaps we’ll have some more guests from the Medusa. Hopefully they’ll be as hardworking as you are.” "
        },
        {
            "cardID": "BifröstCampSalvage13",
            "cardText": "Claudia pulls you aside",
            "addedText": "On the march back to the prison camp, Headmost Bailiff Claudia pulls you aside <br><br> “There are some odd facts about this shipwreck,” she starts. “The same storm that hit the Medusa that night also swept through Bifröst. A ship that large should be able to weather such a minor storm. One survivor, one corpse, that mysterious book. Yes, I know about your book. Resolute Warder Quo and I share much - information, secrets, beds.” Claudia looks you up and down, as if trying to decide whether or not she can trust you. “There are strange things going on in the New Worlde these days. And the Empire tells us nothing. If you remember anything else of import about the Medusa, Quo and I would be very interested to know more.”",
            "rewards": [
                {"rewardName": "Quo’s Mistress mystery",
                "rewardQuantity": 1},
                {"rewardName": "time of day",
                "rewardQuantity": 3,
                "reqHidden": true}
            ],
            "nextCardsID": [
                "BifröstCamp01BurnHill"
            ]
        },
        {
            "cardID": "BifröstCampFlamingos01",
            "cardText": "Gather flamingo feathers",
            "addedText": "“Be very quiet, and follow my lead,” Imitator Convict Siobhan says to you as both are huddled behind the fronds of large plant. A couple of adult flamingos descend gracefully into the clearing. “Mating pair. The bright purple one is the male, and the blue one is the female.” <br><br> The brightly coloured Bifröst flamingos make high-pitched chirping noises that sound like they should be emanating from a smaller bird as they approach a pile of fish carcasses that Siobhan had laid out on the ground.<br><br>Once they are contently eating the food, Siobhan slowly stands up and makes a high gurgling noise that imitates the chirping of the birds. She slowly starts walking toward them, gurgling all the while. When she reaches the male, she starts grooming it with a special comb which plucks out all of the loose feathers. Surprisingly, the bird doesn’t seem to mind. She gestures to you to join her.",
            "cardStyle": "voiceCardStyle",
            "reqs": [
                {"reqName": "Bifröst flamingoed",
                "reqRule": "=",
                "reqQuantity": 0,
                "reqHidden": true}
            ],
            "rewards": [
                {"rewardName": "Bifröst flamingoed",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampFlamingos02"
            ]
        },
        {
            "cardID": "BifröstCampFlamingos02",
            "cardText": "Try doing a flamingo call",
            "challengeStat": "Voice",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3}
            ],
            "challengeSuccessCards": [
                "BifröstCampFlamingos03"
            ],
            "challengeSuccessText": "You do your best to copy what Siobhan did. This is your first time impersonating a prison convict impersonating a bird, so you aren’t quite sure what you are doing. The female flamingo eyes you warily as you approach her. Even she can tell you haven’t done this before.<br><br> “They groom each other while feeding, so they are very trusting as long as you don’t make fast movements,” Siobhan whispers to you between gurgles. Sure enough, the bird trusts you and you are able to use the feather comb on her with moderate success. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampFlamingos03"
            ],
            "challengeFailText": "You do your best to copy what Siobhan did. This is your first time impersonating a prison convict impersonating a bird, so you aren’t quite sure what you are doing. The female flamingo eyes you warily as you approach her. Even she can tell you haven’t done this before.<br><br> “They groom each other while feeding, so can be fairly trusting, but you have to stop making any kind of fast movements,” Siobhan whispers to you between gurgles. The bird lets you approach, but when you run the comb along its back, it backs away and you only get a few feathers. "
        },
        {
            "cardID": "BifröstCampFlamingos03",
            "cardText": "Search for tracks",
            "addedText": "“You’re lucky to have been assigned to me today,” Imitator Convict Siobhan says to you while walking through a jungle path with a few other prisoners. “Bifröst flamingo feathers are prized for their radiant colors, used in fashionable clothing all over the New World and the Olden. It’s probably the most important work detail on the island” <br><br> “And the easiest work detail,” a one-armed prisoner chimes in. <br><br> “Oh, I don’t know, I think Bailiff Claudia’s got the easiest work detail,” adds a woman with a snide look on her face. <br><br> “What, sleeping with the Warder? I’d rather pluck feathers.”",
            "rewards": [
                {"rewardName": "Quo’s Mistress mystery",
                "rewardQuantity": 1}
            ],
            "nextCardsID": [
                "BifröstCampFlamingos04"
            ]
        },
        {
            "cardID": "BifröstCampFlamingos04",
            "cardText": "Check the traps",
            "addedText": "“The flamingos’ only natural predators here are reptiles like snakes and lizards, so we set ground traps for them like this one,” Siobhan explains to you, gesturing to a complex metal and wood mechanism on the ground. <br><br> “See the red sash ring painted around that tree trunk? Be careful if you ever see that; it means a trap is hidden in the undergrowth nearby. Something triggered this one and ran off,” another inmate says, pointing to blood on the trap’s metal teeth of the trap. <br><br> “Two of you stay here and reset the trap, everyone else, let’s track the predator.”",
            "nextCardsID": [
                "BifröstCampFlamingos05",
                "BifröstCampFlamingos06"
            ]
        },
        {
            "cardID": "BifröstCampFlamingos05",
            "cardText": "Follow flamingo tracks",
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3},
                {"rewardName": "shake snake fang",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampFlamingos07"
            ],
            "challengeSuccessText": "You all split off, looking for signs of the predator who threatens the precious birds. It isn’t long before you spot blood on a fern leaf. You call the others over, and within seconds you spot a green and black striped snake coiled near the base of a tree. <br><br> “Good find! Keep this as a souvenir,” Imitator Convict Siobhan says to you after she quickly dispatches the snake with her hunting knife. She places a single fang in your palm that resembles a needle, only curved and slightly thicker. “Don’t let yourself get pricked by it though, not unless you’re a fan of seizures. They call them shake snakes for a reason. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampFlamingos07"
            ],
            "challengeFailText": "You all split off, looking for signs of the predator who threatens the precious birds. It isn’t long before you spot blood on a fern leaf. You call the others over, and within seconds Siobhan spots a green and black striped snake coiled near the base of a tree. <br><br> “Good job leading me here.” Imitator Convict Siobhan says to you as she quickly dispatches the snake with her hunting knife. "
        },
        {
            "cardID": "BifröstCampFlamingos06",
            "cardText": "Repair traps",
            "challengeStat": "Hand",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 3},
                {"rewardName": "shake snake fang",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampFlamingos07"
            ],
            "challengeSuccessText": "The traps have to be durable, and easily reset in order to be useful here in the middle of the jungle. Repairing the trap is tricky work, but one of the prisoners stays back with you to work on it. “I wonder what set it off?” She wonders, wiping a bit of the blood off of the metal jaws. “Ah, here we go. Shake snake.” She hands you a single fang that resembles a needle, only curved and slightly thicker. “Your payment, for helping us today. Oh, and don’t prick yourself with it. The seizures the snake venom causes are not fun. Trust me. I know first hand.” ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampFlamingos07"
            ],
            "challengeFailText": "The traps have to be durable, and easily reset in order to be useful here in the middle of the jungle. Repairing the trap is tricky work, but one of the prisoners stays back with you to work on it. “Tanks for helping me with this,” she says, just before the trap snaps shut accidentally. She resets it on her own this time. "
        },
        {
            "cardID": "BifröstCampFlamingos07",
            "cardText": "Try a flamingo call",
            "challengeStat": "Voice",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 4}
            ],
            "challengeSuccessCards": [
                "BifröstCampFlamingos08"
            ],
            "challengeSuccessText": "“The gathering call is much different than the calming call that we learned before,” Imitator Convict Siobhan states. You find yourself in a clearing much like earlier in the day. This one again has a pile of flamingo food, but no flamingos. She begins making a noise that sounds like a pig chasing a sheep chasing a monkey. You feel ridiculous, but you try to join in with her, creating something much worse than anyone would normally experience in a barnyard. Sure enough though, four beautifully colored flamingos glide downward in the clearing and begin feeding on the bait. You switch sounds, approach with the comb, and are rewarded with a sack full of loose feathers. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2}
            ],
            "challengeFailCards": [
                "BifröstCampFlamingos08"
            ],
            "challengeFailText": "“The gathering call is much different than the calming call that we learned before,” Imitator Convict Siobhan states. You find yourself in a clearing much like earlier in the day. This one again has a pile of flamingo food, but no flamingos. She begins making a noise that sounds like a pig chasing a sheep chasing a monkey. You feel ridiculous, but you try to join in with her, creating something much worse than anyone would normally experience in a barnyard. Sure enough though, two beautifully colored flamingos glide downward in the clearing and begin feeding on the bait. You switch sounds, approach with the comb, and are rewarded with a sack of loose feathers. Siobhan collects most of the feathers, but you still feel that you contributed in some small part. "
        },
        {
            "cardID": "BifröstCampFlamingos08",
            "cardText": "Collect stray feathers",
            "addedText": "You are with three other prisoners, circling a watering hole, collecting feathers that have fallen from flamingos while drinking. You notice something odd in the undergrowth not far from you. It is shaped like a small starfish, and is bright yellow. Upon closer inspection, you realize it is a mushroom. You pluck it from the ground and hold it up to the other inmates, asking if it is edible.<br><br> “Brainstar! I’ll take that, thank you very much!” says one of the young men as he swipes if deftly from your hand before you can even react. <br><br> “No! No! You owe me one!” says the other prisoner, shoving the first to the ground. The two start wrestling with each other, each trying to take the mushroom you found.",
            "nextCardsID": [
                "BifröstCampFlamingos09",
                "BifröstCampFlamingos10"            ]
        },
        {
            "cardID": "BifröstCampFlamingos09",
            "cardText": "Physically break up the fight. A mushroom isn’t worth this.",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2},
                {"rewardName": "Guards mystery",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampFlamingos11"
            ],
            "challengeSuccessText": "You shove yourself between the two men, trying to separate them, but that only gets you involved even more in the fight. Neither of them is much of a match for you though, and you are able to separate them. You grab the brainstar mushroom from the one who has it and throw it back into the bushes. And not a moment too soon.<br><br> “Guards! Heads up!” cries out another prisoner who looks to be little more than a teenager. Even though they were at each others’ throats a moment ago, both men immediately brush it off as if it were nothing. They walk away together, not even looking back into the bushes where you threw the mushroom. You see no guards. “That’s good that you broke up the fight. Brainstar mushrooms - they get you high,” the teenaged inmate says, eyes darting side to side “They are quite illegal here, and in high demand among certain inmates. But we should go. If the guards suspect someone possesses brainstars, there’ll be big trouble - even for you.” You both walk away. Still, you can see no guards. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Health",
                "rewardQuantity": -10},
                {"rewardName": "Guards mystery",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampFlamingos11"
            ],
            "challengeFailText": "You shove yourself between the two men, trying to separate them, but that only gets you involved even more in the fight. Either one of them would be a match for you though, so you only get a punch in the ribs for your valiant efforts.<br><br> “Guards! Heads up!” cries out another prisoner who looks to be little more than a teenager. Even though they were at each others’ throats a moment ago, both men immediately brush it off as if it were nothing. They walk away together, tossing the mushroom off into the bushes. You see no guards. “That’s good that you tried to break up the fight. Brainstar mushrooms - they get you high,” the teenaged inmate says, eyes darting side to side “They are quite illegal here, and in high demand among certain inmates. But we should go. If the guards suspect someone possesses brainstars, there’ll be big trouble - even for you.” You both walk away. Still, you can see no guards. "
        },
        {
            "cardID": "BifröstCampFlamingos10",
            "cardText": "Demand the ‘brainstar’ back, since you found it first",
            "challengeStat": "Heart",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2},
                {"rewardName": "Guards mystery",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstCampFlamingos11"
            ],
            "challengeSuccessText": "Counting on the idea that words are more powerful than fists, you demand loudly that the two young men stop their fighting immediately and return the mushroom to you. They are stunned at your verbal aggressiveness and they pause to look at you. “Guards! Heads up!” cries out another prisoner who looks to be little more than a teenager. Even though they were at each others’ throats a moment ago, both men immediately brush it off as if it were nothing. They walk away together, tossing the mushroom off into the bushes. You see no guards. “That’s good that you yelled some sense into them. Brainstar mushrooms - they get you high,” the teenaged inmate says, eyes darting side to side “They are quite illegal here, and in high demand among certain inmates. But we should go. If the guards suspect someone possesses brainstars, there’ll be big trouble - even for you.” You both walk away. Still, you can see no guards. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Guards mystery",
                "rewardQuantity": 1}
            ],
            "challengeFailCards": [
                "BifröstCampFlamingos11"
            ],
            "challengeFailText": "Counting on the idea that words are more powerful than fists, you demand loudly that the two young men stop their fighting immediately and return the mushroom to you. Your verbal aggressiveness as absolutely no effect. “Guards! Heads up!” cries out another prisoner who looks to be little more than a teenager. Even though they were at each others’ throats a moment ago, both men immediately brush it off as if it were nothing. They walk away together, tossing the mushroom off into the bushes. You see no guards. “That’s good that you tried to yell some sense into them. Brainstar mushrooms - they get you high,” the teenaged inmate says, eyes darting side to side “They are quite illegal here, and in high demand among certain inmates. But we should go. If the guards suspect someone possesses brainstars, there’ll be big trouble - even for you.” You both walk away. Still, you can see no guards. "
        },
        {
            "cardID": "BifröstCampFlamingos11",
            "cardText": "Head back to camp",
            "addedText": "The Sun low in the sky, Imitator Convict Siobhan announces it is time to head back to camp. Siobhan chats with you casually, the two of you slowly falling back behind the other prisoners with sacks of feathers slung over their shoulders. She completely stops you. “Have you heard the rumors circling about you?” <br><br> “What rumors?” you ask. <br><br> “There is more than one inmate here on Bifrost who believes you may be a snoop, an agent of Her Royal Imperial Majesty, who is checking up on us. Maybe the Empire doesn’t trust us? Maybe they don’t trust the guards? What do you have to say for yourself?”",
            "nextCardsID": [
                "BifröstCampFlamingos12"
            ]
        },
        {
            "cardID": "BifröstCampFlamingos12",
            "cardText": "Deny being a snoop",
            "challengeStat": "Voice",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 2},
                {"rewardName": "Siobhan’s esteem",
                "rewardQuantity": 1},
                {"rewardName": "time of day",
                "rewardQuantity": 3,
                "reqHidden": true}
            ],
            "challengeSuccessCards": [
                "BifröstCamp01BurnHill"
            ],
            "challengeSuccessText": "You vehemently deny being an agent of the Queen, although that is what a snoop would probably do too. You make some very strong points, reminding her that you were nearly dead when you were found shipwrecked, and that you have had no access to any important strategic information about the island or economic information about the feather trade. “Yes, those are good points,” Siobhan replies. “I trust you anyways, and besides, if you’re up to something the guards will spot it.” <br><br> Once again, you look around. As always - there is not a guard to be seen. ",
            "challengeFailRewards": [
                {"rewardName": "Bifröst Convicts",
                "rewardQuantity": 1},
                {"rewardName": "Siobhan’s esteem",
                "rewardQuantity": 1},
                {"rewardName": "time of day",
                "rewardQuantity": 3,
                "reqHidden": true}
            ],
            "challengeFailCards": [
                "BifröstCamp01BurnHill"
            ],
            "challengeFailText": "You vehemently deny being an agent of the Queen, although that is what a snoop would probably do too. You probably shouldn’t have mentioned that. But you recover, and remind her that you were nearly dead when you were found shipwrecked, and that you have had no access to any important strategic information about the island or economic information about the feather trade. “Yes, those are reasonable points,” Siobhan replies. “I suppose I trust you anyways, and besides, if you’re up to something the guards will spot it.” <br><br> Once again, you look around. As always - there is not a guard to be seen. "
        },






        {
            "cardID": "BifröstCamp05QuoOffice",
            "cardText": "Go to Quo's office",
            "locationName": "Bifröst Prison Camp, office",
            "locationDescription": "Quo’s own office.",
            "reqs": [
                {"reqName": "Quo’s key",
                "reqRule": "=",
                "reqQuantity": 1}
            ],
            "addedText": "You shouldn’t be here yet.",
            "nextCardsID": [
                "BifröstCamp01Office"
            ]
        },
        {
            "cardID": "BifröstCamp05Warehouses",
            "cardText": "Enter the warehouses",
            "locationName": "Bifröst Prison Camp, warehouses",
            "locationDescription": "A series of large wooden warehouses, built up against the prison wall.",
            "reqs": [
                {"reqName": "Quo’s key",
                "reqRule": "=",
                "reqQuantity": 1}
            ],
            "addedText": "You shouldn’t be here yet.",
            "nextCardsID": [
                "BifröstCamp01Wall"
            ]
        }
    ]
}
