{
    "locations": [
        {
            "cardID": "Bifröst0",
            "locationName": "Bifröst island",
            "addedText": "You wake up.",
            "nextCardsID": [
                "Death"
            ]
        },
        {
            "cardID": "Death",
            "locationName": "?",
            "addedText": "Oops, you seem to have died.",
            "nextCardsID": [
                "Bifröst0"
            ]
        },
        {
            "cardID": "Insanity",
            "locationName": "?",
            "addedText": "Oh dear. The pressures of the world seem to have driven you over the brink of insanity.",
            "nextCardsID": [
                "Bifröst0"
            ]
        }
    ],
    "actions": [
        {
            "cardID": "Island",
            "locationName": "Bifröst island",
            "addedText": "You wake up.",
            "nextCardsID": [
                "Bifröst0"
            ]
        }
    ],
    "stories": [
        {
            "cardID": "Medusa0",
            "locationName": "?",
            "locationDescription": "",
            "addedText": "You dream of darkness<br>You dream of the cold<br>You dream of screams<br>",
            "nextCardsID": [
                "Medusa1"
            ]
        },
        {
            "cardID": "MedusaA",
            "locationName": "A",
            "locationDescription": "AA",
            "addedText": "MedusaA",
            "nextCardsID": [
                "Medusa2"
            ]
        },
        {
            "cardID": "MedusaB",
            "locationName": "B",
            "locationDescription": "BB",
            "addedText": "MedusaB",
            "reqs": [
                {"reqName": "Royal shilling",
                "reqRule": ">=",
                "reqQuantity": 3}
            ],
            "nextCardsID": [
                "Medusa2"
            ]
        },
        {
            "cardID": "Medusa1",
            "locationName": "The Medusa",
            "locationDescription": "Inside a choatic cabin",
            "cardText": "Wake Up",
            "addedText": "You realize that you are not dreaming. You have woken up. The darkness, the cold, the screams - they are all real. In addition, gravity doesn’t seem to be working properly.<br><br>You can’t see anything in the pitch black, and it is hard to get your bearings in this commotion. But amidst the noise, you remember there was a lantern near your bunk.",
            "reqs": [
                {"reqName": "Royal shilling",
                "reqRule": ">=",
                "reqQuantity": 4}
            ],
            "nextCardsID": [
                "Medusa2"
            ]
        },
        {
            "cardID": "Medusa2",
            "cardText": "Search for the Lantern",
            "challengeStat": "Eye",
            "challengeRoll": 8,
            "challengeSuccessRewards": [
                {"rewardName": "lantern",
                "rewardQuantity": 1},
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": 10}
            ],
            "challengeSuccessCards": [
                "Medusa3",
                "Medusa4"
            ],
            "challengeSuccessText": "You grope around in the darkness in the general area where you think the lantern was. Your fingers make contact with the still-warm metal, and you oen the shutter. Your light helps another passenger get their own lantern working too. Now you can literally shed light on what’s going on.",
            "challengeFailRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": 10}
            ],
            "challengeFailCards": [
                "Medusa3",
                "Medusa4"
            ],
            "challengeFailText": "You grope around in the darkness in the general area where you think the lantern was, but can’t seem to find anything there. Thankfully, another passenger finds their own lantern and illuminates the scene before you.",
            "addedText": "You are surrounded by other lost souls wearing their nightclothes. The floor and all of the walls around you are crooked. Water is pooling up in the lowest corner of the room.<br><br>“We’re sinking! The ship is sinking!” Someone cries out. Perhaps it wasn’t wise to travel on a ship named the Medusa?<br><br>“Remain calm!” Orders a middle-aged man who thinks he has control over the situation. The deck and walls do not agree. They groan and tilt even more. Several of the bunks spring loose from the floor, and slide across the room. <br><br>There is only one door to this cabin. It is free of water. (for the time being). At this rate, the Medusa isn’t going to stay afloat much longer. You give it 10 minutes tops."
        },
        {
            "cardID": "Medusa3",
            "cardText": "Grab your belongings",
            "addedText": "You spend some time searching, but many of your belongings have been scattered around the room. There is too little light and too much chaos to find them. You are able to grab your jacket though, which contains a few useful possessions. You rush toward the door.",
            "rewards": [
                {"rewardName": "deerskin jacket",
                "rewardQuantity": 1},
                {"rewardName": "Royal shilling",
                "rewardQuantity": 117},
                {"rewardName": "inkpot",
                "rewardQuantity": 1},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "Medusa4"
            ]
        },
        {
            "cardID": "Medusa4",
            "cardText": "Hurry to the door",
            "addedText": "You head toward the door. Amidst all the chaos, that is easier said than done. A few bunks have toppled over and are blocking your path.",
            "rewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "Medusa5"
            ]
        },
        {
            "cardID": "Medusa5",
            "cardText": "Climb over the bunks",
            "challengeStat": "Hand",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa6"
            ],
            "challengeSuccessText": "You find a path over some toppled wardrobes that brings you directly to the door. Several others follow your route over the debris.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa6"
            ],
            "challengeFailText": "You have trouble finding your way through the toppled furniture, cursing when the jagged edge of a broken bedpost scrapes you along the thigh.",
            "addedText": "The door of the cabin is jammed shut. The tiny glimmer of light peeking through the cracks show that in some areas the frame is pulled away from the door, and in others, it is pressed tight. The ship’s tilting must be putting enormous strain on the walls. That is not a good sign."
        },
        {
            "cardID": "Medusa6",
            "cardText": "Force the door open",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "Health",
                "rewardQuantity": -5},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],

            "challengeSuccessCards": [
                "Medusa7"
            ],
            "challengeSuccessText": "With a squeal of wood on wood, the door flies open under the force of your shoulder. The dark cabin is immediately invaded by the blaze of a lightning strike, as well as a large panicking man in a green nightgown.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -10},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa7"
            ],
            "challengeFailText": "Your shoulder is displaced more easily than the door. You step back to take another run at it, when the door bursts open inward, propelled by a large man in a green nightgown.",
            "addedText": "“My paintings! My paintings! Where are my masterpieces!” the man in the green nightgown yells, shoving past people to go backwards away from the door."
        },
        {
            "cardID": "Medusa7",
            "cardText": "Convince the man to flee",
            "challengeStat": "Voice",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa8"
            ],
            "challengeSuccessText": "You tell the man that he’s as good as dead if he goes in to look for his paintings. Seeing the water filling the room, he realizes that his safety is more important than his valuables.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa8"
            ],
            "challengeFailText": "You tell the man that he’s as good as dead if he goes in to look for his paintings. Your words have no effect, as he shoves you violently out of his way and runs to the back of the cabin, searching for his possessions.",
            "addedText": "There are two children here in this cabin - they really should be the first to escape."
        },
        {
            "cardID": "Medusa8",
            "cardText": "Help the children escape first",
            "challengeStat": "Heart",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 2},
                {"rewardName": "Health",
                "rewardQuantity": -5},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa9",
                "Medusa10"
            ],
            "challengeSuccessText": "Using your words as much your own body, you manage to hold back several men and women, insisting that the children leave before anyone else.",
            "challengeFailRewards": [
                {"rewardName": "Medusa crew gratitude",
                "rewardQuantity": 1},
                {"rewardName": "Health",
                "rewardQuantity": -10},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa9",
                "Medusa10"
            ],
            "challengeFailText": "Using your words as much your own body, you try to hold back the crowd so that the children can leave. But several men and women barge through, shoving you to the floor and pushing their way out first.",
            "addedText": "Following the children out the door, you rush along a short hall and up a ladder. The scene outside the ship’s cabin is one of pandemonium. The night sky is a churning mass of dark clouds. The Medusa is assaulted by wind and rain. The crewmembers who have remained at their posts are trying hard, but they cannot take command of the flailing mainsail. A large wave hits the ship and a mast sweeps into the mainsail, tearing through the fabric. Ominous creaking sounds are coming from somewhere - possibly everywhere.<br><br>You can see three lifeboats are already in the ocean, two of which are still upright. One more is not far from you, but it is very quickly filling up with people."
        },
        {
            "cardID": "Medusa9",
            "locationDescription": "A ferocious storm threatens the lilting ship",
            "cardText": "Quickly search for abandoned valuables",
            "addedText": "Anything that isn’t nailed down has gone overboard. Even some things that were nailed down have gone overboard. You really need to get to that lifeboat.",
            "rewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "Medusa10"
            ]
        },
        {
            "cardID": "Medusa10",
            "cardText": "Hurry to the nearest lifeboat",
            "addedText": "There are three men in crew uniforms and brandishing sabres, standing in front of the lifeboat. “The lifeboat is for children and the elderly only!” one yells. “The ship is leaning, but is remaining afloat! All others must remain on board to wait for help to come!”<br><br>There are no children or elderly nearby, and many of the crewmembers already seem to be in lifeboats. You suspect that these three are just waiting for some of their buddies and then they’ll be on the lifeboat too. How will you attempt to get on the boat?",
            "rewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "Medusa11",
                "Medusa12",
                "Medusa13",
                "Medusa14",
                "Medusa15",
                "Medusa16",
                "Medusa17"
            ]
        },
        {
            "cardID": "Medusa11",
            "cardText": "Wait for the crew to let you on",
            "addedText": "The three sabre-weilding crewmembers are not letting anyone on the lifeboat, even though there are no children or elderly waiting to get on. Another sail tears loose as a strong wave hits the ship. The three crew start yelling at their mates to come over to the lifeboat. It is clear that the lifeboat isn’t going to be around much longer - the ship may not be either. You really need to get onto that lifeboat.",
            "rewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "reqs": [
                {"reqName": "minute until The Medusa sinks",
                "reqRule": ">=",
                "reqQuantity": 1}
            ],
            "nextCardsID": [
                "Medusa11",
                "Medusa12",
                "Medusa13",
                "Medusa14",
                "Medusa15",
                "Medusa16",
                "Medusa17"
            ]
        },
        {
            "cardID": "Medusa12",
            "cardText": "Force your way onto the lifeboat",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "With a punch to the throat and a knee to a chest, you shove your way past the first crewmember.<br><br>“Fine, you just get on then,” one of the others says, “but no one else!”",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "You take a swing at the first crewmember. He dodges, grabs your arm and pins you against the bulwark.<br><br>“You wanna get past me? Fine. Go right ahead!” he says as and another crewmember grabs your other arm and they throw you over the edge of the ship. You go tumbling through the air and land with a crash into the roiling, icy ocean."
        },
        {
            "cardID": "Medusa13",
            "cardText": "Climb the rigging and drop down onto the lifeboat",
            "challengeStat": "Hand",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "You double back and leap onto a cabin roof, made easier by the fact that the walls are no longer quite vertical. You shimmy up a pole, where you cross over to a rope that passes over the heads of the crewmembers, allowing you to drop down into the lifeboat. They are too busy yelling at the passengers to notice you",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "You leap onto a cabin roof, made easier by the fact that the walls are no longer quite vertical. You shimmy up a pole, where you cross over to a rope that passes over the heads of the crewmembers, you attempt to slide along the rope, but it is slick with rain and your grip fails you. You fall, smashing your left leg into the bulwark as you tumble overboard, landing with a crash into the roiling, icy ocean."
        },
        {
            "cardID": "Medusa14",
            "cardText": "Plead with the sailor emotionally",
            "challengeStat": "Heart",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "“Please, you have to let me on the lifeboat! I’m the sole breadwinner for my family,” you lie. ”There are seven children. And my mother - she is sick and needs me to pay for her medication! If you let me die here, you’ll be sentencing them all to death!”<br><br>You must be a good actor - or just lucky. The leader of the three sailors says a few expletives and shoves you onto the lifeboat",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "“Please, you have to let me on the lifeboat! I’m the sole breadwinner for my family,” you lie. ”There are seven children. And my mother - she is sick and needs me to pay for her medication! If you let me die here, you’ll be sentencing them all to death!”<br><br>“We’re all in the same boat here, pal. You wanna get back to them so bad? We'll lend you a hand!”<br><br>The three sailors decide to make an example of you to the crowd and grab your limbs and throw you over the edge of the ship. You go tumbling through the air and land with a crash into the roiling, icy ocean."
        },
        {
            "cardID": "Medusa15",
            "cardText": "Search for another way onto the lifeboat",
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "You realize that since there is a ladder on this side of the lifeboat, and it appears to be symmetrical, there must be one on the other side too, facing the ocean. You step back from the crowd and rush around to the stern of the lifeboat. Gingerly, you leap over the edge of the ship, carefully still holding on. You cross hand over hand, holding onto the railing, making your way to the lifeboat’s other ladder. The rain chills your hands to the bone, but you manage to climb the other ladder and discretely enter the back of the lifeboat",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "You realize that since there is a ladder on this side of the lifeboat, and it appears to be symmetrical, there must be one on the other side too, facing the ocean. You step back from the crowd and rush around to the stern of the lifeboat. Gingerly, you leap over the edge of the ship, carefully still holding on. You cross hand over hand, holding onto the railing, making your way to the lifeboat’s other ladder.<br><br>“Oh, no you don’t” says one of the sailors as he realizes what you are doing. Exposed as you are, you can do nothing to defend yourself. He runs over to you and bashes the butt of his sabre into your knuckles. Your hands give way and you plummet overboard, landing with a crash into the roiling, icy ocean."
        },
        {
            "cardID": "Medusa16",
            "cardText": "Convince the sailors that you are royalty",
            "challengeStat": "Voice",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeSuccessCards": [
                "Medusa18"
            ],
            "challengeSuccessText": "“My good sir, I will have you know that I am the cousin of the Crown Prince,” you lie, “eighth in line to the throne of the Royal Empire, and I am on a secret mission of utmost importance to the colonies. I implore you to let me on board that lifeboat. My family shall owe you a great debt.”<br><br>The sailor looks at you, eyes narrowed. For a moment you wonder if you should have made up a higher station. Eighth? Maybe fourth would place your life at a higher value. Perhaps twelfth would have sounded more plausible.<br><br>“Cousin to the Crown Prince, you say?” He looks at you skeptically. “You’re probably lying, but just in case, you should know my name’s Helmsman Asa from Eelingborough. You make sure you take care of my wife if I don’t make it through this,” he says as he hurries you up the ladder onto the lifeboat.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "challengeFailCards": [
                "Medusa19"
            ],
            "challengeFailText": "“My good sir, I will have you know that I am the cousin of the Crown Prince,” you lie, “eighth in line to the throne of the Royal Empire, and I am on a secret mission of utmost importance to the colonies. I implore you to let me on board that lifeboat. My family shall owe you a great debt.”<br><br>The sailor looks at you, eyes narrowed. For a moment you wonder if you should have made up a higher station. Eighth? Maybe fourth would place your life at a higher value. Perhaps twelfth would have sounded more plausible.<br><br>“Cousin to the Crown Prince, you say?” He looks at you skeptically.<br><br>“Well, I outrank you, cuz I’m the bloody Queen,” he grins as his buddies help grab your arms from behind and throw you over the edge of the ship. You go tumbling through the air and land with a crash into the roiling, icy ocean."
        },
        {
            "cardID": "Medusa17",
            "cardText": "Bribe the sailor",
            "addedText": "“Thanks for the cash mate, but my life's worth more than a few shillings”. The sailor grins as his buddies help grab your arms from behind and throw you over the edge of the ship. You go tumbling through the air and land with a crash into the roiling, icy ocean.",
            "rewards": [
                {"rewardName": "Royal shilling",
                "rewardQuantity": -117},
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "reqs": [
                {"reqName": "Royal shilling",
                "reqRule": ">=",
                "reqQuantity": 1117}
            ],
            "nextCardsID": [
                "Medusa19"
            ]
        },
        {
            "cardID": "Medusa18",
            "cardText": "Wait for the lifeboat to be launched",
            "addedText": "One of the others yells “Andie! Let’s go!” A sailor (Andie perhaps?) leaps into the lifeboat beside you, and her crewmates start to untie the knots to release the lifeboat into the heaving ocean waves. The knots are wet from the storm, and one of the crewmembers begins to hack at the ropes with his sabre.<BR><BR>“No!” One of his buddies yells, but it is too late. The blade cuts through the rope, releasing only the front of the lifeboat, pitching you and all the other lifeboat passengers head over heels into the ocean.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": -20},
                {"rewardName": "minute until The Medusa sinks",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "Medusa20"
            ]
        },
        {
            "cardID": "Medusa19",
            "locationDescription": "The cold ocean pulls downwards on your wet clothing as the wind blows saltwater into your eyes",
            "cardText": "Flounder",
            "addedText": "You flounder, barely managing to get your head above water to take a gasp of air. You look up and see the lifeboat swinging precariously above you. Some commotion ensues on the deck of the ship. A rope snaps. The bow of the lifeboat falls, and it does a nosedive into the ocean, spilling out all who thought they had found relative safety. Screaming people are doing their best to stay afloat, but you can barely hear them over the storm - and one other noise. You don’t know what the noise is coming from - the masts, the sails, or the hull of the Medusa itself, but something is about to come apart.",
            "nextCardsID": [
                "Medusa20"
            ]
        },
        {
            "cardID": "Medusa20",
            "cardText": "Uh oh",
            "locationDescription": "The cold ocean pulls downwards on your wet clothing as the wind blows saltwater into your eyes",
            "addedText": "You see it coming. The previous waves were nothing compared to this one. It looms beyond the Medusa. Maybe it a trick of your imagination, but it almost seems to stand still and gather its strength before lightning illuminates the sky and the wave begins its assault on the ship. The hull of the poor Medusa folds as if it were a paper ship designed to compactly fit inside of a bottle. The masts and sails slap the sea as if the ship is still trying to fight back. The wave engulfs you next, and when you come up for air again, there is no ship to be seen. You pull yourself up onto a piece of debris, and remember little else for the next several hours.",
            "nextCardsID": [
                "Medusa21"
            ]
        },
        {
            "cardID": "Medusa21",
            "cardText": "continue",
            "locationDescription": "?",
            "addedText": "You dream of darkness again<br><br>You dream of the cold again<br><BR>You dream of screams again.",
            "nextCardsID": [
                "Medusa22"
            ]
        },
        {
            "cardID": "Medusa22",
            "cardText": "continue",
            "addedText": "You dream of the fins of undersea predators circling you in the water.<br><br>You dream of the slimy arms of an octopus, wrapping around your body, dragging you down.<br><br>You dream of a jaguar in the night bearing its teeth and leaning in to get a good sniff of you.",
            "nextCardsID": [
                "BifröstShore0"
            ]
        },
        {
            "cardID": "BifröstShore0",
            "cardText": "Wake up",
            "locationName": "?",
            "locationDescription": "",
            "addedText": "Blinding light sears your eyes as you open them. You can’t even tell what you’re looking at except that it is too bright to see. You feel hot and cold at the same time. You realize why as a wave crashes over you and you choke on some sea water. You get up onto your hands and knees and you cough the salty sea water out and you wipe your wet face with your wet hands. You see a large black rock - you see many large black rocks, jagged from the pummelling they receive from the relentless ocean waves. You crawl over to a close, relatively dry one and throw yourself down on it. You close your eyes. First you try to take account of your own status. You feel pain and wet all over, but you still seem to be in one piece. You feel like crap though.",
            "rewards": [
                {"rewardName": "Health",
                "rewardQuantity": -50}
            ],
            "nextCardsID": [
                "BifröstShore1"
            ]
        },
        {
            "cardID": "BifröstShore1",
            "cardText": "Close your eyes",
            "addedText": "When you open your eyes again, your blurry vision begins to resolve and you take in your surroundings. In one direction is the ocean, vast, yet relatively calm. The sky is ridiculously blue, as if to call you a liar. You imagine a nervous cloud saying “Storm? What storm? I didn’t just sink a ship and kill hundreds of innocents with a storm!” You chuckle to yourself.",
            "rewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -50}
            ],
            "nextCardsID": [
                "BifröstShore2"
            ]
        },
        {
            "cardID": "BifröstShore2",
            "cardText": "Look around",
            "locationDescription": "Some rocky, desolate shore",
            "addedText": "The whole coast is made of this same black rock. Inland the rocks look smooth, but they get rougher and more jagged the further out into the water they go. The ocean seems to have deposited you in some kind of tidal pool, along with a fair amount of debris from the Medusa’s shipwreck.<br><br>You are just wondering whether anyone else survived the wreck when you are distracted by a squawking sound and notice a bright red parrot sitting on a rock not far behind you. Parrots aren’t scavengers are they? Or is it waiting for you to die so that it can eat you? It continues to watch you while you try to stand up and figure out your next move.<br><br>You have no idea where you are, you have no clothes except your torn nightgown AND JACKET YOU MANAGED TO SAVE, and you are alone, as far as you know.<br><br>Oh, and you have no tools, food or fresh water. “Good luck, me!” You wish yourself.",
            "rewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -5},
                {"rewardName": "lantern",
                "rewardQuantity": -1},
                {"rewardName": "inkwell",
                "rewardQuantity": -1}
            ],
            "nextCardsID": [
                "BifröstShore3a",
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ]
        },
        {
            "cardID": "BifröstShore3a",
            "cardText": "Search debris",
            "reqs": [
                {"reqName": "top hat",
                "reqRule": "=",
                "reqQuantity": 0}
            ],
            "challengeStat": "Eye",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "top hat",
                "rewardQuantity": 1}
            ],
            "challengeSuccessCards": [
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeSuccessText": "You search between nearby rocks for anything you can find: supplies from the Medusa, food rations from a wrecked lifeboat, even other survivors - if there are any. After a fair bit of searching, you find a worn top hat that is waterlogged, but it will serve to keep the sun off your head. The parrot is still sitting there, watching you.",
            "challengeFailRewards": [
            ],
            "challengeFailCards": [
                "BifröstShore3a",
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeFailText": "You search between nearby rocks for anything you can find: supplies from the Medusa, food rations from a wrecked lifeboat, even other survivors - if there are any. You fail to find anything other than large rocks and chunks of soaked wood. The parrot is still sitting there, watching you."
        },
        {
            "cardID": "BifröstShore3b",
            "cardText": "Search debris",
            "reqs": [
                {"reqName": "top hat",
                "reqRule": "=",
                "reqQuantity": 1},
                {"reqName": "iron nail",
                "reqRule": ">",
                "reqQuantity": 0}
            ],
            "challengeStat": "Eye",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "nails",
                "rewardQuantity": 7}
            ],
            "challengeSuccessCards": [
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeSuccessText": "You find a soggy chunk of wood with several strong nails in it. The wood falls apart easily, freeing the nails. Perhaps you can use these somehow to help you survive. The parrot is still sitting there, watching you.",
            "challengeFailRewards": [
            ],
            "challengeFailCards": [
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeFailText": "You fail to find anything other than large rocks and chunks of soaked wood. The parrot is still sitting there, watching you."
        },
        {
            "cardID": "BifröstShore4",
            "cardText": "Talk to parrot",
            "challengeStat": "Voice",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
                {"rewardName": "Mind",
                "rewardQuantity": -5}
            ],
            "challengeSuccessCards": [
                "BifröstShore6"
            ],
            "challengeSuccessText": "Although you are already a little worried about your remaining sanity, talking to a parrot couldn’t really hurt, could it?<br><br>“Hello, by any chance, are you a trained parrot? Is there someone nearby who keeps you as a pet? Hello? Hello?”br><br>The parrot cocks its head and looks at you - certainly a bizarre curiosity. Only when it does a couple of hops onto a different rock, do you realize that the parrot wasn’t sitting on a rock at all, but rather a huge piece of debris from the shipwreck. The debris isn’t just a piece of the hull though - it’s more ornate. You walk over to inspect it.",
            "challengeFailRewards": [
            ],
            "challengeFailCards": [
                "BifröstShore3a",
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeFailText": "You try to produce sound, but your hoarse throat cracks and you you just cough up a little more seawater."
        },
        {
            "cardID": "BifröstShore5",
            "cardText": "Try to catch parrot",
            "challengeStat": "Hand",
            "challengeRoll": 3,
            "challengeSuccessRewards": [
            ],
            "challengeSuccessCards": [
                "BifröstShore6"
            ],
            "challengeSuccessText": "You climb up to a high rock, and lunge at the parrot. It lazily hops to another rock, and continues to stare at you. It does not seem to be at all fazed. You notice that the rock it had just been sitting on was not a rock at all, but rather a large ornate piece of debris from the Medusa. The parrot watches you investigate further.<br><br>You notice that the rock it had just been sitting on was not a rock at all, but rather a large ornate piece of debris from the Medusa. The parrot watches you investigate further.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "challengeFailCards": [
                "BifröstShore3a",
                "BifröstShore3b",
                "BifröstShore4",
                "BifröstShore5"
            ],
            "challengeFailText": "You try to clamber up into a better position to take the bird unawares, but the parrot just watches you limp along as blood trickles down your scraped shin."
        },
        {
            "cardID": "BifröstShore6",
            "cardText": "Investigate the debris",
            "addedText": "As you get closer to the debris, you realize it isn’t debris - it’s a crate, and a sturdy one at that. Metal plating and rivets keep it all held together solidly, but the one long hinge in the back seems to have been damaged quite badly by the waves and rocks. Although it weighs more than you do, you manage to shift the chest so that it is upright, causing water to flow out. The crate must have been damaged enough for the seal to have been broken.",
            "nextCardsID": [
                "BifröstShore7",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ]
        },
        {
            "cardID": "BifröstShore7",
            "cardText": "Smash it with a rock",
            "challengeStat": "Brawn",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
            ],
            "challengeSuccessCards": [
                "BifröstShore10"
            ],
            "challengeSuccessText": "There is no shortage of sharp heavy rocks. You select the largest one you can lift, and bring it crashing down on the hinges of the crate.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "challengeFailCards": [
                "BifröstShore7",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ],
            "challengeFailText": "You try to clamber up into a better position to take the bird unawares, but the parrot just watches you limp along as blood trickles down your scraped shin."
        },
        {
            "cardID": "BifröstShore8a",
            "cardText": "Pick the lock",
            "challengeStat": "Hand",
            "challengeRoll": 6,
            "challengeSuccessRewards": [
            ],
            "challengeSuccessCards": [
                "BifröstShore10"
            ],
            "challengeSuccessText": "You climb up to a high rock, and lunge at the parrot. It lazily hops to another rock, and continues to stare at you. It does not seem to be at all fazed. You notice that the rock it had just been sitting on was not a rock at all, but rather a large ornate piece of debris from the Medusa. The parrot watches you investigate further.<br><br>You notice that the rock it had just been sitting on was not a rock at all, but rather a large ornate piece of debris from the Medusa. The parrot watches you investigate further.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "challengeFailCards": [
                "BifröstShore7",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ],
            "challengeFailText": "You try to clamber up into a better position to take the bird unawares, but the parrot just watches you limp along as blood trickles down your scraped shin."
        },
        {
            "cardID": "BifröstShore8b",
            "cardText": "Pick the lock",
            "challengeStat": "Hand",
            "challengeRoll": 3,
            "reqs": [
                {"reqName": "iron nail",
                "reqRule": ">=",
                "reqQuantity": 1}
            ],
            "challengeSuccessRewards": [
            ],
            "challengeSuccessCards": [
                "BifröstShore6"
            ],
            "challengeSuccessText": "You climb up to a high rock, and lunge at the parrot. It lazily hops to another rock, and continues to stare at you. It does not seem to be at all fazed. You notice that the rock it had just been sitting on was not a rock at all, but rather a large ornate piece of debris from the Medusa. The parrot watches you investigate further.<br><br>You notice that the rock it had just been sitting on was not a rock at all, but rather a large ornate piece of debris from the Medusa. The parrot watches you investigate further.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "challengeFailCards": [
                "BifröstShore7",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ],
            "challengeFailText": "You try to clamber up into a better position to take the bird unawares, but the parrot just watches you limp along as blood trickles down your scraped shin."
        },
        {
            "cardID": "BifröstShore9",
            "cardText": "Search for a leak",
            "challengeStat": "Eye",
            "challengeRoll": 4,
            "challengeSuccessRewards": [
            ],
            "challengeSuccessCards": [
                "BifröstShore10"
            ],
            "challengeSuccessText": "You climb up to a high rock, and lunge at the parrot. It lazily hops to another rock, and continues to stare at you. It does not seem to be at all fazed. You notice that the rock it had just been sitting on was not a rock at all, but rather a large ornate piece of debris from the Medusa. The parrot watches you investigate further.<br><br>You notice that the rock it had just been sitting on was not a rock at all, but rather a large ornate piece of debris from the Medusa. The parrot watches you investigate further.",
            "challengeFailRewards": [
                {"rewardName": "Health",
                "rewardQuantity": -5}
            ],
            "challengeFailCards": [
                "BifröstShore7",
                "BifröstShore8a",
                "BifröstShore8b",
                "BifröstShore9"
            ],
            "challengeFailText": "You try to clamber up into a better position to take the bird unawares, but the parrot just watches you limp along as blood trickles down your scraped shin."
        },
        {
            "cardID": "BifröstShore10",
            "cardText": "Open the crate",
            "addedText": "As you get closer to the debris, you realize it isn’t debris - it’s a crate, and a sturdy one at that. Metal plating and rivets keep it all held together solidly, but the one long hinge in the back seems to have been damaged quite badly by the waves and rocks. Although it weighs more than you do, you manage to shift the chest so that it is upright, causing water to flow out. The crate must have been damaged enough for the seal to have been broken.",
            "nextCardsID": [
                "BifröstShore11"
            ]
        }
    ]
}
